[{"que":"This artist's name means bird and he was known for his fantastic frescoes and love of perspective devices. Some common themes: hunt, battles, trompe l'oeil.","opt1":"Castagno","opt2":"Botticelli","opt3":"Uccello","opt4":"Lippi","ans":"Uccello"},{"que":"This artist's name comes from the old spelling of fox. He was primarily known for his paintings of people: women and children in particular. A typical model often had reddish hair. He spent his later life in Cagnes on the French Riviera.","opt1":"Rothko","opt2":"Picasso","opt3":"Matisse","opt4":"Renoir","ans":"Renoir"},{"que":"This artist's nickname meant 'Oxhead' which we know him by. His 'Madonna Enthroned' or 'Maesta' in Florence shows a Byzantine style throne that recedes into space and surrounds her with angels.","opt1":"Duccio","opt2":"Cimabue","opt3":"Giotto","opt4":"Michelangelo","ans":"Cimabue"},{"que":"This painter known for his paintings of the Spanish court in the late 18th century and early 19th century, suddenly went deaf, which spurred the creation of engravings of the underside and mysteries of court life, 'Los Caprichos'.","opt1":"Goya","opt2":"El Greco","opt3":"Caravaggio","opt4":"Velazquez","ans":"Goya"},{"que":"His family came from the perfume city of Grasse in the South of France, and there is now a perfume refinery and museum of the same name,. Famous for 'The Swing' (1768) a rather impudent peek up a swinging woman's skirts.","opt1":"Fouquet","opt2":"Clouet","opt3":"Watteau","opt4":"Fragonard","ans":"Fragonard"},{"que":"Distant relative of the artist in question 5, she brought her delicate touch to the art world of the 19th century despite the 'revolutionary' aspects of the group she participated with. Because of her social status she mainly did domestic themes.","opt1":"Bonheur","opt2":"Morisot","opt3":"Bouguereau","opt4":"Cassatt","ans":"Morisot"},{"que":"His name means 'butcher' and his light, delicate art graced the early 18th century. Madame de Pompadour commissioned 'The Rising of the Sun' as a tapestry.","opt1":"Zurburan","opt2":"Boucher","opt3":"Greuze","opt4":"Ter Borch","ans":"Boucher"},{"que":"This artist's name sounds very close to the name of a famous Swiss sewing machine manufacturer. One of his most famous extravaganzas in Rome was the 'Ecstasy of St Teresa', had gilt rays leading to the sun.","opt1":"Raphael","opt2":"Singer","opt3":"Bernini","opt4":"Borromini","ans":"Bernini"},{"que":"This artist's name means 'light' despite the fact that his art wasn't exactly filled with that quality. His bold linear quality was more obvious and he did murals for the workers in the factories of machines and people.","opt1":"Chagall","opt2":"Fuseli","opt3":"Lichtenstein","opt4":"Leger","ans":"Leger"},{"que":"The French term for someone's passion or hobby comes from this artist's love for the violin. His perfect bathers were perhaps his most famous theme. Which is the expression?","opt1":"Violon de David","opt2":"Violon de Delacroix","opt3":"Violon D'Ingres.","opt4":"Violon de Neron","ans":"Violon D'Ingres."}]