[{"que":"Actor Jack Lemmon was born in a hospital elevator in Boston, USA. ","opt1":"True ","opt2":"False ","ans":"True "},{"que":"It was Mark Twain who once said, \"Bigamy is having one wife too many. Monogamy is the same.\"","opt1":"True ","opt2":"False ","ans":"False "},{"que":"A young hedgehog is called a kitten.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"The 'Roosevelt' was the name of the ship that Robert Edwin Peary used when he became the first man to reach the North Pole on 6th April 1909. ","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Minnie Higginbottom was the real name of Kathy Staff, who played Nora Batty in the world's longest running sitcom, 'Last of the Summer Wine'.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Artist Beryl Cook was a former seaside landlady, who taught herself to paint amusing, saucy paintings of voluptuous women, which can now be bought for up to £40,000 each. ","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Irish comedian Frank Carson is the wag who came up with the quotation: \"Opera is when a guy gets stabbed in the back and instead of bleeding, he sings.\"","opt1":"True ","opt2":"False ","ans":"False "},{"que":"The quintessential English red public telephone box (kiosk) was designed by Sir Giles Gilbert Scott.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"When ABBA won the Eurovision Song Contest with the song 'Waterloo' in 1974, the United Kingdom jury gave Sweden the maximum score of 12 points for this winning song.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Bob Hope was attributed with this remark in 1965, \"They are doing things on the screen now that I wouldn't do in bed, if I could.\"","opt1":"True ","opt2":"False ","ans":"True "},{"que":"British artist Damien Hirst has produced a piece of artwork called 'For the Love of God' with just under a thousand rubies entirely covering a human skull. ","opt1":"True ","opt2":"False ","ans":"False "},{"que":"British comedian, Les Dawson, is associated with the following quotation: I saw six men kicking and punching the mother-in-law. My neighbour said \"Are you going to help?\" I said, \"No, six should be enough.\"","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Author Ambrose Bierce, who wrote the Devil's Dictionary (1906), had a father who named all his thirteen children, beginning with the letter A. ","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Astronaut Jim Lovell uttered the words \"Please be informed that there is a Santa Claus\" whilst on board Apollo 8.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Windsor Castle is known as 'The Key to England'.","opt1":"True ","opt2":"False ","ans":"False "}]