[{"que":"Which is the first city to be taken back from the Turks in the First Crusade?","opt1":"Tyre","opt2":"Aleppo","opt3":"Antioch","opt4":"Nicaea","ans":"Nicaea"},{"que":"This city is where the Crusaders spent the winter before moving on to sack Constantinople during the Fourth Crusade.","opt1":"Nicopolis","opt2":"Zara","opt3":"Venice","opt4":"Lepanto","ans":"Zara"},{"que":"Stephen of St. Cloyes was responsible for leading what Crusade in 1212?","opt1":"The Albigenisian Crusade","opt2":"The Fifth Crusade","opt3":"The Children's Crusade","opt4":"The Sixth Crusade","ans":"The Children's Crusade"},{"que":"Which Pope called for the Crusades?","opt1":"Urban II","opt2":"Nicholas I","opt3":"John X","opt4":"Gregory VII","ans":"Urban II"},{"que":"The pope who initiated the First Crusade was?","opt1":"Paschal II","opt2":"Gregory VII","opt3":"Benedict III","opt4":"Urban II","ans":"Urban II"},{"que":"What was the battle cry of the Christian warriors?","opt1":"\"God, Pope, King and Country!\"","opt2":"\"For Pope and the Faith!\"","opt3":"\"Live free or die!\"","opt4":"\"God wills it!\"","ans":"\"God wills it!\""},{"que":"Who was the leader of the Church at the time of the initiation of the Crusades? He is also credited with being the initiator.","opt1":"Pope Urban II","opt2":"Alexander Pope","opt3":"Pope Gregory VII","opt4":"Pope John Paul II","ans":"Pope Urban II"},{"que":"The Western Christians learned of the difficulty with the Seljuk Turks by way of a letter sent from the Emperor of Byzantinium.  What was his name?","opt1":"Eleanor of Aquitaine","opt2":"King John","opt3":"Constantine","opt4":"Alexius I Komnenos","ans":"Alexius I Komnenos"},{"que":"Which battle of the Third Crusade which was fought in 1192 was the last to be fought between Richard and Saladin?","opt1":"Battle of Tel Abib","opt2":"Battle of Arabia","opt3":"Battle of Turkey","opt4":"Battle of Jaffa","ans":"Battle of Jaffa"},{"que":"The last Grand Master of the Knights Templar was Jacques de Molay. He was burned at the stake in 1314 by whose decree?","opt1":"King Philip IV of France","opt2":"Pope Innocent VII","opt3":"King Richard I of England","opt4":"Queen Isabella of Spain","ans":"King Philip IV of France"},{"que":"Prelude to the Crusades! The total defeat and capture of this Byzantine Emperor at the Battle of Manzikert (Aug 19, 1071 AD) by Alp Arslan, Seljuk Sultan of Rum, proved to Western monarchs that Byzantium had forfeited the right to be the defenders of the Holy Land. Which Emperor was it?","opt1":"Nicephorus III","opt2":"Alexius I","opt3":"Michael VII","opt4":"Romanus IV","ans":"Romanus IV"},{"que":"This Byzantine Emperor made the fateful mistake of sending an embassy (March 1095 AD) to Pope Urban II asking for aid from the West to help against the Seljuk Turks. Which Emperor was it?","opt1":"Andronicus I","opt2":"Alexius I","opt3":"Manuel I","opt4":"John II","ans":"Alexius I"},{"que":"Before crossing into Imperial territory the 'People's Crusade' stopped in the town of Belgrade (part of the Kingdom of Hungary). A riot between the 'Crusaders' and the Hungarians soon broke out which resulted in the death of about 4000 Hungarians. Which event began the riot?","opt1":"an argument over the price of holy relics","opt2":"an argument over the price of bread","opt3":"an argument over the price of a pair of shoes","opt4":"an argument over the price of crosses","ans":"an argument over the price of a pair of shoes"},{"que":"Firuz, after being recently fined by the authorities for blackmarketeering, betrayed this Turkish city to Bohemond, Prince of Taranto (leader of the Norman contingent from southern Italy) on the evening of June 3, 1098 AD. Which city was it?","opt1":"Nicomedia","opt2":"Acre","opt3":"Nicaea","opt4":"Antioch","ans":"Antioch"},{"que":"Pope Urban II would not live to hear the news of this city's capture by the First Crusade on July 15, 1099 AD. Which city was it?","opt1":"Jerusalem","opt2":"Bethlehem","opt3":"Edessa","opt4":"Nazareth","ans":"Jerusalem"},{"que":"After this Crusade Leader was declared 'King of Jerusalem' (Jul 17, 1099 AD) he reportedly said 'I will not wear a crown of gold where my master had worn a crown of thorns.' Which individual was it?","opt1":"Godfrey of Bouillon, Duke of Lower Lorraine","opt2":"Bohemond, Prince of Taranto","opt3":"Raymond, Count of Toulouse","opt4":"Robert, Duke of Normandy","ans":"Godfrey of Bouillon, Duke of Lower Lorraine"},{"que":"The fall of this city on December 24, 1144 AD to the Muslims under Zengi, prompted Pope Eugenius III to declare the Second Crusade in 1145 AD. Which city was it?","opt1":"Acre","opt2":"Antioch","opt3":"Edessa","opt4":"Jerusalem","ans":"Edessa"},{"que":"The French Crusaders of the Second Crusade (1147-1149 AD) were led by their king. Which King of France was it?","opt1":"Louis VIII, the Lion","opt2":"Louis VI, the Fat","opt3":"Louis IX, the Saint","opt4":"Louis VII, the Young","ans":"Louis VII, the Young"},{"que":"The German Crusaders of the Second Crusade (1147-1149 AD) were led by the Holy Roman Emperor. Which Emperor was it?","opt1":"Frederick I, Barbarossa","opt2":"Charles I","opt3":"Conrad III","opt4":"Otto I","ans":"Conrad III"},{"que":"This Muslim leader declared a Islamic Holy War (1187 AD) to crush the Crusader States established in the Holy Land after the First Crusade. Which individual was it?","opt1":"Salah al-Deen","opt2":"Nur ed-Din","opt3":"Skirkuh","opt4":"Malik as-Salih","ans":"Salah al-Deen"},{"que":"This French King was the other famous leader of the Third Crusade (1189-1192 AD). During his reign (1180-1223 AD) he would greatly consolidate and strengthen the French monarchy. Which King of France was it?","opt1":"Louis IX, the Saint","opt2":"Philip II, Augustus","opt3":"Philip IV, the Fair","opt4":"Louis XI, the Universal Spider","ans":"Philip II, Augustus"},{"que":"Richard I, King of England, brought the Third Crusade (1189-1192 AD) to a successful conclusion when he forced Saladin to sign a peace treaty giving back the city of Jersalem (captured by Saladin in 1187 AD) to Christendom. True or False?","opt1":"True ","opt2":"False ","ans":"False "},{"que":"The Fourth Crusade (1202-1204 AD) was primarily led by this Italian maritime power. Which city was it?","opt1":"Pisa","opt2":"Venice","opt3":"Naples","opt4":"Genoa","ans":"Venice"},{"que":"This famous city of the Byzantine Empire fell to the Fourth Crusade (1202-1204 AD) after only a six day siege and was systematically plundered. Which Imperial city was it?","opt1":"Thessalonica","opt2":"Nicomedia","opt3":"Constantinople","opt4":"Nicaea","ans":"Constantinople"},{"que":"The Fifth Crusade (1217-1221 AD) was directed towards the Ayoubid Sultanate of Egypt. The Crusaders would lay siege to the city of Damietta from May 1218-Nov 1219 AD. During the siege which future Saint would act as a mediator between the Christian leaders and Sultan al-Kamil?","opt1":"Dominic of Spain","opt2":"Benedict of Monte Cassino","opt3":"Francis of Assisi","opt4":"Catherine of Siena","ans":"Francis of Assisi"},{"que":"The Sixth Crusade (1228-1229 AD) was led by this excommunicated Holy Roman Emperor. His prestige (he was known as 'Stupor Mundi' Wonder of the World) quickly gained him a peaceful settlement with Sultan al-Kamil after being in the Holy Land for only five months. Which Emperor was it?","opt1":"Philip of Swabia","opt2":"Henry VI","opt3":"Otto IV","opt4":"Frederick II","ans":"Frederick II"},{"que":"The Seventh Crusade (1248-1254 AD) was led by Louis IX, the Saint, King of France, and was once again directed at Egypt. Louis IX was defeated and captured at the Battle of Abu Abdulla (Apr 6, 1250 AD) but was soon released (May 6, 1250 AD) after agreeing to return which recently captured city?","opt1":"Cairo","opt2":"Thebes","opt3":"Damietta","opt4":"Alexandria","ans":"Damietta"},{"que":"The Eighth Crusade (1270 AD) was again led by Louis IX but was directed against Tunis in northern Africa. While laying siege to Carthage (Jul-Aug) what happened to Louis?","opt1":"Animal Attack Death","opt2":"he was assassinated","opt3":"died from a disease ","opt4":"None","ans":"died from a disease "},{"que":"The Ninth Crusade (1271-1272 AD) was led by Prince Edward of England and accomplished nothing tangible. Edward though would become King of England in 1272 AD and be better known in history as...?","opt1":"Edward I, King of England","opt2":"Edward 'Hammer of the Welsh'","opt3":"Edward 'Longpanks'","opt4":"Edward 'the Black Prince'","ans":"Edward I, King of England"}]