[{"que":"Challenger: Laertes\r\nReason for challenge: I am simply challenging the Prince of Denmark to a friendly fencing match. There is no way it turns into a highly fatal duel or anything, even though he just killed my father and drove my sister to suicide.\r\n\r\nWho is the challenged party?","opt1":"Horatio","opt2":"Rosencrantz","opt3":"Guildenstern","opt4":"Hamlet","ans":"Hamlet"},{"que":"Challenger: Mercutio\r\nReason for challenge: This guy just challenged my friend to a duel, and my friend just turned him down! This disgrace will not stand! I don't know what made my friend back down, but this dog is going down one way or another. I challenge him in my friend's stead!\r\n\r\nWho is the challenged party?","opt1":"Paris","opt2":"Tybalt","opt3":"Romeo","opt4":"Benvolio","ans":"Tybalt"},{"que":"Challenger: Roderigo\r\nReason for challenge: I'm in love with Desdemona, even though she's married. Turns out she's aiming at this other military officer, her husband's ex-lieutenant who she's helping to get his job back! I will wait for him in the dark and jump him as a way to overleap his affront to my pursuit of the fair Desdemona!\r\n\r\nWho is the challenged party?","opt1":"Lodovico","opt2":"Othello","opt3":"Cassio","opt4":"Montano","ans":"Cassio"},{"que":"Challenger: Harry Percy, aka Hotspur\r\nReason for challenge: I've been leading this rebellion for a whole play now, all of \"Henry IV Part I\", and it finally has come to a head. I know I need to defeat my lifelong enemy on the king's side, he has always hated me and I have always hated him. He's a highborn ne'er-do-well and I'm a proper soldier, so we've been on a collision course for ages. \r\n\r\nWho is the challenged party?","opt1":"Duke of Aumerle","opt2":"Poins","opt3":"Prince Hal","opt4":"Lord Clifford","ans":"Prince Hal"},{"que":"Challenger: Benedick\r\nReason for challenge: The love of my life, Beatrice, has just asked me to challenge someone to a fight to the death. I don't really want to because he's my friend but I have to, I love her! Also this guy did slander her cousin in public, causing immense shame. Yeah, I'll go challenge him now.\r\n\r\nWho is the challenged party?","opt1":"Leonato","opt2":"Claudio","opt3":"Don John","opt4":"Don Pedro","ans":"Claudio"},{"que":"Challenge: Cloten\r\nReason for challenge: I am the son of the Queen and stepson of the king, Cymbeline, and on my way to seek out Posthumus, my enemy. But instead I run into a surly backwoods knave who taunts me and calls me stupid! The arrogance! I will fight him immediately!\r\n\r\nWho is the challenged party?","opt1":"Leonatus","opt2":"Pisanio","opt3":"Guiderius","opt4":"Arviragus","ans":"Guiderius"},{"que":"Challenger: Earl of Richmond\r\nReason for challenge: My opponent is a wretched tyrant who killed the sons of Edward IV. He's a cruel, physically deformed man with no mercy or right to the throne. I will challenge and kill him to do my nation right and reunite the warring factions of England.\r\n\r\nWho is the challenged party?","opt1":"Henry VII","opt2":"Edward V","opt3":"King John","opt4":"Richard III","ans":"Richard III"},{"que":"Challenger: Edgar\r\nReason for challenge: I have, since my flight from court, followed the awful plight of my father, the Earl of Gloucester, and the poor old King Lear. I realize now that my brother, who I thought was my friend and ally, is the one responsible for having my father so cruelly abused. He just offered to fight whoever challenged him for crimes he has committed - I will challenge him!\r\n\r\nWho is the challenged party?","opt1":"Curan","opt2":"Oswald","opt3":"Kent","opt4":"Edmund","ans":"Edmund"},{"que":"Challenger: Henry Bolingbroke\r\nReason for challenge: This guy I want to fight killed my uncle, the duke of Gloucester. Now, I know that the king, Richard II, put him up to it but I don't care, I want to make the point that even kings can't order deaths like this for their political gain. So I challenged him in full view of the court and now he HAS to fight me.\r\n\r\nWho is the challenged party?","opt1":"John Gaunt","opt2":"Duke of York","opt3":"Earl of Northumberland","opt4":"Thomas Mowbray","ans":"Thomas Mowbray"},{"que":"Challenger: Macduff\r\nReason for challenge: This tyrant king has killed my wife and children, and run my country into the ground. For Scotland!\r\n\r\nWho is the challenged party?","opt1":"Ross","opt2":"Malcolm","opt3":"Duncan","opt4":"Macbeth","ans":"Macbeth"},{"que":"The first three questions pertain to the mad Ophelia's sad bouquet of flowers and herbs in Act IV of \"Hamlet\". When Laertes enters, Ophelia gives him an herb which symbolizes \"remembrance\", and adds (more to the absent Hamlet than to Laertes) \"Pray you, love, remember.\" Which herb is it?","opt1":"Rue","opt2":"Sage","opt3":"Thyme","opt4":"Rosemary","ans":"Rosemary"},{"que":"Ophelia gives Laertes some flowers which symbolize \"thoughts\". Their name is derived from the French word for \"thoughts\". Which flower is it?","opt1":"Daisies","opt2":"Columbines","opt3":"Pansies","opt4":"Violets","ans":"Pansies"},{"que":"Ophelia regrets being unable to give any of these flowers, since \"they wither'd all when my father died\". Which flower are they?","opt1":"Violets","opt2":"Daisies","opt3":"Lilies","opt4":"Roses","ans":"Violets"},{"que":"Shakespeare's great narrative poem \"Venus and Adonis\" is a retelling of the mythological story of the goddess of love's ironic infatuation with the indifferent hunter Adonis, and its tragic denouement. Adonis is fatally gored by a wild boar and is found by Venus lying dead in the forest; what flowers spring up around him, watered by his blood?","opt1":"Poppies","opt2":"Anemones","opt3":"Tulips","opt4":"Roses","ans":"Anemones"},{"que":"\"Where the Bee Sucks, There Suck I\" from \"The Tempest\" is sung by the sprite Ariel, set free at the play's end by his master Prospero. According to the song, Ariel \"couches\" in the bell of this flower \"when owls do cry\". What flower is it? ","opt1":"Canterbury bell","opt2":"Cowslip","opt3":"Bluebell","opt4":"Foxglove","ans":"Cowslip"},{"que":"At the end of \"Love's Labours Lost\", two songs are sung; one symbolizes Winter and one Spring. The \"Spring\" song lists four different flowers; which of these flowers is NOT mentioned?","opt1":"Cuckoo-buds (buttercups)","opt2":"Daffodils","opt3":"Daisies","opt4":"Violets","ans":"Daffodils"},{"que":"In a beautiful speech from \"A Midsummer Night's Dream\" which begins \"I know a bank where the wild thyme grows\", Oberon describes to Puck the bower where his wife, Titania, makes her bed. According to this speech, which two kinds of wild roses form a bower over the fairy-queen's bed?","opt1":"Musk roses and eglantine","opt2":"Cabbage and musk roses","opt3":"Damask roses and eglantine","opt4":"Moss and damask roses","ans":"Musk roses and eglantine"},{"que":"In the comedy \"Twelfth Night, or What You Will\", the melancholy song \"Come Away, Death\" is sung at the request of Orsino, the Duke of Illyria, who is brooding over his unrequited love for Olivia. The singer of this song asks to be laid in a grove of which \"sad\" tree? ","opt1":"Willow","opt2":"Hemlock","opt3":"Yew","opt4":"Cypress","ans":"Cypress"},{"que":"In \"Richard II\", Act II scene IV, a Welsh captain observes to the Earl of Salisbury that the people believe the King to be dead, because of certain signs in nature. What type of trees, according to the captain, have all withered in the country?","opt1":"Bay","opt2":"Oak","opt3":"Arborvitae","opt4":"Myrtle","ans":"Bay"},{"que":"Samphire is a succulent herb which grows on rocky cliffs by the sea. It is mentioned by Edgar in Act IV, scene 6 of \"King Lear\", when he tries to convince his blind father, Gloucester, who wants to end his life, that they are at the edge of a cliff. To heighten the illusion, Edgar describes someone gathering samphire (\"Halfway down hangs one who gathers samphire- Dreadful trade!\". Samphire gatherers were lowered by rope along the cliff side; it was, indeed, a hazardous task). Which fisherman-saint was samphire named in honor of? ","opt1":"St. Phillip","opt2":"St. Philomel","opt3":"St. Fidelis","opt4":"St. Peter","ans":"St. Peter"},{"que":"Which herb completes this line from Sonnet #99: \"The lily I condemned for thy hand, And buds of ________ had stol'n thy hair.\"?","opt1":"Lemon Balm","opt2":"Rosemary","opt3":"Lavander","opt4":"Marjoram","ans":"Marjoram"},{"que":"In Act IV, scene 1 of \"Macbeth\", the witches are concocting their vile brew. Among the revolting ingredients is the root of this poisonous herb, which figured in the death of Socrates.","opt1":"Mandrake","opt2":"Nightshade","opt3":"Larkspur","opt4":"Hemlock","ans":"Hemlock"},{"que":"In \"Romeo and Juliet\" what type of fruiting tree grows outside Juliet's window, from which the nightingale sings each night?","opt1":"Orange","opt2":"Pomegranate","opt3":"Fig","opt4":"Apple","ans":"Pomegranate"},{"que":"In Act IV, scene III of \"Othello\", Desdemona is burdened with a sense of foreboding and thoughts of death. She sings the \"Willow song\", which she had heard sung as a child by a love-sick maidservant of her mother's who had been abandoned by her lover. Which Italian composer wrote a memorable setting of this song in his operatic version of Shakespeare's tragedy? ","opt1":"Vincenzo Bellini","opt2":"Giuseppe Verdi","opt3":"Giacomo Puccini","opt4":"Antonio Vivaldi","ans":"Giuseppe Verdi"},{"que":"The comic denouement of \"The Merry Wives of Windsor\" takes place in Windsor park. The park is dominated by a tree, which is associated with Herne, the ghostly hunter of Windsor. What type of tree is it?","opt1":"Ash","opt2":"Sycamore","opt3":"Oak","opt4":"Fir","ans":"Oak"},{"que":"Which Harry is our Shakespeare talking about here?\r\n\"...A little touch of Harry in the night.\"","opt1":"King Henry V","opt2":"King Henry IV Part I","opt3":"King Henry VI Part II","opt4":"King Henry VIII","ans":"King Henry V"},{"que":"Someone's in trouble here;  In which play do we find out who's speaking?\r\n\"....Art thou not, fatal vision, sensible to feeling, as to sight?...\"","opt1":"King Lear","opt2":"Othello, The Moor of Venice","opt3":"Macbeth","opt4":"Hamlet, Prince of Denmark","ans":"Macbeth"},{"que":"Which complicated plot are these words from?\r\n\"....My father had a daughter loved a man, as it might be, perhaps, were I a woman, I should your lordship.\"","opt1":"The Tempest","opt2":"Twelfth Night","opt3":"As You Like It","opt4":"King Lear","ans":"Twelfth Night"},{"que":"Sounds like a shady character.   Which play includes these words?\r\n\"Was ever woman in this humour woo'd?   Was ever woman in this humour won?   I'll have her, but not for long.   What!  I, that kill'd her husband and his father....\"","opt1":"Troilus and Cressida","opt2":"Henry VIII","opt3":"King John","opt4":"Richard III","ans":"Richard III"},{"que":"These beautiful lines are from which play?\r\n\"There is a willow grows aslant a brook, that shows his hoar leaves in the glassy stream...\"","opt1":"All's Well That Ends Well","opt2":"A Midsummer Night's Dream`","opt3":"Titus Andronicus","opt4":"Hamlet, Prince of Denmark","ans":"Hamlet, Prince of Denmark"},{"que":"Desperation!   In which play are the 'men of stones found?'\r\n\"Howl, howl, howl, howl!   O, you are men of stones....\"","opt1":"Titus Andronicus","opt2":"The Tempest","opt3":"Othello, The Moor of Venice","opt4":"King Lear","ans":"King Lear"},{"que":"Another famous speech;  in which play do we hear it?\r\n\"The quality of mercy is not strained;  it droppeth, like the gentle rain of Heaven upon the place beneath....\"","opt1":"The Merchant of Venice","opt2":"Julius Caesar","opt3":"Antony and Cleopatra","opt4":"The Taming of the Shrew","ans":"The Merchant of Venice"},{"que":"The speaker truly loved his country.  Which play is this from?\r\n\"...This blessed plot, this earth, this realm, this England..\"","opt1":"As You Like It","opt2":"Richard II","opt3":"Henry V","opt4":"Cymbeline","ans":"Richard II"},{"que":"Hurt?  Mild word for a mortal wound. In which play do we hear this cry? \r\n\"....Why the devil came you between us?  I was hurt under your arm.\"","opt1":"Macbeth","opt2":"Julius Caesar","opt3":"Hamlet, Prince of Denmark","opt4":"Romeo and Juliet","ans":"Romeo and Juliet"},{"que":"And to conclude, we shall applaud which play?\r\n\"...So, good night unto you all.   \r\nGive me your hands, if we be friends, \r\nand Robin shall restore amends.\"","opt1":"The Winter's Tale","opt2":"All's Well That Ends Well","opt3":"A Midsummer Night's Dream","opt4":"The Comedy of Errors","ans":"A Midsummer Night's Dream"}]