[{"que":"Of all the things that Harry's Uncle Vernon said to Hagrid, what was the thing that upset him the most?","opt1":"Uncle Vernon called Harry's parents weirdos.","opt2":"Uncle Vernon said they'd stomp it (magic) out of him (Harry).","opt3":"Uncle Vernon told Harry that his parents died in a car crash.","opt4":"Uncle Vernon called Dumbledore 'some crackpot old fool'.","ans":"Uncle Vernon called Dumbledore 'some crackpot old fool'."},{"que":"What was unusual about the school song that Dumbledore led everyone in singing after the Sorting Feast?","opt1":"The ghosts danced together while the song was being sung.","opt2":"Everyone sang it to their own favourite tune.","opt3":"The professors sang different words from the students.","opt4":"Each house sang different words.","ans":"Everyone sang it to their own favourite tune."},{"que":"Whose actions were accidentally responsible for Harry's ultimately being named Seeker to his house's Quidditch team?","opt1":"Harry's father","opt2":"Draco Malfoy","opt3":"Professor Dumbledore","opt4":"Hermione Granger","ans":"Draco Malfoy"},{"que":"What flavour of 'Bertie Bott's Every Flavour Bean' did Dumbledore end up with?","opt1":"Peppermint","opt2":"Earwax","opt3":"Vomit","opt4":"Toffee","ans":"Earwax"},{"que":"When did Hermione really become friends with Harry and Ron?","opt1":"After they found Fluffy guarding the trap door.","opt2":"After Harry stood up to Malfoy and saved Neville's Remembrall.","opt3":"After she saved Harry from falling off of his broom in the first Quidditch match.","opt4":"After they saved her from the troll.","ans":"After they saved her from the troll."},{"que":"What was Harry's Christmas present from his Aunt Petunia and Uncle Vernon?","opt1":"An old pair of socks.","opt2":"An old sweater of Dudley's.","opt3":"A tissue.","opt4":"A fifty-pence piece.","ans":"A fifty-pence piece."},{"que":"Harry sees only his mother and father in the Mirror of Erised.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"When asked what he saw when he looked into the mirror, Dumbledore said that he saw himself holding a pair of thick, woollen socks.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"After months of searching, where did they finally find the name of Nicolas Flamel?","opt1":"On the back of a 'Famous Wizard' card from a chocolate frog packet.","opt2":"In 'Hogwarts, a History'.","opt3":"From Professor Binns, in their History of Magic class.","opt4":"In a book from the Restricted Section of the library.","ans":"On the back of a 'Famous Wizard' card from a chocolate frog packet."},{"que":"Who was really trying to steal the stone?","opt1":"Filch","opt2":"Quirrell","opt3":"Lupin","opt4":"Snape","ans":"Quirrell"},{"que":"Where was Ron when Harry and Hermione took Hagrid's dragon to the tallest tower in the castle so that Charlie Weasley's friends could transport it to Romania?","opt1":"Serving detention with Filch for being caught out of bed.","opt2":"Keeping watch in case Malfoy came along and tried to get them in trouble.","opt3":"In hospital, recovering from a dragon bite.","opt4":"Keeping Hagrid company so that he wouldn't be too sad about losing his dragon.","ans":"In hospital, recovering from a dragon bite."},{"que":"When Voldemort, feeling stronger from drinking unicorn blood, tried to attack Harry in the Dark Forest, who saved him?","opt1":"Draco and Fang.","opt2":"Hermione and Neville.","opt3":"Firenze - a centaur.","opt4":"Hagrid.","ans":"Firenze - a centaur."},{"que":"What convinced the friends that Snape (or so they believed) was going to try and get the stone that very night?","opt1":"Harry overheard Quirrell being threatened by Snape.","opt2":"Professor Dumbledore had been summoned away from Hogwarts.","opt3":"Hagrid had let slip the secret of how to get past Fluffy to a stranger in the pub.","opt4":"Hagrid let slip that Snape was one of the professors guarding the stone.","ans":"Professor Dumbledore had been summoned away from Hogwarts."},{"que":"Of the many things guarding the stone, what was the only one that Quirrell/Voldemort could not figure out or overcome?","opt1":"The Devil's Snare.","opt2":"The Mirror of Erised.","opt3":"The Riddle of the Potions.","opt4":"The Wizard's Chess Game.","ans":"The Mirror of Erised."},{"que":"What present did Hagrid give Harry when he came to visit him in the hospital wing? (This is how it happened in the book, not in the movie.)","opt1":"A new broomstick.","opt2":"A book of spells to use on Dudley.","opt3":"A photo album filled with pictures of his parents.","opt4":"The book, 'Quidditch Through the Ages'.","ans":"A photo album filled with pictures of his parents."},{"que":"What occurrence made Uncle Vernon finally decide to lock Harry up and forbid him to return to Hogwarts?","opt1":"Losing the biggest sale of his life when the Masons left","opt2":"Harry dropped Aunt Petunia's pudding on the floor","opt3":"Receiving a letter saying that Harry was forbidden to perform magic outside of school","opt4":"A barn owl dropped a letter on the head of Mrs. Mason","ans":"Receiving a letter saying that Harry was forbidden to perform magic outside of school"},{"que":"Where was Harry when he first heard the voice that no one else could hear?","opt1":"walking down the corridor where Mrs. Norris was found","opt2":"serving detention with Filch the caretaker","opt3":"serving detention with Professor Lockhart","opt4":"walking past Moaning Myrtle's bathroom","ans":"serving detention with Professor Lockhart"},{"que":"Where were Ron, Harry and Hermione coming from when Harry next heard the voice, leading them to discover the writing on the wall and the petrified Mrs. Norris?","opt1":"from Nearly Headless Nick's Deathday Party","opt2":"on the way back from a visit to Hogsmeade","opt3":"from the Hogwarts' Halloween banquet","opt4":"from serving detention in the Forbidden Forest with Hagrid","ans":"from Nearly Headless Nick's Deathday Party"},{"que":"Snape did not believe that Harry was being completely honest about why he was in that corridor, and suggested that he not be allowed to play Quidditch until he was more forthcoming.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"The caretaker Filch hates and is hated by most of the students at Hogwarts. Why does Ron think Filch is so bitter?","opt1":"Filch is a Squib","opt2":"Filch is a muggle","opt3":"Filch is a frustrated Quidditch player","opt4":"Filch is a mudblood","ans":"Filch is a Squib"},{"que":"Who explains to the class about the legend of 'The Chamber of Secrets'?","opt1":"Professor McGonagall","opt2":"Professor Snape","opt3":"Professor Flitwick","opt4":"Professor Binns","ans":"Professor Binns"},{"que":"Why does Ron not like spiders?","opt1":"He doesn't remember, but it was so bad that  his mother put a memory charm on him","opt2":"Fred turned his teddy bear into a spider when he was three","opt3":"George turned Ron into a spider when he was three","opt4":"Fred and George locked him in a closet with a giant spider","ans":"Fred turned his teddy bear into a spider when he was three"},{"que":"Who catches them coming out of Moaning Myrtle's bathroom and deducts five points from Gryffindor?","opt1":"Percy Weasley","opt2":"Filch","opt3":"Professor McGonagall","opt4":"Professor Snape","ans":"Percy Weasley"},{"que":"What did Ron send Harry for a birthday gift?","opt1":"a book on Egyptian curses","opt2":"a broomstick servicing kit","opt3":"a pocket sneakoscope","opt4":"'The Monster Book of Monsters'","ans":"a pocket sneakoscope"},{"que":"What was Harry doing at the Leaky Cauldron when he overheard Mr. and Mrs. Weasley talking about Sirius Black?","opt1":"looking for Percy's missing Head Boy badge","opt2":"going down for breakfast","opt3":"retrieving Scabbers' Rat Tonic from the bar","opt4":"retrieving his glasses from the bar","ans":"retrieving Scabbers' Rat Tonic from the bar"},{"que":"What are Mr. and Mrs. Weasley's first names?","opt1":"Cornelius and Poppy","opt2":"Arthur and Molly","opt3":"Remus and Minerva","opt4":"Albus and Petunia","ans":"Arthur and Molly"},{"que":"Professor Lupin did not give Harry a chance to face down the Boggart in the wardrobe because he assumed that it would take the form of a Dementor and frighten all the other students.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Who else did not get a chance at handling the Boggart?","opt1":"Professor Lupin","opt2":"Ron","opt3":"Hermione","opt4":"Neville","ans":"Hermione"},{"que":"What happened to Harry's Nimbus 2000 broom?","opt1":"Malfoy destroyed it.","opt2":"He crashed into the wall while riding it and it was destroyed.","opt3":"It crashed into the Whomping Willow and was destroyed.","opt4":"It disappeared from his room.","ans":"It crashed into the Whomping Willow and was destroyed."},{"que":"Harry was hiding, under a table in the Three Broomsticks when he overheard Professors McGonagall and Flitwick, Cornelius Fudge (Minister for Magic), Hagrid, and Rosmerta (owner of the Three Broomsticks) discuss the crimes that had Black sent to Azkaban.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"How did Black get the password that gained him entrance into Gryffindor in the middle of the night?","opt1":"He knew of a secret passageway into Gryffindor's common room","opt2":"He used force, not a password, to enter Gryffindor tower","opt3":"Neville gave him the password.","opt4":"Crookshanks took a list from Neville's bedside table","ans":"Crookshanks took a list from Neville's bedside table"},{"que":"Who ultimately ends up in possession of the Maurauder's Map after Harry is seen in Hogsmeade by Malfoy and questioned by Snape? Be careful - this question is not as obvious as it first seems.","opt1":"Professor Dumbledore","opt2":"Professor McGonagall","opt3":"Professor Snape","opt4":"Professor Lupin","ans":"Professor Lupin"},{"que":"It was the Marauder's Map that convinced Lupin that Sirius Black is indeed innocent of the charges that sent him to Azkaban.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"What event finally ended the fight between Ron & Harry, and Hermione?","opt1":"The news that Buckbeak had lost his case","opt2":"Scabbers turned out to be Pettigrew","opt3":"Black was seen standing over Ron's bed brandishing a knife","opt4":"Gryffindor finally won the Quidditch Cup","ans":"The news that Buckbeak had lost his case"},{"que":"Did Gryffindor finally win the Quidditch Cup?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"Did Professor Trelawney finally make an accurate prediction?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"What was Harry dreaming about the first time he woke up with his scar on fire?","opt1":"Voldemort and Wormtail plotting to kill Sirius","opt2":" Voldemort and Wormtail plotting to kill Dumbledore","opt3":"Voldemort and Wormtail plotting to kill him","opt4":"Voldemort and Wormtail plotting to kill Cornelius Fudge","ans":"Voldemort and Wormtail plotting to kill him"},{"que":"The Dursleys no longer kept Harry's school things locked up in the cupboard under the stairs. What made them change their attitude?","opt1":"they were afraid of Hagrid","opt2":"they were afraid of Dumbledore","opt3":"Harry was now allowed to perform magic outside of school","opt4":"Harry had a godfather who had been imprisoned for murder","ans":"Harry had a godfather who had been imprisoned for murder"},{"que":"The Weasleys tried to arrive at the Dursleys' by Floo powder. What impediment made this very difficult to do?","opt1":"the Dursleys didn't have a fireplace","opt2":"the Dursleys' fire was the wrong kind","opt3":"the Dursleys were not on the Floo Network","opt4":"the Dursleys' fireplace was blocked up","ans":"the Dursleys' fireplace was blocked up"},{"que":"Are you supposed to pass a test in order to apparate?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"What's the problem with leprechaun gold?","opt1":"it enchants you and makes you forget everything else","opt2":"it vanishes after a few hours","opt3":"it vanishes after a few weeks","opt4":"it's only good in Ireland","ans":"it vanishes after a few hours"},{"que":"Who was found holding Harry's wand after the Dark Mark had appeared at the Quidditch World Cup?","opt1":"Draco Malfoy","opt2":"Lucius Malfoy","opt3":"Winky","opt4":"Dobby","ans":"Winky"},{"que":"Winky gets a job working in the kitchens of Hogwarts.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Why did Mad-Eye Moody turn Malfoy into a ferret?","opt1":"he was teaching him 'constant vigilance'","opt2":"he hated Malfoy's father","opt3":"Malfoy attacked Harry when Harry's back was turned","opt4":"Malfoy had said something rude about Mad-Eye","ans":"Malfoy attacked Harry when Harry's back was turned"},{"que":"Among his closest friends, who refused to believe that Harry had not put his name into the Goblet of Fire?","opt1":"Ron","opt2":"Sirius","opt3":"Hagrid","opt4":"Hermione","ans":"Ron"},{"que":"Ron was shocked to learn that Hagrid's mother was a giantess. He'd always believed that Hagrid had been hit by a bad Engorgement Charm when he'd been younger.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Who, besides Cedric Diggory, helped Harry figure out the puzzle of understanding the task of golden egg?","opt1":"Moaning Myrtle","opt2":"Dobby","opt3":"Hermione","opt4":"Ron","ans":"Moaning Myrtle"},{"que":"Voldemort could have used the blood from any foe to make the potion that revived him work, but he held out for Harry's blood. Why?","opt1":"simply because he hated Harry that much","opt2":"the special protection Harry received from his mother would also pass to Voldemort","opt3":"to prove that Harry could not apparate","opt4":"to show that Dumbledore could not protect Harry","ans":"the special protection Harry received from his mother would also pass to Voldemort"},{"que":"The Daily Prophet has been writing stories about Harry Potter all summer, and you don't really know whom to believe - Potter or the press. And now you hear word about something else that Harry Potter claims happened in the Muggle suburb where he lives. What is it?","opt1":"Potter and his Muggle cousin were attacked by Dementors","opt2":"Dumbledore is building up an army against the Ministry of Magic","opt3":"A runaway Crumple-Horned Snorkack wreaked havoc","opt4":"You-Know-Who appeared in person and attacked Potter","ans":"Potter and his Muggle cousin were attacked by Dementors"},{"que":"Due to the stories about Harry Potter, the press also reports once more about Sirius Black, alleged Death Eater, who escaped from Azkaban two years ago and has been on the run ever since. You know that there have been numerous followers of You-Know-Who in Black's family. Who is not one of them (that is, who never supported You-Know-Who in any way)?","opt1":"Bellatrix Lestrange","opt2":"Narcissa Malfoy","opt3":"Andromeda Black","opt4":"Regulus Black","ans":"Andromeda Black"},{"que":"Finally you can return to Hogwarts. You are, of course, eager to learn who the prefects of your house (Ravenclaw) are. So who are they?","opt1":"Michael Corner and Cho Chang","opt2":"Anthony Goldstein and Padma Patil","opt3":"Roger Davies and Luna Lovegood","opt4":"Terry Boot and Penelope Clearwater","ans":"Anthony Goldstein and Padma Patil"},{"que":"You have a new Defense Against the Dark Arts teacher, Dolores Umbridge, a horrible woman whom none of the students likes. What is worst, she never lets you do magic in her classes. Instead, you're working with a very boring school book called...","opt1":"\"The Art of Defense\"","opt2":"\"Defensive Magic Made Simple\"","opt3":"\"A Short Course in Defensive Magic\"","opt4":"\"Defensive Magical Theory\"","ans":"\"Defensive Magical Theory\""},{"que":"You overhear a conversation between your fellow Ravenclaws, Terry Boot and Michael Corner, talking about a meeting that must be kept secret. You don't want to eavesdrop, but you can't help hearing them mention an abbreviation. Which one?","opt1":"\"DA\"","opt2":"\"AH\"","opt3":"\"DH\"","opt4":"\"DAH\"","ans":"\"DA\""},{"que":"The Gryffindor Quidditch team has suffered a terrible loss due to Harry Potter's lifelong Quidditch ban. You feel a little sorry for them, although you're of course glad that Gryffindor is now no longer such hard competition. Who is their new Seeker?","opt1":"Ginny Weasley","opt2":"Ron Weasley","opt3":"Seamus Finnigan","opt4":"Lavender Brown","ans":"Ginny Weasley"},{"que":"You hear a few fifth-year students talk about Hagrid's Care of Magical Creatures lesson. He showed them Thestrals, but those two students didn't see any creature. You are able to see Thestrals, and you also know why:","opt1":"you saw someone die","opt2":"you killed someone","opt3":"you have been once under the Imperius Curse","opt4":"it's in your genes","ans":"you saw someone die"},{"que":"What news! Professor Trelawney, the Divination teacher, has been dismissed by Professor Umbridge! No one really liked her, but no one wished her that. Fortunately, Dumbledore has already found a successor, and a very interesting one, too. Who is the new Divination teacher?","opt1":"a Seer called Cassandra","opt2":"an Auror called Kingsley Shacklebolt","opt3":"a Centaur called Firenze","opt4":"a Merman called Bubblus","ans":"a Centaur called Firenze"},{"que":"Cho Chang's friend, Marietta Edgecombe, has been behaving strangely recently, but now she seems to have serious problems. She never shows her face. You happen to see her one day, and you're shocked: she has a number of spots in her face that spell the word....","opt1":"\"TRAITOR\"","opt2":"\"ADVERSARY\"","opt3":"\"SNEAK\"","opt4":"\"ENEMY\"","ans":"\"SNEAK\""},{"que":"Fred and George Weasley have once again lived up to their reputation as troublemakers and pranksters. They have set off a tremendous lot of fireworks in order to upset Umbridge. All students are, of course, delighted. You ask Anthony Goldstein from your house what the fireworks are called, and he answers,","opt1":"\"Furious Fireworks\"","opt2":"\"Wizarding Wheezes\"","opt3":"\"Raging Rockets\"","opt4":"\"Wildfire Whiz-bangs\"","ans":"\"Wildfire Whiz-bangs\""}]