[{"que":"Because my brother's name was James, his childhood favorite was a poem about a young boy named James.  Which author, perhaps more familiar to some as the creator of Winnie-the-Pooh than for his poems, wrote the tragic story of James James Morrison Morrison Weatherby George DuPree?","opt1":"Walt Disney","opt2":"A. A. Milne","opt3":"Lewis Carroll","opt4":"Dr. Seuss","ans":"A. A. Milne"},{"que":"'A Nonsense Alphabet' was delightfully packed with verses that played with sounds and meanings, such as this one:\r\n\r\n\"B was once a little bear,\r\nBeary!\r\nWary!\r\nHairy!\r\nBeary!\r\nTaky cary!\r\nLittle Bear!\"\r\n\r\nWhat author, more usually thought of in connection with nonsense limericks, brought us the poem of which this is the second verse?","opt1":"Edward Lear","opt2":"Lewis Carroll","opt3":"C. S. Lewis","opt4":"Carole King","ans":"Edward Lear"},{"que":"Which of these poems, all written by William Makepeace Thackeray, is given here?\r\n\r\n\"First I saw the white bear, then I saw the black;\r\nThen I saw the camel with a hump upon his back;\r\nThen I saw the grey wolf, with mutton in his maw;\r\nThen I saw the wombat waddle in the straw;\r\nThen I saw the elephant a-waving of his trunk;\r\nThen I saw the monkeys-mercy, how unpleasantly they-smelt!\"","opt1":"Fairy Days","opt2":"At the Zoo","opt3":"A Tragic Story","opt4":"The End of the Play","ans":"At the Zoo"},{"que":"What word is missing from the start of this poem by Robert Louis Stevenson?\r\n\r\nI have a little _____ that goes in and out with me,\r\nAnd what can be the use of him is more than I can see.\r\nHe is very, very like me from the heels up to the head; \r\nAnd I see him jump before me, when I jump into my bed.\"","opt1":"Puppy","opt2":"Sister","opt3":"Shadow","opt4":"Brother","ans":"Shadow"},{"que":"Lewis Carroll included a number of poems in his classic books, including one from 'Alice's Adventures in Wonderland' (1865) which starts with this verse:\r\n\r\n\"'You are old, Father William,' the young man said,\r\n'And your hair has become very white;\r\nAnd yet you incessantly stand on your head-\r\nDo you think, at your age, it is right?'\"\r\n\r\nWith what couplet does 'You are Old, Father William' finish?","opt1":"But now that I'm perfectly sure I have none, / Why, I do it again and again.","opt2":"And the muscular strength that it gave to my jaw, / Has lasted the rest of my life.","opt3":"Do you think I can listen all day to such stuff? / Be off, or I'll kick you downstairs!","opt4":"By the use of this ointment - one shilling the box - / Allow me to sell you a couple?","ans":"Do you think I can listen all day to such stuff? / Be off, or I'll kick you downstairs!"},{"que":"One of my favorite A. A. Milne poems concerns a young lady who is throwing a temper tantrum because it's rice pudding for dinner again.  What was her name?","opt1":"Mary Jane","opt2":"Alice","opt3":"Nan","opt4":"Susan","ans":"Mary Jane"},{"que":"Theodor Geisel, writing as Dr. Seuss, produced a number of book-length poems for children.  Which of them featured Sally and her brother, who get some problematic visitors one rainy afternoon when they have been left alone in the house?","opt1":"Green Eggs and Ham","opt2":"The Cat in the Hat","opt3":"Hop on Pop","opt4":"One Fish, Two Fish, Red Fish, Blue Fish","ans":"The Cat in the Hat"},{"que":"Which master of the humorous poem is responsible for this little ditty, titled 'Celery'?\r\n\r\n\"Celery, raw\r\nDevelops the jaw,\r\nBut celery, stewed,\r\nIs more quietly chewed.\"","opt1":"Oscar Wilde","opt2":"Ogden Nash","opt3":"Mark Twain","opt4":"Dorothy Parker","ans":"Ogden Nash"},{"que":"You may not think of J. R. R. Tolkien as a writer of children's poetry, but we used to have 'The Hobbit' as bedtime reading, and enjoyed the many poems and songs to be found in it.  Which character was responsible for writing 'Roads go ever on' at the end of the adventure?","opt1":"Bilbo Baggins","opt2":"Smaug the Dragon","opt3":"Thorin Oakenshield","opt4":"Bard the Bowman","ans":"Bilbo Baggins"},{"que":"My favorite poet shared my birthday, and as a horse-mad young girl I loved the poem 'Stopping By Woods on a Snowy Evening', with the horse featuring prominently.  Who wrote this poem?","opt1":"William Carlos Williams","opt2":"Robert Frost","opt3":"T. S. Eliot","opt4":"Gerard Manly Hopkins","ans":"Robert Frost"},{"que":"Robert Burns wrote a poem beginning 'wee, sleekit, cow'rin, tim'rous beastie' about which creature?","opt1":"Cat","opt2":"Squirrel","opt3":"Bird ","opt4":"Mouse","ans":"Mouse"},{"que":"'Fifteen men on the dead man's chest' is the first line of a verse which appears in which book by Robert Louis Stevenson?","opt1":"The Master of Ballantrae","opt2":"Kidnapped","opt3":"Catriona","opt4":"Treasure Island","ans":"Treasure Island"},{"que":"'Old Possum's Book of Practical Cats' was written by which author?","opt1":"T S Eliot","opt2":"Roald Dahl","opt3":"Christina Rossetti","opt4":"Walter de la Mare","ans":"T S Eliot"},{"que":"Robert Browning wrote a well known poem about a musician in the town of Hamelin. \r\nWhich instrument did he play?\r\n","opt1":"Trumpet","opt2":"Violin","opt3":"Drums","opt4":"Pipe","ans":"Pipe"},{"que":"Edward Lear introduced us to 'The Pobble', who was missing which part of his body?","opt1":"Fingers","opt2":"Ears","opt3":"Toes","opt4":"Teeth","ans":"Toes"},{"que":"William Shakespeare wrote over 150 poems which had fourteen lines in each of them. What name is given to this kind of poem?","opt1":"Limerick","opt2":"Ode","opt3":"Haiku","opt4":"Sonnet","ans":"Sonnet"},{"que":"The character of Sam appears in which book by Dr. Seuss?","opt1":"Hop on Pop","opt2":"The Cat in the Hat","opt3":"Horton Hears a Who!","opt4":"Green Eggs and Ham","ans":"Green Eggs and Ham"},{"que":"William Wordsworth wrote the poem which begins 'I wandered lonely as a cloud'. What did he see a host of, 'dancing in the breeze'?","opt1":"Elephants","opt2":"Daffodils","opt3":"Bluebells","opt4":"Fairies","ans":"Daffodils"},{"que":"'Idylls of the King' was written by Alfred, Lord Tennyson about which legendary monarch?","opt1":"Arthur","opt2":"Macbeth","opt3":"Lear","opt4":"Henry VIII","ans":"Arthur"},{"que":"Tweedledum and Tweedledee recite a poem to Alice in 'Through the Looking-Glass'. It is about the walrus and which tradesman?","opt1":"Carpenter","opt2":"Builder","opt3":"Plumber","opt4":"Roofer","ans":"Carpenter"},{"que":"Here is the first verse of a funny poem by Ogden Nash.  See if you can guess what goes in the blank.\r\n\r\n\"Belinda lived in a little white house, \r\nWith a little black kitten and a little gray mouse, \r\nAnd a little yellow dog and a little red wagon, \r\nAnd a realio, trulio, little pet ___\"","opt1":"Maggot","opt2":"Dragon.","opt3":"Ferret","opt4":"Bacon","ans":"Dragon."},{"que":"\"I know a funny little man, as quiet as a mouse, \r\nWho does the mischief that is done in everybody's house!\"\r\n\r\nWho's this miscreant (look it up, kids!) of verse?","opt1":"Mr. Nobody","opt2":"Mr. Magoo","opt3":"Mr. Bumblehead","opt4":"Mr. Moxie","ans":"Mr. Nobody"},{"que":"What word do you think goes in the blank?\r\n\r\n\"I have a little ____ that goes in and out with me,\r\nAnd what can be the use of him is more than I can see.\r\nHe is very very like me from the heels up to the head; \r\nAnd I see him jump before me, when I jump into my bed.\"\r\n\r\nFunny thing about this guy, he's never around in the dark...","opt1":"Dolly","opt2":"Shadow","opt3":"Kitty","opt4":"Pet frog","ans":"Shadow"},{"que":"And now for some sailors:\r\n\r\n\"____, ____, and ____ one night\r\nSailed off in a wooden shoe,-\r\nSailed on a river of crystal light,\r\nInto a sea of dew.\"\r\n\r\nWho were those guys?","opt1":"Huey, Dewey, and Louie","opt2":"Longshanks, Girth, and Keen","opt3":"Wynken, Blynken, and Nod","opt4":"Larry, Curly, and Moe","ans":"Wynken, Blynken, and Nod"},{"que":"This is the start of a famous poem by Henry Wadsworth Longfellow, who also wrote \"Hiawatha\".  Can you guess its title?\r\n\r\n\"Between the dark and the daylight\r\nWhen night is beginning to lower, \r\nComes a pause in the day's occupations\r\nThat is known as ____ ____ ____.\"","opt1":"The Leaning Tower","opt2":"The Children's Hour","opt3":"The Evening Flower","opt4":"The Purple Bower","ans":"The Children's Hour"},{"que":"Here's a weird one for you! Any idea who wrote this poem? Here's how it starts:\r\n\r\nin Just-\r\nspring    when the world is mud-\r\nluscious the little balloonman\r\n\r\nwhistles   far   and wee\r\n\r\nand eddieandbill come\r\nrunning from marbles and\r\npiracies and it's\r\nspring","opt1":"Someone who needed to learn about capital letters.","opt2":"Someone who needed typing lessons!","opt3":"Someone who needed to fix the spacebar on his keyboard!","opt4":"e e cummings","ans":"e e cummings"},{"que":"This poem is usually called \" 'Twas The Night Before Christmas\" and many people know it.  It begins:\r\n\r\n\" 'Twas the night before Christmas, when all through the house\r\nNot a creature was stirring, not even a mouse;\r\nThe stockings were hung by the chimney with care, \r\nIn hopes that St. Nicholas soon would be there.\"\r\n\r\nCan you guess its other name, along with the name of the author?","opt1":"\"The Nightmare Before Christmas\" by Tim Burton","opt2":"\"The Santa Clause\" by Tim Taylor","opt3":"\"A Visit from St. Nicholas\" by Clement Moore","opt4":"\"Santa Claus is Coming to Town\" by Freddy Fender","ans":"\"A Visit from St. Nicholas\" by Clement Moore"},{"que":"A famous American poet wrote this tiny poem, called \"Fog\".  Who was it?\r\n\r\n\"The fog comes\r\non little cat feet.\r\n\r\nIt sits looking\r\nover harbor and city\r\non silent haunches\r\nand then, moves on.\"","opt1":"A.A.Milne","opt2":"Lewis Carroll","opt3":"Carl Sandburg","opt4":"Robert Browning","ans":"Carl Sandburg"},{"que":"This is a sad and beautiful poem by a guy who knew how to write a scary story when he wanted to! -- but not this time.  Here's how it starts:\r\n\r\n\"It was many and many a year ago, \r\nIn a kingdom by the sea\r\nThat a maiden there lived, whom you may know\r\nBy the name of ____  ____;\"\r\n\r\nWhat do you think goes in the blank?","opt1":"Agatha Bea","opt2":"Annabel Lee","opt3":"Raggedy Ann","opt4":"Chatty Kathy","ans":"Annabel Lee"},{"que":"Here is a poem by James Whitcomb Riley.  It's about someone who has been in comics and on Broadway.\r\n\r\n\"Little ____ ____'s come to our house to stay, \r\nAn' wash the cups and saucers up, an' brush the crumbs away,\r\nAn' shoo the chickens off the porch, an' dust the hearth, an' sweep,\r\nAn' make the fire, an' bake the bread, an' earn her board-an'-keep;\r\nAn' all us other children, when the supper things is done, \r\nWe set around the kitchen fire an' has the mostest fun\r\nA-list'nin' to the witch tales 'at ___ tells about, \r\nAn' the Gobble-uns 'at gits you\r\n     Ef you\r\n         Don't\r\n            Watch\r\n               Out!\"\r\n","opt1":"\"Little Orphant Annie\"","opt2":"\"Little Mary Sunshine\"","opt3":"\"Little Becky Thatcher\"","opt4":"\"Little Suzy Goodshoes\"","ans":"\"Little Orphant Annie\""}]