[{"que":"One of the first novels in the gothic horror genre was \"Frankenstein; or The Modern Prometheus\". Who was the author?\r\n","opt1":"Mary Shelley","opt2":"Sophia Lee","opt3":"Jane Austen","opt4":"Louisa May Alcott","ans":"Mary Shelley"},{"que":"If you took the works by this writer literally, you might think the U.S. state of Maine is a scary place to live. One of the best known horror writers, this man has used Maine as the setting for many of his books including \"Carrie\", \"Cujo\" and \"Pet Sematary\". Do you know this author?\r\n","opt1":"Stephen King","opt2":"Richard Brautigan","opt3":"Aldous Huxley","opt4":"Dan Brown","ans":"Stephen King"},{"que":"Vampires had been talked - and whispered - about for centuries before this Irish writer wrote the book \"Dracula\" in 1897. Who was he?\r\n","opt1":"Henry Irving","opt2":"Jonathan Swift","opt3":"Bram Stoker","opt4":"Charles Robert Maturin","ans":"Bram Stoker"},{"que":"A \"Hellraiser\" you say? Maybe he was or wasn't but this writer had his novella \"The Hellbound Heart\" made into the \"Hellraiser\" series of movies. Who is this British author who has a keen interest in cinema as well as the written word?\r\n","opt1":"Robert Hichens","opt2":"W.W. Jacobs","opt3":"H.G. Wells","opt4":"Clive Barker","ans":"Clive Barker"},{"que":"\"Someone is Bleeding\" but \"I Am Legend\" so \"The Shrinking Man\" from \"Hell House\" doesn't bother me. Who wrote these stories and many more?\r\n","opt1":"Richard Matheson","opt2":"Max Brooks","opt3":"Douglas Clegg","opt4":"Ray Bradbury","ans":"Richard Matheson"},{"que":"Many authors dream of \"that one big story\". An author who achieved that event did so by writing a book with the title \"Psycho\". Who is he?","opt1":"Ryan Mecum ","opt2":"Robert Bloch","opt3":"Dean Koontz","opt4":"Joe R. Lansdale","ans":"Robert Bloch"},{"que":"If you want to scare people with your writings, you might as well start scaring them while they're children. What author would be so mean to little kids, writing such books as \"The Werewolf in the Living Room\", \"Ghost in the Mirror\" and \"Headless Halloween\"?","opt1":"P.L. Travers","opt2":"Robert Cormier ","opt3":"R.L. Stine","opt4":"E.L. Konigsburg","ans":"R.L. Stine"},{"que":"A 20th century American author not only wrote horror stories but practically invented the subgenre of \"weird fiction\". Who was this man, known not only for weird stories but also for weird character names, such as \"Cthulhu\"?","opt1":"Ray Bradbury","opt2":"H.P. Lovecraft","opt3":"Isaac Asimov","opt4":"Harlan Ellison","ans":"H.P. Lovecraft"},{"que":"Authors just can't seem to get enough of vampires. In the late 20th century one writer came to the fore for writing a series of books known as \"The Vampire Chronicles\". Who is this author?","opt1":"Anne Rice","opt2":"Maya Angelou","opt3":"Danielle Steel","opt4":"Toni Morrison","ans":"Anne Rice"},{"que":"This poet and story writer is considered part of the American Romantic Movement, but generations of American high school students scrunched down in their seats reading about hearts, pendulums and the call of a black bird. Who is this author?\r\n","opt1":"Ralph Waldo Emerson","opt2":"Edgar Allan Poe","opt3":"Nathaniel Hawthorne ","opt4":"Philip Wylie","ans":"Edgar Allan Poe"},{"que":"Let's start with an easy one.  This 17-year-old girl moves to Forks, Washington and falls in love with her fellow high-school student after he saves her life.  Turns out he's a vampire!  Who is in love with the darkness that is Edward Cullen?","opt1":"Lauren Mallory","opt2":"Bella Swan","opt3":"Angela Weber","opt4":"Jessica Stanley","ans":"Bella Swan"},{"que":"The most famous vampire of all is Count Dracula, created by Bram Stoker.  In Stoker's novel \"Dracula\", who is the unfortunate woman who is courted by three suitors at once, but ends up being turned into a vampire by Dracula?","opt1":"Mina Harker","opt2":"Elisabeta of Transylvania","opt3":"Lucy Westenra","opt4":"Countess Dolingen","ans":"Lucy Westenra"},{"que":"Another famous horror series, \"The Vampire Chronicles\" by Anne Rice, features the vampire Lestat.  Who is Lestat's vampire companion/lover who narrates the first book of the series, \"Interview with the Vampire\"?","opt1":"Louis de Pointe du Lac","opt2":"Nicolas de Lenfent","opt3":"Armand","opt4":"David Talbot","ans":"Louis de Pointe du Lac"},{"que":"A popular urban fantasy by Charlaine Harris, the \"Southern Vampire Chronicles\" describes an alternate history where vampires go public in 2002 with the news that they can peacefully co-exist with humans.  Who is the Southern protagonist who, over the course of the series, falls in love with multiple vampires?","opt1":"Lorena Ball","opt2":"Sookie Stackhouse","opt3":"Judith Varamon","opt4":"Pam Ravenscroft","ans":"Sookie Stackhouse"},{"que":"This series by Laurell K. Hamilton features a half-German, half-Mexican female judo black belt who can raise zombies from the dead and is a trained vampire executioner.  However, during the course of the 20+ books in the series, she falls in love with multiple supernatural creatures, including the creatures she is supposed to hunt.  Who is the Vampire Hunter?","opt1":"Tammy Reynolds","opt2":"Anita Blake","opt3":"Modesty Blaise","opt4":"Buffy Summers","ans":"Anita Blake"},{"que":"\"The Vampire Diaries\" is a series for young adults featuring a love triangle between the two immortal vampire brothers Stefan and Damon Salvatore and a human female who is the reincarnation of a woman they once loved during the American Civil War.  What is the name of the girl in love with and loved by the darkness?","opt1":"Elena Gilbert","opt2":"Caroline Forbes","opt3":"Bonnie Bennett","opt4":"Katherine Pierce","ans":"Elena Gilbert"},{"que":"\"The Silver Kiss\" is a 1992 vampire romance featuring a teenage girl protagonist whose mother is dying of bone cancer and whose best friend is growing more and more distant.  Feeling isolated from the world, she eventually finds comfort from her relationship with the mysterious vampire Simon.  What is the name of this girl who is in love with the darkness?","opt1":"Avis","opt2":"Annette","opt3":"Zoe","opt4":"Lorraine","ans":"Zoe"},{"que":"More famous for killing vampires than loving them, this heroine with supernatural reflexes, strength, and healing abilities is the star of a series of comic books and novels named after her (and which continue the storyline of a popular TV show).  What famous blonde goes by the moniker \"the Vampire Slayer\", yet nonetheless ends up falling in love with the darkness?","opt1":"Willow Rosenberg","opt2":"Cordelia Chase","opt3":"Joyce Summers","opt4":"Buffy Summers","ans":"Buffy Summers"},{"que":"Stephen Brust is an author more famous for his Vlad Taltos novels, but his fantasy novel \"Agyar\" features a narrator, Jack Agyar, who doesn't ever explicitly explain that he has entered the darkness.  What is the first name of the dancer who falls in love with Agyar, causing him to make a life-changing decision?","opt1":"Susan","opt2":"Laura","opt3":"Jennifer","opt4":"Jill","ans":"Susan"},{"que":"Neil Gaiman's \"Sandman\" graphical novels chronicle the stories of the Endless, anthropomorphic entities that embody fundamental concepts such as Despair, Desire, and Destiny.  In the offshoot novel, \"Death: The High Cost of Living\", Death takes on human form as a perky Goth girl for one day to understand life better.  What suicidal young man meets her and eventually realizes that his love for Death gives him a reason to live?","opt1":"Daniel","opt2":"Jonathan","opt3":"Matthew","opt4":"Sexton","ans":"Sexton"},{"que":"\"The Bride of Corinth\" is an erotic, macabre tale of a young woman sworn to chastity in her short life, only to return from the grave to find a husband - perhaps for all time.  What giant of European verse wrote this intriguing classically-based ballad?","opt1":"William Shakespeare","opt2":"John Milton","opt3":"Miguel de Cervantes","opt4":"Johann Wolfgang von Goethe","ans":"Johann Wolfgang von Goethe"},{"que":"In 1797, one of the giants of English verse began a lengthy poem with vampiric overtones.  He added a second section in 1800, and the poem, titled \"Christabel\" circulated in manuscript copies among the English-speaking intelligentsia for over a decade.  The poet finally published \"Christabel\" in 1816, along with another poem he could not finish, \"Kubla Khan\".  Who was this eccentric, opium-driven dean of Romantic poetry?","opt1":"Samuel Taylor Coleridge","opt2":"Lord Byron","opt3":"William Wordsworth","opt4":"A. E. Housman","ans":"Samuel Taylor Coleridge"},{"que":"Who was the doctor who turned to pioneering Gothic author?","opt1":"Benjamin Franklin Pierce","opt2":"John Polidori","opt3":"James Malcolm Rymer","opt4":"Thomas Preskett Prest","ans":"John Polidori"},{"que":"Another great romantic poet put vampire imagery to good use in two works, \"La Belle Dame sans Merci\" and \"Lamia\".  In both of these, the vampire is a seductress who drains the vitality of strong young men.  Ironically enough, this great poet would himself waste away and die at a young age from tuberculosis, the effects of which were sometimes blamed on vampirism.  Who was this wordsmith who would come to resemble the vampire-stricken knights of which he wrote: \"Pale warriors, death pale were they all\"?","opt1":"Samuel Taylor Coleridge","opt2":"Alfred Lord Tennyson","opt3":"John Keats","opt4":"Dylan Thomas","ans":"John Keats"},{"que":"The first substantial vampire fiction that approximated a novel was  a long running serial (popularly known as a \"penny dreadful\" or a \"penny blood\") published between 1845 and 1847.  When finally compiled into book form, it stretched to 868 pages over 220 chapters.  What was the name of this Gothic epic?","opt1":"Plan Nine from Outer Mongolia","opt2":"Varney the Vampire or The Feast of Blood","opt3":"The Crazed Vampire of La Vista","opt4":"Baron Blood and the Mistress of Death","ans":"Varney the Vampire or The Feast of Blood"},{"que":"The 1847 short story \"Family of the Vourdalak\" put a unique twist on the vampire motif.  It featured a family patriarch who goes off into a snowstorm and returns profoundly changed.  What author, who shared a surname with a well-known contemporary, was the author of this tale?","opt1":"Alexis Tolstoy","opt2":"Paul Pushkin","opt3":"Jack Dostoyevsky","opt4":"Seymour Chekhov","ans":"Alexis Tolstoy"},{"que":"An anonymous vampire story appeared in the English magazine \"Odds and Ends\" in 1860.  Translated from German, it drew upon \"The Vampyre\" in having its hero travel to an exotic land and in making its villain grotesque yet cultivated, but may well have introduced the convention of an older advisor to the protagonists who knows how vampires should be fought and defeated; this convention would grow to fruition in the vampire classic \"Dracula\" with the character of Van Helsing.  What was the name of this piece?","opt1":"The Girl with the Hungry Eyes","opt2":"The Master of Rampling Gate","opt3":"The Mysterious Stranger","opt4":"Drink My Blood","ans":"The Mysterious Stranger"},{"que":"One of the most pleasant reads among the classic vampire stories is an 1872 novella by J. Sheridan Le Fanu.  Drawing thematically on \"\"Christabel\", this work tells the story of a young gentlewoman left in the care of an aristocratic family.  Periodically, she seems to change into a cat and drink the blood of the family's maiden daughter while she lies in bed at night.  What intriguing work of short fiction is this?","opt1":"Mircalla","opt2":"And No Bird Sings","opt3":"Carmilla","opt4":"Blood and Roses","ans":"Carmilla"},{"que":"Though this may be more of a historical curiosity than a substantive contribution to vampire literature, one late Victorian Nobel laureate threw his hat in the vampiric ring when he wrote a poem to accompany Pre-Raphaelite painter Edward Burne-Jones' 1897 painting \"The Vampire\".  Who was this author whose name has been forever linked to the nationalistic grandeur of the British Empire?","opt1":"Romain Rolland","opt2":"William Butler Yeats","opt3":"Rudyard Kipling","opt4":"George Bernard Shaw","ans":"Rudyard Kipling"},{"que":"Though they can be appreciated as fine works in their own right, many of the poems and stories in the previous questions are notable for their influence on the dominant text in vampire literature: Bram Stoker's \"Dracula\".  Outside of other creative works, however, many scholars believe that Stoker was also influenced by his contact with notable individuals of the period.  Which of these late-nineteenth-century luminaries has not been cited by scholars as an influence on Bram Stoker?","opt1":"Shakespearian actor Henry Irving","opt2":"Explorer Sir Richard Francis Burton","opt3":"British statesman Winston Churchill","opt4":"American frontiersman and showman Buffalo Bill Cody","ans":"British statesman Winston Churchill"}]