[{"que":"For which part did Michael Goldberg write scripts for?","opt1":"Harry Potter and the Prisoner of Azkaban","opt2":"Harry Potter and the Order of the Phoenix","opt3":"Harry Potter and the Goblet of Fire","opt4":"Harry Potter and the Chamber of Secrets","ans":"Harry Potter and the Order of the Phoenix"},{"que":"the filmmakers of \"Harry Potter \" announced the names of the three actors playing Harry Potter and his two best friends, Ron and Hermione. Which of these characters wasn't cast for the first film? ","opt1":"Harry's godfather, Sirius","opt2":"Harry's father, James","opt3":"Harry's cousin, Dudley","opt4":"Harry's mother, Lily","ans":"Harry's godfather, Sirius"},{"que":"The \"Harry Potter\" films have been noted for keeping the same core cast throughout ten years of filming the series - from the child actors playing the Hogwarts students to the numerous British A-list thespians. Sadly a major character had to be recast after the second film, since the actor playing him or her died. Who was this character?","opt1":"Hermione Granger","opt2":"Severus Snape","opt3":"Gilderoy Lockhart","opt4":"Albus Dumbledore","ans":"Albus Dumbledore"},{"que":"An important part of creating the world of Rowling's books are the very detailed and beautifully designed sets. For each film new sets had to be designed for the various places that Harry, his friends and enemies inhabit. Which of these sets was created for the second film, \"Harry Potter and the Chamber of Secrets\"?","opt1":"Malfoy Manor","opt2":"The Atrium of the Ministry of Magic","opt3":"The Great Hall","opt4":"Dumbledore's office","ans":"Dumbledore's office"},{"que":"Not all locations that the story takes Harry to can be recreated in the real world. In \"Harry Potter and the Order of the Phoenix\", for a huge room filled with glass orbs, the filmmakers decided to use a completely computer-generated set. The actors played in front of a green screen and the surrounding \"set\" was inserted digitally in post-production. Which was this place?","opt1":"The Hall of Prophecy","opt2":"Umbridge's office","opt3":"Trelawney's office","opt4":"The Ravenclaw common room","ans":"The Hall of Prophecy"},{"que":"Another use of green screen technology in the series is the creation of Quidditch. J.K. Rowling has stated in multiple interviews that this was the thing she anticipated most from the adaptation of her books to the big screen. With the help of the technology, the magical game played on flying broomsticks can be shown in all its intensity. Do only four out of the eight films show the wizarding sport being played?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"The films' main lead - actor Daniel Radcliffe, who plays Harry, had to acquire many new skills in the course of filming in order to perform some of the things his character does. These include ballroom dancing, speaking in the made-up snake language Parseltongue, performing choreographed wand movements and many more. Which of the following did he learn for the shooting of the fourth film, \"Harry Potter and the Goblet of Fire\"?","opt1":"speaking French","opt2":"underwater diving","opt3":"riding a bicycle","opt4":"playing the piano","ans":"underwater diving"},{"que":"Inside the sets thousands of props - wands, books, broomsticks and many more - were used for the characters to interact with. A central role amongst these play the (non-living) Horcruxes containing pieces of Lord Voldemort's soul, which Harry seeks to destroy. Which of these objects is created earliest? ","opt1":"Tom Riddle's diary","opt2":"Helga Hufflepuff's cup","opt3":"Salazar Slytherin's locket","opt4":"Rowena Ravenclaw's diadem","ans":"Tom Riddle's diary"},{"que":"The Hair and Makeup department often had to go to great lengths to change the actors' appearance for them to resemble their characters. An example of this are the twins James and Oliver Phelps, who play Fred and George and had to dye their hair the signature Weasley red. However others, like actor Domhnall Gleeson, didn't need to resort to such measures, being naturally ginger-haired. Which character - the last to join the ranks of the Weasleys in a speaking part - does he play?","opt1":"Ron Weasley, 19 years later","opt2":"Charlie Weasley","opt3":"young Arthur Weasley","opt4":"Bill Weasley","ans":"Bill Weasley"},{"que":"The rich world of \"Harry Potter\" features many characters - not all of them human. For some - the mythical beasts, CGI was required to \"bring them to life\". Which of the following, however, required an animal trainer rather than a computer expert?","opt1":"Hedwig","opt2":"Firenze","opt3":"Fluffy","opt4":"Norbert","ans":"Hedwig"},{"que":"Though computer-generated imagery (CGI) is often applied throughout the series, it consists of almost completely live-action films. Only one of the installments features a brief animated sequence. Which one?","opt1":"Harry Potter and the Prisoner of Azkaban","opt2":"Harry Potter and the Philosopher's/Sorcerer's Stone","opt3":"Harry Potter and the Goblet of Fire","opt4":"Harry Potter and the Deathly Hallows: Part 1","ans":"Harry Potter and the Deathly Hallows: Part 1"},{"que":"To create the right atmosphere during a scene, the film score can often be of paramount significance. Four composers - John Williams, Patrick Doyle, Nicholas Hooper and Alexandre Desplat - have through their music helped shape the feel of the series. Though mostly instrumental, one of Williams' soundtracks includes a choir song named \"Double Trouble\". Which film was it performed in?","opt1":"Harry Potter and the Goblet of Fire","opt2":"Harry Potter and the Philosopher's/Sorcerer's Stone","opt3":"Harry Potter and the Chamber of Secrets","opt4":"Harry Potter and the Prisoner of Azkaban","ans":"Harry Potter and the Prisoner of Azkaban"},{"que":"In \"Harry Potter and the Chamber of Secrets\", What was the monster that resided in the chamber?","opt1":"A thestral","opt2":"A boggart","opt3":"A goblin","opt4":"A basilisk","ans":"A basilisk"},{"que":"In \"The Prisoner of Azkaban\" Professor Lupin played music in his class.  What did he play the music on?","opt1":"A DVD player","opt2":"An 8 track player","opt3":"A tape player","opt4":"A record player","ans":"A record player"},{"que":"In almost all the seven movies, J.K. Rowling hinted that Harry and Voldemort were somewhat alike.  Why did Harry and Lord Voldemort seem to have common traits?","opt1":"Harry stole traits from Voldemort.","opt2":"Part of Voldemort's traits were transferred to Harry when Harry became a horcrux.","opt3":"Dumbledore gave Harry the traits to help him.","opt4":"Voldemort wanted a worthy opponent so he gave Harry some of his powers.","ans":"Part of Voldemort's traits were transferred to Harry when Harry became a horcrux."},{"que":"In \"Harry Potter and the Deathly Hallows\" Ron was tired, hungry, angry, jealous, and sick from being splinched.  What event, in addition to all these woes, made Ron explode and leave?","opt1":"Ron wanted to be home by Christmas.","opt2":"Ron realized that they had yet another item to look for.","opt3":"Ron wanted to know if his family was all right.","opt4":"Ron got tired of sleeping in a tent.","ans":"Ron realized that they had yet another item to look for."},{"que":"In \"The Prisoner of Azkaban\" who did Harry hear screaming before he passed out?","opt1":"Dudley","opt2":"His mother","opt3":"The Dementors","opt4":"The train whistle","ans":"His mother"},{"que":"Harry's arm was broken when he was hit by a rogue bludger in \"Harry Potter and the Chamber of Secrets\".  Professor Lockhart tried to help him. Who charmed the bludger?\r\n","opt1":"Voldemort","opt2":"Dumbledore","opt3":"Draco Malfoy","opt4":"Dobby","ans":"Dobby"},{"que":"In \"Harry Potter and the Deathly Hallows: Part 2\", who killed Nagini?","opt1":"Neville Longbottom","opt2":"Draco Malfoy","opt3":"Harry Potter","opt4":"Dobby","ans":"Neville Longbottom"},{"que":"In all the books and movies, Harry was as good as Voldemort was bad.  What did Harry have that Voldemort lacked and disdained?","opt1":"The Deathly Hallows","opt2":"He had love.","opt3":"Harry was handsome.","opt4":"Harry had money,","ans":"He had love."},{"que":"In \"Harry Potter and the Sorceror's Stone\", Harry received an invisibility cloak for Christmas.  Who gave him the cloak on Christmas morning?","opt1":"Molly Weasley","opt2":"Dumbledore","opt3":"Filch","opt4":"Hagrid","ans":"Dumbledore"},{"que":"Hagrid had a boarhound.  What was the dog's name?","opt1":"Norbert","opt2":"Fang","opt3":"Killer","opt4":"Fluffy","ans":"Fang"},{"que":"Fawkes was a phoenix.  What was unusual about a phoenix?","opt1":"They were all ghosts.","opt2":"Fawkes hated Harry.","opt3":"Dumbledore willed Fawkes to Harry.","opt4":"When it was time for them to die, they burst into flames and were reborn from their ashes.","ans":"When it was time for them to die, they burst into flames and were reborn from their ashes."},{"que":"Who is the Defence Against the Dark Arts teacher in \"Harry Potter and the Prisoner of Azakaban\"?","opt1":"Severus Snape","opt2":"Dolores Umbridge","opt3":"Remus Lupin","opt4":"Gilderoy Lockhart","ans":"Remus Lupin"},{"que":"In \"Harry Potter and the Goblet of Fire\", who does Cho Chang go to the Yule Ball with?","opt1":"Fred Weasley","opt2":"Neville Longbottom","opt3":"Cedric Diggory","opt4":"Draco Malfoy","ans":"Cedric Diggory"},{"que":"In \"Harry Potter and the Order of the Phoenix\", which teacher does Umbridge sack in the school grounds?","opt1":"Severus Snape","opt2":"Rubeus Hagrid","opt3":"Sybil Trelawney","opt4":"Argus Filch","ans":"Sybil Trelawney"},{"que":"In \"Harry Potter and the Prisoner of Azkaban\", what does Professor McGonagall give Hermione?","opt1":"Time Turner","opt2":"Time Rotator","opt3":"Time Changer","opt4":"Time Spinner","ans":"Time Turner"},{"que":"What spell is used to protect yourself from spells that are dangerous?","opt1":"Legilimens","opt2":"Levicorpus","opt3":"Petrificus Totalus","opt4":"Protego","ans":"Protego"},{"que":"In \"Harry Potter and the Philosopher's Stone\", what is Ron's last move on the giant Wizard Chess board?","opt1":"Bishop to H4","opt2":"Pawn to B3","opt3":"Knight to H3","opt4":"Queen to D5","ans":"Knight to H3"},{"que":"In \"Harry Potter and the Half Blood Prince\", who is the werewolf Death Eater?","opt1":"Narcissa Malfoy","opt2":"Bellatrix Lestrange","opt3":"Lucius Malfoy","opt4":"Fenrir Greyback","ans":"Fenrir Greyback"},{"que":"In \"Harry Potter and the Prisoner of Azkaban\", what is the name of the Minister of Magic? ","opt1":"Rufus Scrimgeour","opt2":"Cornelius Fudge","opt3":"Kingsley Shacklebolt","opt4":"Pius Thicknesse","ans":"Cornelius Fudge"},{"que":"In \"Harry Potter and the Half Blood Prince\", what does Luna Lovegood say Harry's head is full of?","opt1":"Wrackspurts","opt2":"Walloptears","opt3":"Vegetables","opt4":"Crashmops","ans":"Wrackspurts"},{"que":"In \"Harry Potter and the Philosopher's Stone\", what house does Susan Bones get placed in?","opt1":"Ravenclaw","opt2":"Slytherin","opt3":"Gryffindor","opt4":"Hufflepuff","ans":"Hufflepuff"},{"que":"In 'Harry Potter and the Chamber of Secrets' Professor McGonagall teaches the second years a spell to turn animals into water goblets. What is the incantation?","opt1":"Fera Verto","opt2":"Imperio","opt3":"Engorgio","opt4":"Depulso","ans":"Fera Verto"},{"que":"This spell is used to send red sparks into the air and is first seen in 'Harry Potter and the Goblet of Fire.' What is it?","opt1":"Confundo","opt2":"Sectumsempra","opt3":"Petrificus Totalus","opt4":"Periculum","ans":"Periculum"},{"que":"In 'Harry Potter and the Half Blood Prince' Hermione uses a spell to make the flock of birds she conjured charge at Ron. What is the incantation Hermione used?","opt1":"Muffliato","opt2":"Reducto","opt3":"Impedimenta","opt4":"Oppugno","ans":"Oppugno"},{"que":"This spell was created by 'The Half Blood Prince'. Harry finds the spell in his potions book. It is labeled 'For Enemies'. What is the spell?","opt1":"Sectumsempra","opt2":"Desendium","opt3":"Rictumsempra","opt4":"Protego","ans":"Sectumsempra"},{"que":"What is the correct version of the counter curse for Sectumsempra?","opt1":"Sanenera Vulntur","opt2":"Sanentur Vulnera","opt3":"Vulture Sanenera","opt4":"Vulnera Sanentur","ans":"Vulnera Sanentur"},{"que":"What spell does Harry Describe as 'The Wizard's bread and butter'?","opt1":"Stupefy","opt2":"Lumos","opt3":"Incendio","opt4":"Expelliarmus","ans":"Stupefy"},{"que":"When Remus Lupin teaches D.A.D.A, the Professor teaches his students to repel a boggart. What is the name of the incantation?","opt1":"Riddikulus","opt2":"Ridiculous","opt3":"Crucio","opt4":"Depulso","ans":"Riddikulus"},{"que":"Throughout the whole of the first film Hermione only uses six spells. What are they?","opt1":"Oculus Reparo, Alohomora, Lacarnum Inflamarae, Petrificus Totalus, Lumos Solem and Wingardium Leviosa","opt2":"Stupefy, Duro, Lumos, Avada Kedavra, Wingardium Leviosa and Protego","opt3":"Reparo, Accio, Depulso, Glacius, Expelliarmus and Incendio","opt4":"Diffindo, Alohomora, Everte Statum, Evanesco,  Rictumsempra and Expecto Patronum","ans":"Oculus Reparo, Alohomora, Lacarnum Inflamarae, Petrificus Totalus, Lumos Solem and Wingardium Leviosa"},{"que":"The first two words in the film 'Harry Potter and the Prisoner of Azkaban' are a spell. What is the spell?","opt1":"Lumos Solem","opt2":"Incendio","opt3":"Lumos Maxima","opt4":"Lumos","ans":"Lumos Maxima"}]