[{"que":"One of the first science fiction films to be taken seriously by critics and movie-goers alike, this 1968 movie was made by Stanley Kubrick. Which film is this?","opt1":"Metropolis","opt2":"2001: A Space Odyssey","opt3":"Fantastic Voyage","opt4":"Plan 9 From Outer Space","ans":"2001: A Space Odyssey"},{"que":"\"In space, no one can hear you scream.\" This was the famous tag line for which 1979 space thriller starring Sigourney Weaver? ","opt1":"Alien","opt2":"The Blob","opt3":"Swamp Thing","opt4":"The Terminator","ans":"Alien"},{"que":"Which 1979 movie about post-apocalyptic life in the Outback became a cult hit and put young Australian actor Mel Gibson on the fast track to super-stardom?","opt1":"Mad Max","opt2":"The Bounty","opt3":"Bird on a Wire","opt4":"Lethal Weapon","ans":"Mad Max"},{"que":"\"I'll be back.\" Arnold turned this simple line into his greatest catchphrase, and this movie spawned a robot army of stunt-spectacular sequels, a Universal Studios attraction, and a TV show. Which movie is this?","opt1":"Commando","opt2":"I, Robot","opt3":"Robocop","opt4":"The Terminator","ans":"The Terminator"},{"que":"\"What are you trying to tell me? That I can dodge bullets?\" Well, thanks to the ground-breaking \"bullet time\" special effects created for this 1999 movie, when he was ready, Keanu Reeves didn't have to. What's the movie?","opt1":"V For Vendetta","opt2":"Johnny Mnemonic","opt3":"The Matrix","opt4":"Equilibrium","ans":"The Matrix"},{"que":"Will Smith stars as Capt. Steven Hiller in this movie, the top grossing movie in 1996. Hey, it's not every day you get to save the world AND punch tentacled aliens in the face! What movie is this?","opt1":"Wild Wild West","opt2":"I Am Legend","opt3":"Independence Day","opt4":"Bad Boys","ans":"Independence Day"},{"que":"This movie features a DeLorean that looks like a spaceship but is actually a time machine, a jacket that looks like a life vest, and Michael J. Fox using the musical stylings of Eddie Van Halen to torture his future father. Oh, the '80s! What's that movie title?","opt1":"Teen Wolf","opt2":"Back to the Future","opt3":"Time Bandits","opt4":"Ferris Bueller's Day Off","ans":"Back to the Future"},{"que":"Harrison Ford, trying to avoid being typecast for all time as street-wise gunslinging crook Han Solo, took the role of street-wise gunslinging cop Rick Deckard (see, the haircut is totally different), whose job is to hunt down a few rogue androids in the streets of Los Angeles in this film. Name the film.","opt1":"Blade Runner","opt2":"Raiders of the Lost Ark","opt3":"Witness","opt4":"Force 10 From Navarone","ans":"Blade Runner"},{"que":"An ocean liner is found in the Gobi Desert, Richard Dreyfuss gets a sunburn on half of his face, and spaceships shaped like ice cream cones fail to pay the Ohio highway toll. Throw in Devil's Tower and a government cover-up, and you get what movie?","opt1":"E.T.","opt2":"Close Encounters of the Third Kind","opt3":"Jaws","opt4":"The X Files","ans":"Close Encounters of the Third Kind"},{"que":"One of the most technically innovative movies in filmmaking history, and certainly one of the most popular, this movie took place in a galaxy far, far away and forever changed the way movies were made and watched. Name this movie.","opt1":"Star Wars","opt2":"Battlefield Earth","opt3":"Howard the Duck","opt4":"Star Trek: The Motion Picture","ans":"Star Wars"},{"que":"Sitting in my seat for my very first 'Science Fiction Double Feature' I was delighted with a trip back to the 1950s.  The first film, from 1951, was about an alien creature in Antarctica while the second, a 1956 Don Siegel film, involved pod people.  What movies did I see?","opt1":"\"The Thing From Another World\"/\"Invasion of the Body Snatchers\"","opt2":"\"Invaders From Mars\"/\"Them!\"","opt3":"\"Sometimes They Come Back\"/\"War of the Worlds\"","opt4":"\"The Invasion\"/\"The Thing\"","ans":"\"The Thing From Another World\"/\"Invasion of the Body Snatchers\""},{"que":"The theme of this next double feature was the year 1968.  What two movies from this year was I watching if the first involved a trip to Jupiter while the second involved an unexpected trip back to Earth?","opt1":"\"2001: A Space Odyssey\"/\"Planet of the Apes\"","opt2":"\"Escape From the Planet of the Apes\"/\"Planet of the Vampires\"","opt3":"\"They Came From Beyond Space\"/\"Latitude Zero\"","opt4":"\"Battle Beyond the Sun\"/\"The Time Machine\"","ans":"\"2001: A Space Odyssey\"/\"Planet of the Apes\""},{"que":"I was told beforehand that this particular double feature would involve the films of Michael Crichton.  The first, from 1969, was about an alien disease while the second, from 1973, featured robot cowboys.  What two films was I preparing to see?","opt1":"\"The Omega Man\"/\"The First Great Train Robbery\"","opt2":"\"The Andromeda Strain\"/\"Westworld\"","opt3":"\"Doomsday\"/\"The Quick and the Undead\"","opt4":"\"Outbreak\"/\"Prey\"","ans":"\"The Andromeda Strain\"/\"Westworld\""},{"que":"Although this particular double feature was popular, I figured I would sit in on both films just for a nostalgia trip.  One featured a particular 'Falcon'; the other featured a particular half-Vulcan.  What were the films released in 1977 and 1979 respectively?","opt1":"\"Star Wars: The Empire Strikes Back\"/\"Superman\"","opt2":"\"Predator\"/\"Alien\"","opt3":"\"Star Wars: A New Hope\"/\"Star Trek: The Motion Picture\"","opt4":"\"Logan's Run\"/\"Nineteen Eighty-Four\"","ans":"\"Star Wars: A New Hope\"/\"Star Trek: The Motion Picture\""},{"que":"This double feature concerned the powers of the mind in two films from the early 1980.  While one film (from 1980) involved drug-induced sensory experiences, the second (from 1981) was about telepathy.  What were the two films?","opt1":"\"Altered States\"/\"Scanners\"","opt2":"\"Limitless\"/\"The Fly\"","opt3":"\"Blade Runner\"/\"Videodrome\"","opt4":"\"Enter the Void\"/\"Firestarter\"","ans":"\"Altered States\"/\"Scanners\""},{"que":"\"Give these people back their air!\"  I sat down for an Arnold Schwarzenegger double feature and found one (from 1987) about a deadly game show and another (from 1990) about a trip to Mars also featuring Sharon Stone.  What movies did I watch?","opt1":"\"The Running Man\"/\"Total Recall\"","opt2":"\"Battle Royale\"/\"Mission to Mars\"","opt3":"\"Blade Runner/\"\"Red Planet\"","opt4":"\"End of Days\"/\"The 6th Day\"","ans":"\"The Running Man\"/\"Total Recall\""},{"que":"It was a blow-em-up double feature in theater seven when I saw two films by Roland Emmerich in a row.  The first was a 1994 film about galactic wormholes while the second was a 1996 film about an alien invasion.  What two movies were screened?","opt1":"\"The Day After Tomorrow\"/\"Predators\"","opt2":"\"Universal Soldier\"/\"Moon 44\"","opt3":"\"Stargate\"/\"Independence Day\"","opt4":"\"The Thirteenth Floor\"/\"Alien Resurrection\"","ans":"\"Stargate\"/\"Independence Day\""},{"que":"We had a Bruce-Willis-a-thon during one double feature.  The first was a futuristic, apocalyptic film starring Willis as Corbin Dallas (released in 1997).  The second was another futuristic film about a murdered android avatar (released in 2009).  What two movies played?","opt1":"\"Planet Terror\"/\"Inception\"","opt2":"\"The Expendables\"/\"Avatar\"","opt3":"\"The Fifth Element\"/\"Surrogates\"","opt4":"\"Mercury Rising\"/\"Unbreakable\"","ans":"\"The Fifth Element\"/\"Surrogates\""},{"que":"Things got emotional with the ninth double feature I watched.  The first movie was a 2004 Alex Proyas film about an emotional robot and the Laws of Robotics while the second, a 2005 movie, included a depressed robot on a whimsical journey to find what inevitably turned out to be the number '42'.  What movies were involved?","opt1":"\"Metropolis\"/\"Robots\"","opt2":"\"Children of Men\"/\"The Iron Giant\"","opt3":"\"Treasure Planet\"/\"Short Circuit\"","opt4":"\"I, Robot\"/\"Hitchhiker's Guide to the Galaxy\"","ans":"\"I, Robot\"/\"Hitchhiker's Guide to the Galaxy\""},{"que":"The most contemporary of my double features was a mash-up of a Philip K. Dick adaptation (released in 2011) involving a group of people setting people on course for 'the plan' and a second 2011 film, this one about a man who could relive the same period of time over and over to solve a crime.  What two movies did I view?","opt1":"\"The Adjustment Bureau\"/\"Source Code\"","opt2":"\"Next\"/\"Singularity\"","opt3":"\"A Scanner Darkly\"/\"The Jacket\"","opt4":"\"Paycheck\"/\"Timeline\"","ans":"\"The Adjustment Bureau\"/\"Source Code\""}]