[{"que":"Raj Kapoor was one of the doyens of the Indian film industry. 'Barsaat' was one of the hit movies directed by Raj Kapoor. Who starred opposite Raj Kapoor in the movie?","opt1":"Nargis","opt2":"Madhubala","opt3":"Suchitra Sen","opt4":"Nimmi","ans":"Nargis"},{"que":"An all-time great Hindi movie was 'Mother India', released in 1957. Who among the following did NOT star in the movie?","opt1":"Rajendra Kumar","opt2":"Dilip Kumar","opt3":"Sunil Dutt","opt4":"Nargis","ans":"Dilip Kumar"},{"que":"One of the first box office mega hits was the 1960 historical film, 'Mughal-E-Azam'. Who portrayed the role of Emperor Akbar in the movie?","opt1":"Dilip Kumar","opt2":"Prithviraj Kapoor","opt3":"Manoj Kumar","opt4":"Sohrab Modi","ans":"Prithviraj Kapoor"},{"que":"The 1960s was dominated by Dev Anand. One of his all-time hits was 'Guide'. Who was the director of this hit movie?","opt1":"Dev Anand","opt2":"Yash Chopra","opt3":"B R Chopra","opt4":"Vijay Anand","ans":"Vijay Anand"},{"que":"'Aradhana' released in 1969 marked the arrival of Rajesh Khanna, who became one of the superstars of Bollywood. Who was the heroine of this movie?","opt1":"Hema Malini","opt2":"Tina Munim","opt3":"Sharmila Tagore","opt4":"Rekha","ans":"Sharmila Tagore"},{"que":"'Sholay' released in 1975 is without doubt one of the greatest Hindi movies. The movie created many cult characters, which of the following is the odd one out?","opt1":"Sanjeev Kumar - Thakur","opt2":"Amjad Khan - Gabbar Singh","opt3":"Asrani - Jailer","opt4":"Hema Malini - Radha","ans":"Hema Malini - Radha"},{"que":"In the late 1970s and the 1980s, Bollywood had one superstar Amitabh Bachchan. One of his super hit movies was 'Don', released in 1978. Who played the role of the Don?","opt1":"Ashok Kumar","opt2":"Pran","opt3":"Amitabh","opt4":"Ifthikar","ans":"Amitabh"},{"que":"The 1980s were known for action movies, but in 1988, a film was released that brought back romance in Bollywood. The film starred Aamir Khan and Juhi Chawla. Do you know the name of the film?","opt1":"Aashiqi","opt2":"Qayamat Se Qayamat Tak","opt3":"Maine Pyar Kiya","opt4":"Dil","ans":"Qayamat Se Qayamat Tak"},{"que":"The 1990s were dominated by the Khans - Aamir, Salman and Shahrukh. In which of the following films did Shah Rukh Khan play the role of a villain?","opt1":"Kuch Kuch Hota Hai","opt2":"Dilwale Dulhaniya Le Jayenge","opt3":"Darr","opt4":"Pardes","ans":"Darr"}]