[{"que":"During \"The Piper At The Gates Of Dawn\" sessions the band was visited by The Beatles recording their album in a neighboring studio.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Which guitarist was first considered as a replacement for Syd Barrett?","opt1":"Jimmy Page","opt2":"Eric Clapton","opt3":"Jimi Hendrix","opt4":"Jeff Beck","ans":"Jeff Beck"},{"que":"\"A Saucerful Of Secrets\" is the only Pink Floyd album where you can hear all five members of the band singing. (Compilations not included.)","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Roger Waters is partially tone-deaf and thus unable to tune his bass guitar properly. Who tuned his bass?","opt1":"Nick Mason","opt2":"David Gilmour","opt3":"the sound engineer in studio and bass guitar technician at live shows","opt4":"Rick Wright","ans":"Rick Wright"},{"que":"Rick Wright is a very shy person, and he is very critical about his works. When asked about his early Floyd compositions, he states that they are \"amateurish\". He even stated that one of them should be named \"The Most Boring Song I've Ever Heard Bar Two\". He was talking about...","opt1":"Paintbox","opt2":"See-Saw","opt3":"Sysyphus","opt4":"Remember A Day","ans":"See-Saw"},{"que":"Five songs were considered for the live \"Ummagumma\" album. \"Interstellar Overdrive\" was finally dropped. Three other songs were presented in their entirety, while one was edited. Which one?","opt1":"Astronomy Domine","opt2":"Careful With That Axe Eugene","opt3":"A Saucerful Of Secrets","opt4":"Set The Controls For The Heart Of The Sun","ans":"Set The Controls For The Heart Of The Sun"},{"que":"The studio \"Ummagumma\" album was divided into four parts, and each was filled by one musician's output. Everyone played all instruments on their parts, with the exception of \"The Narrow Way Part Three\" which was performed by the entire band.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"During one rehearsal, David brought in a small tune he wrote, which he entitled \"Theme For An Imaginary Western\" (no relation to earlier Bruce-Brown song). The band loved the theme (especially Waters) and started working on it. The tune finally evolved into...","opt1":"Atom Heart Mother","opt2":"Careful With That Axe Eugene","opt3":"Dogs","opt4":"Time","ans":"Atom Heart Mother"},{"que":"In the first half of the 70s, Roger Waters, despite being quite wealthy, drove a cheap and small Mini Morris. Why?","opt1":"He disliked large cars after a serious incident he escaped with a sprained ankle.","opt2":"He feared that the band's success would be very temporary and thus wanted to save as much money as possible.","opt3":"Because of his wife.","opt4":"Morris was a gift from his mother on his birthday and he was emotionally linked to it.","ans":"Because of his wife."},{"que":"When the band asked Italian authorities for permission to perform a filmed concert at Pompeii, they agreed under one condition. What was that condition?","opt1":"The band would score an Italian movie - the movie was finally a French production and released under the title \"La Vallee\".","opt2":"The concert will be performed without audience.","opt3":"The film would include footage from Pompeii, to promote the place internationally.","opt4":"The band would donate money to an Italian charity fund.","ans":"The concert will be performed without audience."},{"que":"Is Peter Watts, the band's road manager, related to actress Naomi Watts?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"Rick Wright's input to \"The Dark Side Of The Moon\" was based on a famous 1950s jazz album.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"An acclaimed director asked the band for the permission to use \"Atom Heart Mother\" in one of his most famous movies. However, he wanted to alter and edit the composition, so the band turned the offer down. The name of the director and the title of the movie were:","opt1":"Sergio Leone, \"Once Upon A Time In America\"","opt2":"Francis Ford Coppola, \"Apocalypse Now\"","opt3":"Steven Spielberg, \"Raiders Of The Lost Ark\"","opt4":"Stanley Kubrick, \"A Clockwork Orange\"","ans":"Stanley Kubrick, \"A Clockwork Orange\""},{"que":"One of the men on the \"Wish You Were Here\" cover appeared in a movie with Arnold Schwarzenegger","opt1":"True ","opt2":"False ","ans":"True "},{"que":"This famous jazz musician appeared on \"Wish You Were Here\".","opt1":"Joe Zawinul","opt2":"Wayne Shorter","opt3":"Stephane Grappelli","opt4":"Pat Metheny","ans":"Stephane Grappelli"},{"que":"The 1974 compilation \"A Nice Pair\" was shortly after the release withdrawn and repackaged. What was the reason for changing an album cover?","opt1":"It was released in an altered version, different from an original Hipgnosis project.","opt2":"It included a photography of a private medical practice information plate.","opt3":"It included some errors in the tracklist..","opt4":"It was badly printed (some colors turned out to be bleak).","ans":"It included a photography of a private medical practice information plate."},{"que":"What animal was to be featured on \"Meddle\" album cover?","opt1":"a baboon","opt2":"a whale","opt3":"a lizard","opt4":"a turtle","ans":"a baboon"},{"que":"\"The Wall\", primarily a Roger Waters' brainchild, includes five songs written or co-written by someone else. Three are Gilmour-Waters cooperation, one was written by Waters and Bob Ezrin. Ezrin also wrote one song, credited to Waters on the album cover. The single non-Waters composition is...","opt1":"Bring The Boys Back Home","opt2":"Stop!","opt3":"Vera","opt4":"Is There Anybody Out There?","ans":"Is There Anybody Out There?"},{"que":"\"Collection Of Great Dance Songs\" was originally meant to be released with an accompanying single. A-side was \"Money\". What was chosen to be B-side?","opt1":"Wish You Were Here","opt2":"Let There Be More Light","opt3":"Breathe","opt4":"One Of These Days","ans":"Let There Be More Light"},{"que":"Due to its lyrical content, this Floyd album was presented on Polish radio in seriously abridged form.","opt1":"Animals","opt2":"The Dark Side Of The Moon","opt3":"The Final Cut","opt4":"The Wall","ans":"The Final Cut"},{"que":"What brand of electric guitars David Gilmour used most frequently during \"A Momentary Lapse Of Reason\" sessions?","opt1":"Ibanez","opt2":"Fender","opt3":"Gibson","opt4":"Steinberger","ans":"Steinberger"},{"que":"Who is responsible for drumming on \"Sorrow\" (studio version)?","opt1":"David Gilmour","opt2":"Jim Keltner","opt3":"Nick Mason","opt4":"Carmine Appice","ans":"David Gilmour"},{"que":"\"Amused To Death\" contains personal attacks (one direct, one recorded backwards) at two people related with the band. Who was attacked by Waters on that album?","opt1":"Bob Ezrin and David Gilmour","opt2":"Stanley Kubrick and Bob Ezrin","opt3":"David Gilmour and Andrew Lloyd-Webber","opt4":"Rick Wright and Andrew Lloyd-Webber","ans":"Stanley Kubrick and Bob Ezrin"},{"que":"Did Harry Waters, who played on his father's live shows in the 2000s, appear  on any Waters studio album?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"One musician appeared on albums of three major progressive rock acts: Yes, Pink Floyd, King Crimson.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Which is the only member of Pink Floyd to play on all of their albums?","opt1":"Richard Wright","opt2":"David Gilmour","opt3":"Nick Mason","opt4":"Roger Waters","ans":"Nick Mason"},{"que":"What is the album featuring hits such as \"Welcome to The Machine,\" \"Shine on You Crazy Diamond,\" and \"Have a Cigar?\"","opt1":"The Final Cut","opt2":"Wish You Were Here","opt3":"The Dark Side of The Moon","opt4":"The Wall","ans":"Wish You Were Here"},{"que":"What was the band's first music video?","opt1":"Arnold Layne","opt2":"See Emily Play","opt3":"Jugband Blues","opt4":"Scarecrow","ans":"Arnold Layne"},{"que":"What was the first Pink Floyd studio album to have David Gilmour, Roger Waters, Richard Wright, and Nick Mason play on?","opt1":"Atom Heart Mother","opt2":"More","opt3":"The Piper at The Gates of Dawn","opt4":"A Saucerful of Secrets","ans":"A Saucerful of Secrets"},{"que":"Name the song that these lyrics are from: \"So you, thought you, might like to go to the show.\"","opt1":"In The Flesh","opt2":"Run Like Hell","opt3":"Comfortably Numb","opt4":"Hey You","ans":"In The Flesh"},{"que":"What is Pink Floyd's longest song?","opt1":"Atom Heart Mother","opt2":"Echoes","opt3":"Shine on You Crazy Diamond","opt4":"Dogs","ans":"Echoes"},{"que":"What was the recording company that Pink Floyd recorded their first album with?","opt1":"EMI","opt2":"Warner Bros.","opt3":"Apple","opt4":"Columbia","ans":"EMI"},{"que":"Which song is considered Syd Barrett's farewell to Pink Floyd?","opt1":"Jugband Blues","opt2":"See Emily Play","opt3":"Bike","opt4":"Arnold Layne","ans":"Jugband Blues"},{"que":"What is the last Pink Floyd studio album to contain all four classic members (Waters, Gilmour, Wright, and Mason)?","opt1":"Animals","opt2":"The Wall","opt3":"The Final Cut","opt4":"A Momentary Lapse of Reason","ans":"The Wall"},{"que":"What year did Pink Floyd disband - after their last album and tour?","opt1":1996,"opt2":2005,"opt3":1988,"opt4":2009,"ans":"1996"},{"que":"\"The Piper at the Gates of Dawn\" was Floyd's debut release in 1967. The album's title was taken from a chapter in a book by which children's author?","opt1":"J.M. Barrie","opt2":"A.A. Milne","opt3":"Enid Blyton","opt4":"Kenneth Grahame","ans":"Kenneth Grahame"},{"que":"\"A \"Saucerful of Secrets\" was released in 1968 with the departing Syd Barrett featuring on only three of the seven tracks. Which was the only track to feature Barrett on lead vocals?","opt1":"Corporal Clegg","opt2":"Set the Controls for the Heart of the Sun","opt3":"Jugband Blues","opt4":"Remember a Day","ans":"Jugband Blues"},{"que":"Pink Floyd's third album was the soundtrack from the film \"More\". The film, directed by Barbet Schoeder, was set on which Mediterranean island?","opt1":"Sicily","opt2":"Cyprus","opt3":"Malta","opt4":"Ibiza","ans":"Ibiza"},{"que":"The fourth Floyd album was \"Ummagumma\" which was a double album, one disc being live, the other containing five new studio tracks. What was the name of the studio track that takes its name from a location near Floyd's home town of Cambridge?","opt1":"Jesus Green","opt2":"Woodwalton Fen","opt3":"Wandelbury Forest","opt4":"Grantchester Meadows","ans":"Grantchester Meadows"},{"que":"Pink Floyd's first UK number one album was the 1970 release \"Atom Heart Mother\". The album was also the first to feature a non-psychedelic sleeve, the picture on the front cover being a photograph of what type of animal?","opt1":"Cow","opt2":"Hippopotamus","opt3":"Pig","opt4":"Elephant","ans":"Cow"},{"que":"Floyd's sixth studio album, \"Meddle\", is dominated by which 23 minute track, the title of which was used for a later \"Greatest Hits\" release by the band? ","opt1":"Fearless","opt2":"A Pillow of Winds","opt3":"Echoes","opt4":"One of These Days","ans":"Echoes"},{"que":"In 1972, Floyd released another movie soundtrack album, \"Obscured By Clouds\". That wasn't the name of the film though - what was the English translation of this French movie?","opt1":"The Lake","opt2":"The Mountain","opt3":"The Valley","opt4":"The City","ans":"The Valley"},{"que":"The album which truly made Pink Floyd a global phenomenon was the 1973 release, \"The Dark Side of the Moon\".  Which track on the album contains the lyrics \"I'll see you on the dark side of the moon\"?","opt1":"Brain Damage","opt2":"Money","opt3":"Time ","opt4":"Breathe","ans":"Brain Damage"},{"que":"The 1977 album \"Animals\" has a famous sleeve featuring a giant inflatable pig \"flying\" over which London building?","opt1":"Wembley Stadium","opt2":"St Paul's Cathedral","opt3":"Battersea Power Station","opt4":"Buckingham Palace","ans":"Battersea Power Station"},{"que":"\"The Wall\", a 1979 double album, was turned into a film starring Bob Geldof as the main protagonist, Pink. The album spawned a UK number one single for Pink Floyd - what was its title?","opt1":"Hey You","opt2":"Comfortably Numb","opt3":"Run Like Hell","opt4":"Another Brick in the Wall Part 2","ans":"Another Brick in the Wall Part 2"},{"que":"The last Pink Floyd album to feature Roger Waters was the 1983 album \"The Final Cut\". Entirely composed by Waters, the album contains numerous references to which conflict?","opt1":"Yom Kippur War","opt2":"Falklands War","opt3":"World War 2","opt4":"Vietnam War","ans":"Falklands War"},{"que":"After a four year hiatus, Dave Gilmour and Nick Mason reconvened in 1987 to record the thirteenth Pink Floyd studio album, \"A Momentary Lapse of Reason\". The album title is taken from lyrics on which track on the album? ","opt1":"Sorrow","opt2":"Learning to Fly","opt3":"One Slip","opt4":"Terminal Frost","ans":"One Slip"},{"que":"The fourteenth Pink Floyd studio album, \"The Division Bell\", was released in 1994. The track \"Keep Talking\" was released as a single and features the voice of which scientist?","opt1":"Stephen Hawking","opt2":"Brian Cox","opt3":"Magnus Pyke","opt4":"Patrick Moore","ans":"Stephen Hawking"},{"que":"With Pink Floyd on almost permanent hiatus since 1995 (barring the occasional live reunion for charity), a 15th studio album seems unlikely, so the last question is about live albums. Which one of the following is NOT the title of an official Pink Floyd live release?","opt1":"Made in Japan","opt2":"Delicate Sound of Thunder","opt3":"Is There Anybody Out There?","opt4":"Pulse","ans":"Made in Japan"}]