[{"que":"This fish is known as being an effective insectivore in areas known for disease spread by mosquitoes. In fact many people who don't even own an aquarium know of it.","opt1":"Corydoras Panda","opt2":"Swordfish","opt3":"Guppy","opt4":"Tinfoil Barb","ans":"Guppy"},{"que":"These suckers are well known by aquarists with algae ridden {tanks;} especially brown algae. They spend a considerable amount of time on the bottom of the tank and love wood.","opt1":"Shubunkin","opt2":"Oscar","opt3":"Blue Ram","opt4":"Otocinclus","ans":"Otocinclus"},{"que":"Four of the barbels stem from the base on the upper lip. They have three vertical stripes - one across the head and the other two across the body. Some species are active at dusk, others are nocturnal and they are extremely difficult to sex.","opt1":"Clown Loach","opt2":"Khuli","opt3":"Tiger Barb","opt4":"Panda Cory","ans":"Clown Loach"},{"que":"These fish are used in 'fighting' contests in Thailand and can wrestle for up to an hour. The mouth can be used to steer and balance and they are excellent jumpers.","opt1":"African Butterfly","opt2":"Silver Dollar","opt3":"Banjo Catfish","opt4":"Halfbeak","ans":"Halfbeak"},{"que":"This disc-shaped Amazonian fish has two long ventral fins. It is striped and is very difficult to sex. Probably one of the most easily recognizable fish by non-aquarium owners.","opt1":"Dwarf gourami","opt2":"Spiny eel","opt3":"Angelfish","opt4":"Blue cichlid","ans":"Angelfish"},{"que":"These fish are found in both fresh and saltwater. They have tooth-plates that are used to grind up one of their favorite meals - snails. They are also found as food items in some Japanese restaurants, and can be extremely toxic if not prepared properly.","opt1":"Cardinal Tetra","opt2":"Damselfish","opt3":"Blowfish","opt4":"Pufferfish","ans":"Pufferfish"},{"que":"This fish has an electric organ that allows it to transmit microvoltages. Its brain is exeptionally large in proportion to other fish and it is believed to be very intelligent.","opt1":"Elephantfish","opt2":"American Flagfish","opt3":"Clown Loach","opt4":"Tropheus Moori","ans":"Elephantfish"},{"que":"One of the most colorful South American dwarf cichlids. The females get pink bellies when gravid and they usually spawn on a flat rock or a pit in the gravel. They prefer acidic water.","opt1":"German Blue Ram","opt2":"Kribensis","opt3":"Kissing gourami","opt4":"Plecostomus","ans":"German Blue Ram"},{"que":"The male of this species is beautifully colored, while the female is bland. They are bubble-nest builders and have no qualms about small enclosings. The males do not get along, and are known to kill females that are unwilling to mate.","opt1":"Molly","opt2":"Siamese flying fox","opt3":"Australian Rainbow","opt4":"Siamese fightingfish","ans":"Siamese fightingfish"},{"que":"Another popular fish which loves its swimming space. They are shoaling fish, very fast swimmers, and they are extremely peaceful. They will nip at algae, and are known for sifting through bottom-debris.","opt1":"Hatchetfish","opt2":"Zebra pleco","opt3":"Bala sharks","opt4":"Angelfish","ans":"Bala sharks"},{"que":"This guy is one of the Big Mac's of the hobby. Many aquarist buy this cute little fishy without knowing that it can turn into a monster at 12 inches (30 cm). They are known for their personality and love rearranging the aquarium decor. They are difficult to sex, eat almost everything, and are very territorial once mature.","opt1":"Big Foot","opt2":"Oscar","opt3":"Parrotfish","opt4":"Kribensis","ans":"Oscar"},{"que":"The male gender of this fish has a large pointed fin-extension on its tail. They are livebearers and come in a multitude of colors.","opt1":"Platy","opt2":"Serpae tetra","opt3":"Iridescent shark","opt4":"Swordtail","ans":"Swordtail"},{"que":"This shoaling fish can live with little oxygen in the water and feeds on invertebrates and algae. The pigment of this fish is derived from the colors, black, yellow, and orange. Loves a mouthful of dirt.","opt1":"Dwarf Rainbow","opt2":"Minnow","opt3":"Goldfish","opt4":"Whiptailed catfish","ans":"Goldfish"},{"que":"This fish owns a labyrinth organ which allows it to breathe from the surface when subjected to an environment low in oxygen. Loves fruit.","opt1":"Puffer","opt2":"Needlefish","opt3":"Diver","opt4":"Giant Gourami","ans":"Giant Gourami"},{"que":"This nocturnal fish stays at the surface, usually under leaves or wood, and waits for insects. They are fantastic jumpers, so you need a well enclosed aquarium. They have a number of 'spikes' that act as feelers for their pelvic region. The male can be distinguished by his concave anal fin.","opt1":"African Butterflyfish","opt2":"Moray eel","opt3":"Golden Ram","opt4":"Hatchetfish","ans":"African Butterflyfish"},{"que":"These little fellas never stop. Known as one of the most hyperactive of all freshwater fish, they are shoaling fish, and prefer to spawn on a gravelly bottom. Adult females will often choose to mate with the same male many times.","opt1":"Zebra danio","opt2":"Guppy","opt3":"Black tetra","opt4":"Carp","ans":"Zebra danio"},{"que":"One of the best known saltwater fishes in the world. It is famous for its symbiotic relationship with anemones in tropical reef systems.","opt1":"Ancicstrus","opt2":"Mandarin","opt3":"Puffer","opt4":"Clownfish","ans":"Clownfish"},{"que":"Another African dwarf cichlid commonly found in the Niger delta. This fish loves to breed and can do so without almost any help from the aquarist. They are excellent parents, and will often spawn in caves. They are also well known for their mating rituals.","opt1":"German blue ram","opt2":"Kribensis","opt3":"Apistogramma","opt4":"Adis Ababba","ans":"Kribensis"},{"que":"These fish have a very depressed look to them! They are usually marine, but there are also freshwater inhabitants. They are known for their long tail and tendency to cover themselves in sand.","opt1":"Piranha","opt2":"Blind Cavefish","opt3":"Stingray","opt4":"Flattop","ans":"Stingray"},{"que":"You can see right through this fish!","opt1":"Glass Catfish","opt2":"Molly","opt3":"Labeo","opt4":"Khuli","ans":"Glass Catfish"},{"que":"This \"dark\" fish can be called the river (color)fish, Alaska (color)fish, and Sacramento (color)fish.  The fish from Alaska is a dark olive-green to brown color and has a white underbelly, with dark spots all over the body.  The Sacramento (color)fish is the only fish in the genus Orthodon, and the river (color)fish is from Australia.  Can you guess what fish this might be?","opt1":"Blackfish","opt2":"Maroonfish","opt3":"Yellowfish","opt4":"Magentafish","ans":"Blackfish"},{"que":"What colorful name can a dogfish also go by?  This can also be another name for a nurse shark.  Both British and American English spelling is acceptable.","opt1":"Copperfish","opt2":"Brownfish","opt3":"Grayfish","opt4":"Orangefish","ans":"Grayfish"},{"que":"This type of fish is from the genus Melanotaenia, which means \"black-banded\".  Those in this genus are so named because of the black bands on some of the species of the genus.  However, this means nothing.  They are not blackfish!  Rather, what \"colorful\" fish are they?","opt1":"Rainbowfish","opt2":"Colorfish","opt3":"Neonfish","opt4":"Multi-colored fish","ans":"Rainbowfish"},{"que":"This fish, from the Pomatomidae family, is called tailor in Australia.  In South Africa, it is called elf, or shad.  Elsewhere, it is called chopper or anchoa.  What \"title\" fish might this be?","opt1":"Indigofish","opt2":"Cyanfish","opt3":"Bluefish","opt4":"Skyfish","ans":"Bluefish"},{"que":"Known as a sig in Russia, this common fish is from the Coregonus family.  There is also a single species of this fish, in the family Stenodus, known as an inconnu.  This fish name can also be a nickname for the ghostshark.  What fish might this be?","opt1":"Ghoulfish","opt2":"Palefish","opt3":"Whitefish","opt4":"Invisiblefish","ans":"Whitefish"},{"que":"This fish, from the genus Plagiogeneion, is not as brightly colored as the name suggests.  It is in the family Emmelichthyidae, which are known as rovers.  What \"gem\" of a fish might this be?","opt1":"Sapphirefish","opt2":"Topazfish","opt3":"Rubyfish","opt4":"Emeraldfish","ans":"Rubyfish"},{"que":"This fish, from the genus Sebastes, is also known as ocean perch, Norway haddock, and red perch, though it is not a haddock; nor a perch.  It is also called redfish and hemdurgan, and is often called bergylt, bream, and snapper by mistake.  What \"flowery\" fish might this be?","opt1":"Daisyfish","opt2":"Sunflowerfish","opt3":"Rosefish","opt4":"Violetfish","ans":"Rosefish"},{"que":"This type of fish, resembling a worm or an eel, is so named because of their translucent bodies; without scales, similar to that of an eel.  They live in invertebrates, such as clams and starfish, though they are not normally parasitic.  What type of fish might this be?","opt1":"Pearlfish","opt2":"Clearfish","opt3":"Iridescentfish","opt4":"Creamfish","ans":"Pearlfish"},{"que":"What is the world's largest fish?","opt1":"Freshwater Catfish","opt2":"Whale Shark","opt3":"Barracuda","opt4":"Sawfish","ans":"Whale Shark"},{"que":"Which fish often stalks other fish from beneath logs and other protected areas?","opt1":"Pike","opt2":"Trout","opt3":"Minnow","opt4":"Carp","ans":"Pike"},{"que":"These fish are blind and have an enhanced ability to detect vibration and odor?","opt1":"Perches","opt2":"Pearlfishes","opt3":"Codfishes","opt4":"Cavefishes","ans":"Cavefishes"},{"que":"Members of this fish family locate food by probing the bottom with sensitive, whiskerlike barbels?","opt1":"Mudminnows","opt2":"Catfishes","opt3":"Trouts","opt4":"Batfishes","ans":"Catfishes"},{"que":"Most of this species of fish are hermaphroditic, having both male and female reproductive organs?","opt1":"Sunfishes","opt2":"Snooks","opt3":"Sea Basses","opt4":"Seahorses","ans":"Sea Basses"},{"que":"Which fish spends most of its life in the ocean, but returns to freshwater to spawn?","opt1":"Tuna","opt2":"Sucker","opt3":"Salmon","opt4":"Needlefish","ans":"Salmon"},{"que":"These noted hitchhikers take free rides on sharks or other marine animals?","opt1":"Cobias","opt2":"Remoras","opt3":"Bluefish","opt4":"Tilefishes","ans":"Remoras"},{"que":"Which of these fish has vertical stripes?","opt1":"Parrotfish","opt2":"Mullet","opt3":"Snapper","opt4":"Spadefish","ans":"Spadefish"},{"que":"Is there a fish called a dolphin fish?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"What is the largest member of the salmon family in North America?","opt1":"Chinook","opt2":"Pacific","opt3":"Grayling","opt4":"Atlantic","ans":"Chinook"}]