[{"que":"Name the subfamily that includes the milk snake.","opt1":"Azemiopinae","opt2":"Causinae","opt3":"Erycinae","opt4":"Colubrinae","ans":"Colubrinae"},{"que":"This animal, which is supposed to have disappeared off the face of the earth between 40,000 and 30,000 years ago, was a massive predator often 7 metres long and weighing 620 kg. Scientists assume that due to its appurtenance to the Varanid lizards family it might have also been venomous.","opt1":"Dakosaurus","opt2":"Tomistoma","opt3":"Megalania","opt4":"Nothosaurus","ans":"Megalania"},{"que":"Hyenas are more closely related to cats and mongooses than to dogs or wolves.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"The Karakachan dog - one of Europe's oldest breeds - descends from the dogs of which people?","opt1":"Slavs","opt2":"Thracians","opt3":"Goths","opt4":"Byzantine Greeks","ans":"Thracians"},{"que":"This cat breed is characterized by its elongated robust body, long legs and bushy tail. The profile is generally straight, the eyes - almond-shaped and oblique (their color varies a lot). Due to a tuft of hair the ears resemble those of a lynx. Strong claws make these cats good climbers (they can even scramble rocks). ","opt1":"Turkish Angora","opt2":"Norwegian forest cat","opt3":"Persian cat","opt4":"Aegean cat","ans":"Norwegian forest cat"},{"que":"The smilodon - a kind of saber-toothed cat - lived on the territory of which two continents?","opt1":"Asia and North America","opt2":"South America and Asia","opt3":"Africa and Europe","opt4":"North America and South America","ans":"North America and South America"},{"que":"Which of these big cats is on average the largest kind? ","opt1":"tiger","opt2":"liger","opt3":"lion","opt4":"tigon","ans":"liger"},{"que":"Which of the following is not true about the archaeopteryx?","opt1":"the first skeleton was found in 1861","opt2":"it lived in the Early Jurassic period","opt3":"it grew relatively slowly compared to modern birds","opt4":"its German name is Urvogel","ans":"it lived in the Early Jurassic period"},{"que":"The extinction of what animal in 1936 led to the Tasmanian devil becoming the largest carnivorous marsupial in the world?","opt1":"desert rat-kangaroo","opt2":"broad-faced potoroo","opt3":"thylacine","opt4":"toolache wallaby","ans":"thylacine"},{"que":"Which is not true about the binturong?","opt1":"it is a monotypic genus","opt2":"another name of this animal is bearcat","opt3":"its tail is twice shorter than the total length of its body and head ","opt4":"it is native to South and Southeast Asia","ans":"its tail is twice shorter than the total length of its body and head "},{"que":"Based on nuclear studies, the closest living relatives to phorusrhacidae (known also as terror birds) are birds such as:  ","opt1":"secretary birds","opt2":"falcons, parrots and kestrels","opt3":"ravens","opt4":"eagles and hawks","ans":"falcons, parrots and kestrels"},{"que":"Apex predators are always and exclusively hypercarnivores.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"What is true about the moa bird?","opt1":"despite of being flightless, actually moas had wings","opt2":"most of these birds died out about 600 years ago","opt3":"these birds were fierce predators","opt4":"the largest species weighed about 300 kg ","ans":"most of these birds died out about 600 years ago"},{"que":"Crows and ravens are not distinguished by:","opt1":"their life span","opt2":"the areas they inhabit","opt3":"their conservation status","opt4":"the bill size","ans":"their conservation status"},{"que":"Which is not true about the Finnish lapphund?","opt1":"traditionally it has been used for reindeer herding","opt2":"the breed arrived in Northern Europe with Finns","opt3":"its color varies","opt4":"males usually weigh between 17 and 19 kg","ans":"the breed arrived in Northern Europe with Finns"},{"que":"In 2013, a zoo in China tried to cheat its visitors by passing off another animal as lion. What was the animal?","opt1":"a cougar","opt2":"a Tibetan mastiff","opt3":"a chow chow","opt4":"a masked tiger","ans":"a Tibetan mastiff"},{"que":"Which rhinoceros subtype has a single horn instead of two?","opt1":"the Indian rhinoceros","opt2":"the white rhinoceros","opt3":"the black rhinoceros","opt4":"the Sumatran rhinoceros","ans":"the Indian rhinoceros"},{"que":"Which is not true about the giant otter?","opt1":"it is the longest member of the Mustelidae (weasel family)","opt2":"it is a diurnal animal ","opt3":"it is listed as least concern","opt4":"giant otters usually live in groups","ans":"it is listed as least concern"},{"que":"In Japan the number of people losing their lives after being attacked by the giant hornet exceeds this of the victims of homicide (by other people). ","opt1":"True ","opt2":"False ","ans":"False "},{"que":"What kind of animal was the megalonyx?","opt1":"a bigger and earlier version of the hyena","opt2":"a giant ground sloth","opt3":"a more primitive white shark ","opt4":"an ancestor of the grey wolf and other canids","ans":"a giant ground sloth"},{"que":"This constrictor snake's maximum length is eight feet. Its prey consists mainly of birds, frogs and small mammals. Young representatives of the species are orange during the first year of their existence. These snakes have slower metabolism and can go for months without food.  ","opt1":"emerald tree boa","opt2":"carpet python","opt3":"amazon tree boa","opt4":"blood python","ans":"emerald tree boa"},{"que":"The lions of Tsavo, which are said to have killed 135 men (most of them construction workers on the Kenya-Uganda railway) between March and December 1898, had no mane. Why? ","opt1":"they were still quite young","opt2":"they belonged to a specific maneless kind ","opt3":"they were actually lionesses","opt4":"they suffered a disease which caused their mane loss","ans":"they belonged to a specific maneless kind "},{"que":"The female yak is called as","opt1":"gak","opt2":"tak","opt3":"nak","opt4":"sak","ans":"nak"},{"que":"The largest verified captive Kodiak bear in the 20th century weighed nearly 1,000 kilograms.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"What creature can survive without water for nearly 120 years. What is its name?","opt1":"Cockroach","opt2":"Water bear","opt3":"Desert rat","opt4":"Desert frog","ans":"Water bear"},{"que":"After water comes food as an essential part of our life. Without food, no organisms can live. Humans can also live for several days, even weeks without food.  But there are some organisms which can do better. Which of these animals can live for a month without food?","opt1":"Dragon fly","opt2":"Cockroach","opt3":"Termite","opt4":"Ant","ans":"Cockroach"},{"que":"The head is an important part of an animal. It has eyes to see, a nose to smell, a tongue to taste with and even a brain with which to think and act. But there is an organism that can live for nine days even when its head has been cut off. Which of these animals can perform this feat? ","opt1":"Cockroach","opt2":"Snail","opt3":"Beetle","opt4":"Ant","ans":"Cockroach"},{"que":"Do you sleep at night? Of course you do. Now tell me what type of work you can do while sleeping? Of course, nothing. There is a bird that can sleep even during flying. Can you name that bird?","opt1":"Arctic tern","opt2":"Pigeon","opt3":"Albatross","opt4":"Crow","ans":"Albatross"},{"que":"Like the brain, the heart is also an important part of an animal. It pumps blood that circulates through the whole body. How many hearts are beating inside your chest? Of course, the answer is one. Which of these animals has three hearts?","opt1":"Cockroach","opt2":"Octopus","opt3":"Shark","opt4":"Snail","ans":"Octopus"},{"que":"Until now, you have read about brains and hearts. Now it's time to ask about the tongue. The tongue is an interesting muscle that lets us taste food. Do all organisms taste with tongue?  Not all. Which of these animals tastes its food with its legs?","opt1":"Termite","opt2":"House fly","opt3":"Cockroach","opt4":"Ant","ans":"House fly"},{"que":"Can you live if you have being cut in half? No. One of these animals can be cut in half and each piece will grow into a new animal. Which of these animals can perform this trick? ","opt1":"Sea horse","opt2":"Black mamba","opt3":"Starfish","opt4":"Sperm whale","ans":"Starfish"},{"que":"When you sleep, both of your eyelids are closed. There is an animal which can sleep with one eye open. Which of these animals is it? ","opt1":"Sperm Whale","opt2":"Ants","opt3":"Cockroach","opt4":"Dolphin","ans":"Dolphin"},{"que":"Most wild cats have one thing in common in addition to their diet. That is their sound. All big cats can roar.  Which of these large cats can't roar?","opt1":"Cheetah","opt2":"Tiger","opt3":"Lion","opt4":"Jaguar","ans":"Cheetah"},{"que":"Eggs are laid by all birds and most reptiles. All birds lays eggs of different sizes. But which bird's egg is the largest in proportion to its body size?","opt1":"Kiwi","opt2":"Ostrich","opt3":"Albatross","opt4":"Arctic tern","ans":"Kiwi"},{"que":"In the wake of the December 26, 2004, Indian Ocean tsunami a baby hippopotamus was left orphaned but, at a wildlife park, adopted a surprising animal as his mother. What kind of animal was it?","opt1":"Tortoise","opt2":"Gorilla","opt3":"Lion","opt4":"Zebra","ans":"Tortoise"},{"que":"What bird can successfully de-venom a bee in seconds?","opt1":"European bee-eater","opt2":"Crow","opt3":"Kingfisher","opt4":"Piping shrike","ans":"European bee-eater"},{"que":"North Atlantic right whales have been seen with mud on their heads. What reason do scientists give for this?","opt1":"Playing games","opt2":"Swimming upside down on the ocean floor to feed.","opt3":"Rubbing their heads to get rid of mites","opt4":"Diving too deep and hitting their heads","ans":"Swimming upside down on the ocean floor to feed."},{"que":"What is the progressive Atlanta Zoo giving its orangutans to challenge them to become involved in problem solving, as they do in the wild?","opt1":"Abacuses","opt2":"Lego sets","opt3":"Computer games","opt4":"Cabbage patch dolls","ans":"Computer games"},{"que":"Which bird is renowned for its ability to use tools to get food?","opt1":"Hawk","opt2":"Pelican","opt3":"Eagle","opt4":"Crow","ans":"Crow"},{"que":"Many types of birds have been taught to 'talk', or to imitate human speech, but which small Australian birds have been shown to have the largest vocabularies?","opt1":"Budgerigars","opt2":"Galahs","opt3":"Lyrebirds","opt4":"Cockatoos","ans":"Budgerigars"},{"que":"Do elephants mourn their dead?","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"Dogs have been noted for their devotion to their owners. Which Skye Terrier stood guard at his master's grave for fourteen years?","opt1":"Blackfriars Georgie","opt2":"Greyfriars Georgie","opt3":"Blackfriars Bobby","opt4":"Greyfriars Bobby","ans":"Greyfriars Bobby"},{"que":"Which animals performs a victory dance, like some sportsmen do, when they are excited or pleased?","opt1":"elephants","opt2":"ferrets","opt3":"mice","opt4":"sloths","ans":"ferrets"},{"que":"A Belgian product designer, Bart Weetjens, trained which normally disliked animals to sniff out landmines?","opt1":"Snakes","opt2":"Possums","opt3":"Moles","opt4":"Rats","ans":"Rats"},{"que":"Taking measurements from observing animals is central to studying their behavior. What is the name given to the time period between the stimulus and the first occurrence of a certain behavior?","opt1":"Latency","opt2":"Frequency","opt3":"Intensity","opt4":"Duration","ans":"Latency"},{"que":"Which of these is the name given to a list of behaviors you might construct for the animal you are studying, and consists of behaviors that are typical for the species to perform?","opt1":"Anthropomorphism","opt2":"Observation","opt3":"Ethogram","opt4":"Definition","ans":"Ethogram"},{"que":"What is the name given to the frequent error of interpreting animal behavior as if they were humans - for example, if two cockroaches are facing each other and one is standing up while one is crouching, you should not assume that the crouching one is afraid and the other dominant.","opt1":"Pseudo-interpretation","opt2":"Humanization","opt3":"Assumption","opt4":"Anthropomorphism","ans":"Anthropomorphism"},{"que":"Which of these is an example of \"selfish herd\" response?","opt1":"A stag fighting other deer in the herd to mate with females","opt2":"A herd of zebra grazing all the land and not allowing other animals to graze","opt3":"One lion in the group eating most or all of the kill","opt4":"Antelopes grouping together to reduce the risk of an attack by a predator","ans":"Antelopes grouping together to reduce the risk of an attack by a predator"},{"que":"What is the name given to a loss of a response to a stimulus, as opposed to learning a new response - such as town pigeons which build nests on buildings, and frequently interact with humans, who feed them with \"people\" food?","opt1":"Institutionalization","opt2":"Deruralization","opt3":"Urbanization","opt4":"Habituation","ans":"Habituation"},{"que":"Predators can be split into two main categories - \"active\" predators who hunt for their prey, and \"sit and wait\" (also called \"ambush\") predators, who wait for their prey to come to them. True or False: Sit and wait predators tend to live in social groups.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Which of these defense strategies is not a type of camouflage?","opt1":"Mimicry","opt2":"Disruptive coloration","opt3":"Crypsis","opt4":"Masquerade","ans":"Mimicry"},{"que":"Some animals employ escape responses by advertising their good health i.e. that they will be difficult to catch. Which of these animals uses a display of this type, called \"stotting\"?","opt1":"Elephants","opt2":"Thomson's gazelles","opt3":"Peacocks","opt4":"Bolas spiders","ans":"Thomson's gazelles"},{"que":"Reciprocal altruism is a form of mutualism where an individual will help another if they are sure the individual will do them a favor just as good in the future. Would animals be more likely to give favors to others that they already knew?","opt1":"Yes ","opt2":"No ","ans":"Yes "}]