[{"que":"This dog is tall and aristocratic. His long, flowing coat can be almost any colour. He was bred to run.","opt1":"Affenpinscher","opt2":"Akbash Dog","opt3":"Akita","opt4":"Afghan Hound","ans":"Afghan Hound"},{"que":"This medium-sized dog is typically black and white but can come in other colours such as red and white. He is a very intelligent breed with an intense stare. He is happiest when he has a job to do. ","opt1":"Border Collie","opt2":"Belgian Sheepdog","opt3":"Beauceron","opt4":"Basenji","ans":"Border Collie"},{"que":"A natural watchdog, this breed is suspicious of strangers and is a one-family dog. He may date back to 100 BC or longer in his native land. His coat is usually off-standing and thick, with a ruff around the head and neck, and most often seen in black or reddish-gold. He has a blue-black tongue!","opt1":"Chart Polski","opt2":"Chinese Shar Pei","opt3":"Chow Chow","opt4":"Chinese Crested Dog","ans":"Chow Chow"},{"que":"This medium to large smooth-coated breed comes in four colours; the most common is black and tan. His ears can be cropped upright or left natural. He is very intelligent and has been used in guard and police work.He became famous in World War II for his bravery in service.","opt1":"Doberman Pinscher","opt2":"Dogue de Bordeaux","opt3":"Dalmatian","opt4":"Dachshund","ans":"Doberman Pinscher"},{"que":"I am the \"Apollo of Dogs\"! I am one of the tallest breeds you can find today. My smooth coat comes in many colours and I often have my ears cropped upright. And despite my name, I come from Germany! ","opt1":"Great Pyrenees","opt2":"Greyhound","opt3":"Greater Swiss Mountain Dog","opt4":"Great Dane","ans":"Great Dane"},{"que":"This breed is another giant, actually the tallest breed of dog in the world. In the past only the nobility could own one. He has a rough coat usually in grey, fawn, or brindle, and is a powerful and swift runner.","opt1":"Italian Greyhound","opt2":"Irish Wolfhound","opt3":"Ibizan Hound","opt4":"Irish Terrier","ans":"Irish Wolfhound"},{"que":"This large white dog is a herd guardian from Hungary. His coat is of medium length and wavy, with a rough texture, and only comes in white or ivory.","opt1":"Kuvasz","opt2":"Kerry Blue Terrier","opt3":"Keeshond","opt4":"Karelian Bear Dog","ans":"Kuvasz"},{"que":"This dog was bred in Tibetan monasteries for over 2000 years. Although he is small, he makes an excellent guard dog. His long, flowing coat comes in any colour, and he is a happy but assertive pet.","opt1":"Lowchen","opt2":"Lhasa Apso","opt3":"Lakeland Terrier","opt4":"Leonberger","ans":"Lhasa Apso"},{"que":"This dog is a tiny white dynamo. His silky, long coat hangs to the ground and only comes in pure white. ","opt1":"Mastiff","opt2":"Manchester Terrier","opt3":"Maltese","opt4":"Miniature Pinscher","ans":"Maltese"},{"que":"This breed is a large, water-loving dog who hails from Canada. His long, thick coat is black, brown, or black and white (which is called a Landseer).  He weighs in at up to 150 pounds. ","opt1":"Newfoundland","opt2":"Norrbottenspets","opt3":"Norwegian Buhund","opt4":"North American Shepherd","ans":"Newfoundland"},{"que":"This small dog has a medium length flowing coat in white with solid- colour patches. His very large ears are what gives him his name!","opt1":"Pekingese","opt2":"Pomeranian","opt3":"Petit Basset Griffon Vendeen","opt4":"Papillon","ans":"Papillon"},{"que":"Another Canadian breed, this short-coated dog comes in black, chocolate, and yellow. For many years he was the number one owned breed in North America.","opt1":"Retriever, Chesapeake Bay","opt2":"Retriever, Golden","opt3":"Retriever, Flat Coated","opt4":"Retriever, Labrador","ans":"Retriever, Labrador"},{"que":"This medium-sized dog has a soft fawn-coloured coat and is a good choice for families with allergies. He is a terrier, so he is self-confident and alert. ","opt1":"Soft-Coated Wheaten Terrier","opt2":"Silky Terrier","opt3":"Scottish Terrier","opt4":"Skye Terrier","ans":"Soft-Coated Wheaten Terrier"},{"que":"This beautiful hunting dog is silver-grey in colour with a short, glossy coat. He was developed in Germany and is a popular sporting dog and active family companion today.","opt1":"Welsh Terrier","opt2":"Welsh Corgi","opt3":"Weimaraner","opt4":"Whippet","ans":"Weimaraner"},{"que":"Here's a tough one for the last question: What interesting physical trait does the \"Xoloitzcuintli\" have?","opt1":"No hair","opt2":"Black tongue","opt3":"Six toes","opt4":"No tail","ans":"No hair"},{"que":"What dog saved the lives of 40 people while working for monks (1800-1810) at a travelers way station at the 8,100 foot high Great Saint Bernard Pass in the Alps? ","opt1":"Checkers.","opt2":"Gelert.","opt3":"Barry.","opt4":"Greyfriars Bobby.","ans":"Barry."},{"que":"Being adopted by Albany, New York postal employees as a puppy Owney (1888-1897) began traveling with mail carriers on their delivery routes, wagons, railways, and eventually even went on a 113 day world tour sponsored by the USPS. Due to having traveled an estimated 114,000 miles with post office personnel it's not surprising that Owney is recognized as the mascot for what organization?\r\n","opt1":"Society for the Prevention of Cruelty to Animals.","opt2":"Travelers Insurance.","opt3":"United States Postal Service.","opt4":"New York Transit Authority.","ans":"United States Postal Service."},{"que":"During World War I, an American Pit Bull Terrier named \"Stubby\" of the 102nd Infantry Division was awarded the rank of sergeant for which of the following acts of valor? ","opt1":"Capturing a German forward observer.","opt2":"Warning soldiers of poison gas.","opt3":"Participating in more than a dozen battles.","opt4":"Sniffing out wounded troops and leading them to safety and/or summoning help.","ans":"Capturing a German forward observer."},{"que":"In 1925, which Siberian Husky traveled through -70 degree temperatures, near whiteout conditions, and gale force winds for 91 miles to relay serum for use in combating a diptheria epidemic in Nome, Alaska? \r\n","opt1":"Moctoc.","opt2":"Alaska Slim.","opt3":"Balto.","opt4":"Togo.","ans":"Togo."},{"que":"Jim (1925-1937), a Llewelyn setter, was dubbed the \"Wonder Dog\" by his hometown of Marshall, Missouri for being able perform which of the following tasks?\r\n\r\n","opt1":"Read messages.","opt2":"All of the answers are correct.","opt3":"Identify cars by being told the plate number.","opt4":"Identify people by being told their physical characteristics.","ans":"All of the answers are correct."},{"que":"At Tokyo's Shibuya train station a statue honors an Akita dog, Hachiko, that visited the train station every day at 3 o'clock for 11 years (1925-1935) in anticipation of what event?","opt1":"Chasing commuters off the platform.","opt2":"The return of his deceased master.","opt3":"Unloading of fresh fish.","opt4":"Howling with the train whistle.","ans":"The return of his deceased master."},{"que":"Bamse, a Saint Bernard, served with the Free Norwegian Forces on the ship \"Thorrud\" stationed in Dundee and Montrose, Scotland during World War II and is noted for having performed which of the following deeds?","opt1":"Shoved a knife wielding assailant off a dock to save a fellow sailor.","opt2":"Spontaneously saved at least one sailor from drowning.","opt3":"All of the choices are correct.","opt4":"Traveled by bus on his own to neighboring towns to track down errant crew members.","ans":"All of the choices are correct."},{"que":"Bothie, a Jack Russell Terrier, accompanied Sir Ranulf and Lady Virginia Fiennes on the Transglobe Expedition (1979-1982) to circumnavigate the planet making him the first dog to visit which pole(s)?","opt1":"North Pole.","opt2":"None of the choices are correct.","opt3":"South Pole.","opt4":"North and South Poles.","ans":"North and South Poles."},{"que":"On September 11, 2001, a four year old Labrador retriever named \"Dorado\" insisted on spending one hour guiding his blind master down 70 floors of the north tower of what building? ","opt1":"Bank of America Tower.","opt2":"Empire State Building.","opt3":"Flatiron Building.","opt4":"World Trade Center","ans":"World Trade Center"},{"que":"On February 6, 2006, a Beagle named \"Belle\" was unsuccessful in making her master understand that his blood sugar level was dangerously low. When Kevin Weaver inevitably collapsed due to low blood sugar what did Belle do to save his life? ","opt1":"Administered hard candies orally.","opt2":"Barked until a human being arrived to render assistance.","opt3":"Called 911.","opt4":"Administered an insulin shot.","ans":"Called 911."},{"que":"The American pit bull terrier was originally bred as a guard dog.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Because of their great intelligence, Border Collies make excellent pets for \"couch potatoes\".","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Most adult dogs have dental disease.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"The most common dental disease in dogs is cavities.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Standard poodles can make good hunting dogs.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Most short-tailed dogs, like Cocker Spaniels, Doberman Pinschers, Jack Russell Terriers and Rottweilers, are born with short tails.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"In the United States, most dogs turned in to animal shelters and pounds are adopted.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"In many areas of the United States, dogs from animal shelters are sold to research laboratories for experimentation.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"A dog with a wagging tail is always happy.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Dogs yawn because they are bored.","opt1":"True ","opt2":"False ","ans":"False "}]