[{"que":"The American alligator is the apex predator of the Everglades, Florida, USA. What is the only other country where you can naturally find alligators?","opt1":"China","opt2":"Antarctica","opt3":"Brazil","opt4":"Madagascar","ans":"China"},{"que":"Some alligators are born leucisitic, meaning they are mostly white. Is this an advantage?","opt1":"Yes ","opt2":"No ","ans":"No "},{"que":"What snake is known for inflating its body with air, then contracting and making a loud hissing noise?","opt1":"velociraptor","opt2":"puff adder","opt3":"toady","opt4":"sea squab","ans":"puff adder"},{"que":"The largest lizard species in the world is the Komodo dragon, which can grow to 7-10 feet or 2-3 meters long. Where would you find this formidable creature in its native habitat?","opt1":"West Indies","opt2":"Gibraltar","opt3":"Indonesia","opt4":"Madagascar","ans":"Indonesia"},{"que":"Another desert-dwelling snake is the western diamondback. Which of these statements is about the western diamondback is FALSE?","opt1":"It is important to the desert ecosystem.","opt2":"It can swim.","opt3":"It preys on human beings.","opt4":"It is one of the largest snakes in the southwestern USA.","ans":"It preys on human beings."},{"que":"In the Florida everglades, one often thinks of animals like alligators and snakes, but there's another dangerous animal that might get overlooked (and shouldn't). What's another reptile potentially dangerous to careless human beings?","opt1":"poison frog","opt2":"snapping turtle","opt3":"dragonfly","opt4":"capybara","ans":"snapping turtle"},{"que":"The matamata turtle might get overlooked because it is camouflaged to blend in with its surroundings. What does \"matamata\" in the native South American language from which it is named?","opt1":"I fly, I fly","opt2":"Hello","opt3":"I kill, I kill","opt4":"It's just nonsense syllables","ans":"I kill, I kill"},{"que":"You should avoid feeding adult alligators because they are so large and dangerous, but it is okay to feed baby alligators in the wild.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Which type of reptile has the largest number of species?","opt1":"Snakes","opt2":"Lizards","opt3":"Turtles","opt4":"Crocodilians","ans":"Lizards"},{"que":"Which type of reptile is represented by only 2 living species?","opt1":"Amphisbaenians","opt2":"Crocodilians","opt3":"Tuatara","opt4":"Turtles","ans":"Tuatara"},{"que":"What is the Jacobson's organ used for?","opt1":"Sense of sight","opt2":"Sense of touch","opt3":"Sense of hearing","opt4":"Sense of smell","ans":"Sense of smell"},{"que":"What does it mean for a snake to be \"viviparous\"?","opt1":"Warm blooded","opt2":"Cold blooded","opt3":"Lays eggs","opt4":"Bears live young","ans":"Bears live young"},{"que":"Closely related to snakes and lizards, this type of reptile spends the majority of its time underground.","opt1":"Tuataras","opt2":"Caecilians","opt3":"Turtles","opt4":"Amphisbaenians","ans":"Amphisbaenians"},{"que":"Are there any vegetarian snakes?","opt1":"Yes ","opt2":"No ","ans":"No "},{"que":"This type of reptile is the oldest living form of reptile, and it has changed little in over 200 million years.","opt1":"Turtles","opt2":"Lizards","opt3":"Crocodilians","opt4":"Snakes","ans":"Turtles"},{"que":"Snakes exist in almost all parts of the world. Which of the following is the exception?","opt1":"Polar regions","opt2":"Deserts","opt3":"Caves","opt4":"Oceans","ans":"Polar regions"},{"que":"In Linnean classification, in what order do lizards and snakes belong?","opt1":"Testudinata","opt2":"Crocodilia","opt3":"Reptilia","opt4":"Squamata","ans":"Squamata"}]