[{"que":"Which form of dementia was named after the German neuropathologist and psychiatrist who identified the first case of the disease in 1901?","opt1":"Addison's disease","opt2":"Abercrombie's disease","opt3":"Alzheimer's disease","opt4":"Alpers' disease","ans":"Alzheimer's disease"},{"que":"This syndrome results in mental retardation and a characteristic facial and bodily appearance, and was named for the doctor who first described it in the 1860s. What is the name of this chromosomal disorder?","opt1":"Pearson syndrome","opt2":"Klinefelter's syndrome","opt3":"Edwards syndrome","opt4":"Down syndrome","ans":"Down syndrome"},{"que":"Which form of lymphoma with one of the highest survival rates amongst cancers took its name from the physician who first described the condition in 1832?","opt1":"Bright's disease","opt2":"Addison's disease","opt3":"Hodgkin's disease","opt4":"Wilk's tumor","ans":"Hodgkin's disease"},{"que":"This rare, neurodegenerative disorder is characterized by movement abnormalities or chorea, and typically manifests itself in sufferers between 35 to 44 years of age. It was named for the Long Island physician who was the first to write a precise description of the disease in 1872. What is it called?","opt1":"Behr's syndrome","opt2":"Gilbert syndrome","opt3":"Huntington's disease","opt4":"Alexander disease","ans":"Huntington's disease"},{"que":"What form of skin cancer took its name from the Hungarian dermatologist who first described the disease in 1872?","opt1":"Ewing's sarcoma","opt2":"Askin's tumor","opt3":"Filatov's disease","opt4":"Kaposi sarcoma","ans":"Kaposi sarcoma"},{"que":"Amyotrophic lateral sclerosis (ALS) is a disease that caused degeneration of the motor neurons of the central nervous system, resulting in loss of voluntary muscle control, and ultimately death. What is the colloquial name for this disease in the United States?","opt1":"Lou Gehrig's disease","opt2":"David Niven's disease","opt3":"Charlie Mingus' disease","opt4":"Stephen Hawking's disease","ans":"Lou Gehrig's disease"},{"que":"Which condition, which took its name from an Austrian pediatrician, usually manifests itself during childhood as a pattern of symptoms that includes difficulties with communication and social interaction and a tendency to carry out repetitive activities?","opt1":"Rett syndrome","opt2":"Turner syndrome","opt3":"Korsakoff's syndrome","opt4":"Asperger syndrome","ans":"Asperger syndrome"},{"que":"Persons afflicted with this condition suffer from defects in their connective tissue, and are typically tall and slender with long limbs and digits. What is the name of this genetic disorder, which was named for the French pediatrician who was the first to make a detailed description of the condition in 1896?","opt1":"Morquio syndrome","opt2":"Winchester syndrome","opt3":"Marfan syndrome","opt4":"Donohue syndrome","ans":"Marfan syndrome"},{"que":"Which degenerative disease was named for the English surgeon who first made a detailed description of the condition in a paper entitled \"An Essay on the Shaking Palsy\"?","opt1":"Parkinson's disease","opt2":"Sydenham's chorea","opt3":"Wilson's disease","opt4":"Bell's palsy","ans":"Parkinson's disease"},{"que":"Which illness was named after the French neurologist who published \"Study of a Nervous Affliction\", an account of nine patients who were afflicted with the disorder?","opt1":"Dressler's syndrome","opt2":"Cushing's syndrome","opt3":"Tourette's syndrome","opt4":"Caplan's syndrome","ans":"Tourette's syndrome"},{"que":"How many chambers does a human heart have?","opt1":"1","opt2":10,"opt3":4,"opt4":40,"ans":"4"},{"que":"What are the sections that human lungs are divided into called?","opt1":"Lobes","opt2":"Caverns","opt3":"Chambers","opt4":"Bags","ans":"Lobes"},{"que":"What nerve transmits information from the eye's retina to the brain?","opt1":"Motor","opt2":"Spinal accessory","opt3":"Optic","opt4":"Facial","ans":"Optic"},{"que":"Which is NOT a basic life function controlled by the brain stem?","opt1":"Breathing","opt2":"Problem solving","opt3":"Heartbeat","opt4":"Blood pressure","ans":"Problem solving"},{"que":"People with type one diabetes have problems with which organ?","opt1":"Pancreas","opt2":"Heart","opt3":"Lung","opt4":"Brain","ans":"Pancreas"},{"que":"I am putting deodorant on my axilla. What is an axilla?","opt1":"Foot arch","opt2":"Stomach","opt3":"Arm pit","opt4":"Elbow","ans":"Arm pit"},{"que":"What is the name of a muscle group located on the upper arm?","opt1":"Glutes","opt2":"Hamstrings","opt3":"Biceps","opt4":"Pectoral","ans":"Biceps"},{"que":"You get that \"funny bone feeling\" when the ulnar nerve hits the distal end of what arm bone?","opt1":"Femur","opt2":"Humerus","opt3":"Zygomatic","opt4":"Scapula","ans":"Humerus"},{"que":"What do we call it when our sensory nerves receive noxious stimuli?","opt1":"Pain","opt2":"Pleasure","opt3":"Vibration","opt4":"Numbness","ans":"Pain"},{"que":"What is NOT the name of a system of the human body?","opt1":"Immune system","opt2":"Digestive system","opt3":"Nervous system","opt4":"Heart system","ans":"Heart system"},{"que":"The 'instructions' contained in every cell that has a nucleus are 'written' in...","opt1":"Sugars","opt2":"T-RNA","opt3":"DNA","opt4":"Mitochondria","ans":"DNA"},{"que":"Humans have how many total chromosomes?","opt1":42,"opt2":48,"opt3":46,"opt4":34,"ans":"46"},{"que":"Which of the following creatures has the most chromosomes?","opt1":"Dog","opt2":"Fruit fly","opt3":"Human","opt4":"Goldfish","ans":"Goldfish"},{"que":"Humans have two chromosomes that determine sex- X and Y. Which of the following karyotypes (chromosome types) would be a normal female?","opt1":"XXY","opt2":"YY","opt3":"XY","opt4":"XX","ans":"XX"},{"que":"Most nasty genetic disorders are recessive- you need two bad copies of the gene to come down with the disease. Some are dominant- if you have just one of the bad genes, you will get the disease. Which of the following disorders has dominant inheritance?","opt1":"Tay-Sach's disease","opt2":"Huntington's chorea","opt3":"Phenylketonuria","opt4":"Cystic fibrosis.","ans":"Huntington's chorea"},{"que":"In Venetian Floozies, purple stripe color is autosomally dominant over pink. If you mate a male purple striped Floozy that does not carry the pink gene to a female pink Floozy, what percentage of the offspring would you expect to have purple stripes?","opt1":"100 percent","opt2":"0 percent","opt3":"50 percent","opt4":"25 percent","ans":"100 percent"},{"que":"Who discovered the basics of genetics while pottering around in the garden?","opt1":"James Watson","opt2":"Albert Einstein","opt3":"Charles Darwin","opt4":"Gregor Mendel","ans":"Gregor Mendel"},{"que":"Watson and Crick won a Nobel Prize for their discovery of...","opt1":"Mitosis","opt2":"The inheritance pattern of Tay-Sachs disease","opt3":"The protein coding system of RNA","opt4":"The structure of DNA","ans":"The structure of DNA"},{"que":"Some genetic disorders are maintained in a population because, if an individual has only one bad copy of the gene, some survival advantage is maintained. People with just one copy of a particular mutated gene are protected from malaria. If they have two bad copies of the same gene, they have the disease...","opt1":"Sickle cell anemia","opt2":"Muscular dystrophy","opt3":"Amyotrophic lateral sclerosis","opt4":"Hemophilia","ans":"Sickle cell anemia"},{"que":"When the cell is not busy dividing, the chromosomes 'unwind and relax'. What are they called when they are in this form?","opt1":"Chloroplasts","opt2":"Endoplasmic reticulum","opt3":"Chromatin","opt4":"Plasmids","ans":"Chromatin"},{"que":"You come in to Dr. Deputy complaining of sore throat, pain when swallowing, fever, aches, chills and swollen neck glands.  Please don't breathe on Dr. Deputy.  What's the matter with you?","opt1":"Alopecia","opt2":"Tonsillitis","opt3":"Malaria","opt4":"Bronchitis","ans":"Tonsillitis"},{"que":"You have been diagnosed with a deviated septum.  Where would that be?","opt1":"Who you calling deviated, bub?","opt2":"Shoulder","opt3":"Nose","opt4":"Pelvis","ans":"Nose"},{"que":"Dr. Deputy observes that your mouth and one eyelid droop.  You also appear to be unable to move one side of your face.  What's the matter?","opt1":"Irritable bowel syndrome","opt2":"Bell's palsy","opt3":"Rheumatic fever","opt4":"Malabsorption","ans":"Bell's palsy"},{"que":"Emerson Moser, senior crayon maker for Crayola, was actually color blind.  What colors can a person usually with a form of color blindness not perceive?","opt1":"Mauve and puce","opt2":"Black and white","opt3":"Red and green","opt4":"Yellow and orange","ans":"Red and green"},{"que":"You are having chest pains--they may range from slight pressure to crushing pain.  The pains extend to the left shoulder, down the arm, and possibly into the jaw.  You are also light-headed, sweating, nauseous and short of breath.  Of these choices, what's the matter?","opt1":"Rubella","opt2":"Angina","opt3":"Rheumatic fever","opt4":"Stroke","ans":"Angina"},{"que":"You come in with a cough that sounds like barking.  You are wheezing, have a fever, have trouble swallowing and have general cold symptoms.  I should also mention that you are a child.  What's the matter?","opt1":"Scabies","opt2":"Quinsy","opt3":"Croup","opt4":"Rubella","ans":"Croup"},{"que":"You feel nauseous and experience a spinning sensation.  You say you are sure you have labyrinthitis.  So where should I check?","opt1":"Heart","opt2":"Pelvis","opt3":"Eyes","opt4":"Ear","ans":"Ear"},{"que":"You have severe pain in your lower back and groin accompanied by blood in your urine.  You also feel nausea and keep getting infections.  What's the matter?","opt1":"Huntington's chorea","opt2":"Kidney stones","opt3":"Pleurisy","opt4":"Typhoid fever","ans":"Kidney stones"},{"que":"My wife sometimes accuses me of being unable to speak, write or understand the meaning of words.  It usually happens when she is talking about stuff I need to do around the house.  Or at least I think that's when it happens.  I'm not sure.  But I think I have a disorder.  What disorder could cause a person to suddenly be unable to speak, write or understand words?","opt1":"Fasciitis","opt2":"Aphasia","opt3":"Anemia","opt4":"Lycanthropy","ans":"Aphasia"},{"que":"Your mouth and fingernail beds are blue.  You have such trouble breathing that you have to resort to exaggerated chest movements and your shortness of breath is getting worse.  You have lost weight because of this condition.  What's the matter?","opt1":"Bronchitis","opt2":"Pneumonia","opt3":"Emphysema","opt4":"You are tired of this quiz","ans":"Emphysema"}]