[{"que":"What we usually refer to as our \"fat\" is sometimes referred to as \"white fat\". It protects our organs and may provide chemical energy (in the form of ATP). But what function does \"brown fat\" perform?","opt1":"Oxidation of poisons ","opt2":"Long-term storage of fat","opt3":"Feeds the brain ","opt4":"Generation of heat","ans":"Generation of heat"},{"que":"Cholesterol is one of the most commonly talked about lipids. Which of the following best describes cholesterol?","opt1":"A mostly hydrophobic molecule with four fused hydrocarbon rings","opt2":"A phenyl group","opt3":"An amino group with a fatty acid chain","opt4":"A linear, poly-unsaturated alcohol","ans":"A mostly hydrophobic molecule with four fused hydrocarbon rings"},{"que":"Lipids must be transported in the blood. But lipids are non-polar, and plasma is a polar solvent. How are lipids usually transported in the blood?","opt1":"They are carried in white blood cells","opt2":"They are highly glycosylated to make them more polar ","opt3":"They are surrounded by erythrocytes ","opt4":"They are packaged in proteins known as lipoproteins","ans":"They are packaged in proteins known as lipoproteins"},{"que":"One of the most fascinating proteins in the body is one called ApoE. It has a host of diverse functions which may be important to advances in human medicine. One such function is the clearance of \"bad cholesterol\" from the blood. What disorder is common in people with mutated ApoE genes?","opt1":"Deafness ","opt2":"Colour blindness ","opt3":"Huntington's disease ","opt4":"Familial hyperlipidaemia ","ans":"Familial hyperlipidaemia "},{"que":"The body can safely store lipids in adipocytes, but high amounts of lipids in the blood may lead to this lipid being deposited in inappropriate and unsafe places. What term is used to refer to these misplaced lipids?","opt1":"Invading lipids ","opt2":"Awkward lipids ","opt3":"Ectopic lipids ","opt4":"Alien lipids","ans":"Ectopic lipids "},{"que":"In order to form the various lipids which keep us alive, we must first digest the lipids we take in in our diet. What is the name for the group of enzymes responsible for this?","opt1":"Lipases","opt2":"Fatases ","opt3":"Chubases ","opt4":"Greasases","ans":"Lipases"},{"que":"Cell membranes (as well as the membranes which enclose organelles) are made of phospholipids, which can exist in a number of different varieties. The distribution of different phospholipids helps to determine the character of the membrane. What rather literal name is given to the group of enzymes responsible for this distribution?","opt1":"Movases","opt2":"Budgases","opt3":"Flippases","opt4":"Shiftases ","ans":"Flippases"},{"que":"This group of lipids were so mysterious when they were discovered that they were named after an enigmatic creature from Egyptian mythology. These lipids are similar to glycerophospholipids, but they contain no glycerol and can have a myriad of groups attached to them. What are they called?","opt1":"Sphingolipids","opt2":"Sirolipids ","opt3":"Centaulipids ","opt4":"Medusalipids","ans":"Sphingolipids"},{"que":"Waxes play several biological roles. They consist of two main components. One is a long chain fatty acid. What is the other?","opt1":"A short chain fatty acid ","opt2":"A long chain alcohol","opt3":"An amino acid ","opt4":"A metal ion","ans":"A long chain alcohol"},{"que":"In cells, a process known as beta-oxidation is used to obtain energy using fatty acids as a fuel source. This usually occurs in the mitochondrial matrix, but in which other organelle can it occur?","opt1":"Lysosome","opt2":"Ribosome ","opt3":"Golgi body ","opt4":"Peroxisome","ans":"Peroxisome"},{"que":"The part of an enzyme that is used to break down or construct molecules is known as the active WHAT?","opt1":"Zone","opt2":"Complex","opt3":"Site","opt4":"Structure","ans":"Site"},{"que":"Why can't the enzymes in saliva work in the stomach?","opt1":"The stomach is moving too much","opt2":"It is too dark","opt3":"They get broken down by bacteria","opt4":"Conditions are too acidic","ans":"Conditions are too acidic"},{"que":"When enzymes are heated above a certain temperature, what process do they undergo?","opt1":"Petrification","opt2":"Desiccation","opt3":"Denaturation","opt4":"Disintegration","ans":"Denaturation"},{"que":"Maltase is an important enzyme found in the...?","opt1":"Tissue Fluid","opt2":"Ileum","opt3":"Cells of the gut wall","opt4":"Oesophagus","ans":"Cells of the gut wall"},{"que":"Pectinases break down which of the following?","opt1":"Lactic acids","opt2":"Wood","opt3":"Collagen","opt4":"Fruit","ans":"Fruit"},{"que":"Which of the following groups are the main producers of cellulase, an enzyme used to break down cellulose in plant cell walls?","opt1":"Bacteria","opt2":"Fungi","opt3":"Herbivores","opt4":"Carnivores","ans":"Fungi"},{"que":"Which organelle, also known as a suicide bag, is used to break down a cell once it has died?","opt1":"Cytoplasm","opt2":"Lysosome","opt3":"Nucleus","opt4":"Centriole","ans":"Lysosome"},{"que":"Normally, trypsin is produced by which organ?","opt1":"Pancreas","opt2":"Stomach","opt3":"Liver","opt4":"Kidney","ans":"Pancreas"},{"que":"What process is the enzyme \"RuBisCO\" used in?","opt1":"Photosynthesis","opt2":"Respiration","opt3":"Mass flow","opt4":"Digestion","ans":"Photosynthesis"},{"que":"RNA polymerase is involved in which of the following processes? ","opt1":"Photosynthesis","opt2":"Phagocytosis","opt3":"Sparging","opt4":"Transcription","ans":"Transcription"},{"que":"What, exactly, is the theory of evolution?","opt1":"Humans evolved from apes","opt2":"Life always becomes more complex","opt3":"New species have arisen through a process of random mutations","opt4":"Living things are related to each other through common ancestry from earlier forms that were different from them","ans":"Living things are related to each other through common ancestry from earlier forms that were different from them"},{"que":"Evolution is just a theory, which means it can't really be a fact.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Which of the following is the most powerful driving force of evolution?","opt1":"Natural selection","opt2":"Random mutation","opt3":"Genetic drift","opt4":"Isolation","ans":"Natural selection"},{"que":"The National Academy of Sciences advises that students in biology classes should be taught creation theory as well as evolution.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"A popular argument by creationists is that evolution could never have occurred because it is so unlikely. As one example, they have stated,' There are n! (n-factorial: n x n-1 x n-2 x...x 1) ways of an enzyme or DNA strand of n parts forming prebiotically. Since the smallest proteins have at least 100 amino acids, the chance of forming a particular enzyme prebiotically is at most 1 divided by 100!, which is small enough to be disregarded.' What is wrong with this argument?","opt1":"Larger proteins have fewer amino acids","opt2":"Complex molecules don't form by chance alone","opt3":"Enzymes can only be formed in living things","opt4":"The math is incorrect","ans":"Complex molecules don't form by chance alone"},{"que":"Evolution is impossible because it breaks the Second Law of Thermodynamics, which states that the entropy (disorder) of a system increases over time.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Human embryos have tails.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"Male humans have one less pair of ribs than female humans.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Bacteria and viruses are mentioned in the Bible.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"The hair stands up on the back of our necks when we are afraid. What does this have to do with evolution?","opt1":"It shows our muscular structure is similar to that of apes","opt2":"Nothing","opt3":"Our ancestors looked bigger when they were frightened if their hair stood up","opt4":"Only humans have evolved this gesture","ans":"Our ancestors looked bigger when they were frightened if their hair stood up"},{"que":"What do goosebumps have to do with evolution?","opt1":"Our ancestors were warmer when they fluffed up their hair","opt2":"They are unique to humans","opt3":"They prove we are related to birds","opt4":"Nothing","ans":"Our ancestors were warmer when they fluffed up their hair"},{"que":"We humans have lower back pain, varicose veins, and childbirth difficulties- what do these have to do with evolution?","opt1":"They are examples of inferior design","opt2":"Nothing","opt3":"They cannot have evolved because they are harmful","opt4":"They are shared with chimpanzees","ans":"They are examples of inferior design"},{"que":"Which of the following animals has the most ideally-engineered eye-i.e., from an engineering standpoint, the eye that makes the most \"sense\" in the arrangement of its structures?","opt1":"Human","opt2":"Eagle","opt3":"Fly","opt4":"Squid","ans":"Squid"},{"que":"Why do carnivores present a problem for creationist theory?","opt1":"Why would a just God have created killer animals?","opt2":"They aren't mentioned in the Bible","opt3":"Supposedly, all animals were originally designed as herbivores, so why were the carnivore modifications (like fangs and claws) created in the original animals?","opt4":"They don't","ans":"Supposedly, all animals were originally designed as herbivores, so why were the carnivore modifications (like fangs and claws) created in the original animals?"},{"que":"What one characteristic below do all mammals share?","opt1":"Five digits per limb- either complete or vestigial","opt2":"Well-developed sense of sight","opt3":"Give birth to live young","opt4":"Hair at all stages of development","ans":"Five digits per limb- either complete or vestigial"},{"que":"Why do men and other male mammals have nipples?","opt1":"Some male mammals give milk","opt2":"There is no reason, they were just created that way","opt3":"Males need them to produce hormones","opt4":"As embryos, all mammals start out phenotypically female","ans":"As embryos, all mammals start out phenotypically female"},{"que":"Creationists claim that fossils are the remains of the living organisms that perished in Noah's Flood. The Karoo Formation in Africa contains the remains of over 800 billion vertebrate animals. If this were a true representation of how many vertebrates were killed in the flood, how many vertebrate animals would each acre of land on Earth have held at the time of the flood?","opt1":2100,"opt2":2,"opt3":12,"opt4":134,"ans":"2100"},{"que":"Most religious groups oppose evolutionary theory.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"What is the only state in the US, as of November, 2001, that mandates an anti-evolution warning in its textbooks?","opt1":"Georgia","opt2":"Arkansas","opt3":"Missouri","opt4":"Alabama","ans":"Alabama"},{"que":"What is the main argument given by scientists for why creationism should not be given 'equal time' in our science classes?","opt1":"Scientists do not believe in God","opt2":"Scientists think that they have all the answers","opt3":"Science is not a democratic process","opt4":"Most scientists accept creationism","ans":"Science is not a democratic process"},{"que":"Let's talk about the cell cycle! As its name suggests, this cycle is a very generally applicable one, which in its broad outlines is common to just about every living cell. In cells with nuclei, the division phase of the cell cycle is called mitosis. Which of the following statements about mitosis is true, if everything goes right?","opt1":"Up to 1000 daughter cells may result from a single mitosis process.","opt2":"The two daughter cells are genetically identical to the parent cell.","opt3":"The daughter cell is the genetic fusion of two parent cells.","opt4":"The daughter cell has only a half-set of chromosomes compared to its parent.","ans":"The two daughter cells are genetically identical to the parent cell."},{"que":"Mitosis is probably the most exciting part of the eukaryotic cell cycle, but it doesn't take up a very long time in the life of a cell. What's the name of the longest phase of the cell cycle?","opt1":"Telophase","opt2":"Anaphase","opt3":"Interphase","opt4":"Prophase","ans":"Interphase"},{"que":"Where do cells get their energy, anyway? Ultimately, almost all that fuel comes from sunlight, which is converted to food via photosynthesis. In a typical photosynthetic reaction, a plant cell might produce sugars, oxygen, and water, starting from only a few raw materials: water, sunlight, and what else?","opt1":"Carbon dioxide","opt2":"Helium gas","opt3":"Carbon monoxide","opt4":"Salt","ans":"Carbon dioxide"},{"que":"Photosynthesis is a highly specialized process. Not just anyone can do it - in fact, no animals whatsoever can - and, even in a photosynthetic organism, it doesn't happen just anywhere. What's the name of the organelle that performs photosynthesis in plant cells?","opt1":"Chloroplast","opt2":"Mitochondrion","opt3":"Lysosome","opt4":"Vacuole","ans":"Chloroplast"},{"que":"In the second stage of photosynthesis, often called the Calvin cycle, stored energy from sunlight powers the transformation of water and carbon dioxide into organic compounds. What's another name for this accomplishment?","opt1":"Carbon fixation","opt2":"Nitrogen fixation","opt3":"Precipitation","opt4":"Circulation","ans":"Carbon fixation"},{"que":"Cells need energy to function, and a popular process for converting sugars to a usable fuel source is called cellular respiration. There are two main ways to go about this: anaerobic respiration and aerobic respiration. What is the difference between them?","opt1":"Whether the process uses oxygen","opt2":"How much the cell moves","opt3":"Whether the result is another sugar","opt4":"Whether the process uses water","ans":"Whether the process uses oxygen"},{"que":"Let's take a closer look at aerobic respiration. A cyclical process drives much of the energy production here. Two molecules of water and an acetate molecule - acetyl-CoA - go into the cycle; carbon dioxide, NADH, and reduced ubiquinone come out. Which of these names refers to this cycle?","opt1":"Glycolysis","opt2":"Acetate cycle","opt3":"Lactic acid cycle","opt4":"Citric acid cycle","ans":"Citric acid cycle"},{"que":"Not all cells make energy via cellular respiration: some use fermentation instead. Which of these is NOT a product of fermentation, if we count glycolysis as part of the process?","opt1":"Lactic acid","opt2":"Adenosine triphosphate","opt3":"Ethanol","opt4":"Oxygen gas","ans":"Oxygen gas"},{"que":"For cells with nuclei - eukaryotes - sexual reproduction relies on a process called meiosis, but a mistake in that process will result in a genetic condition that may be fatal. In humans, three such conditions are Klinefelter Syndrome, Triple X Syndrome, and Turner Syndrome; what do they have in common?","opt1":"An abnormal number of sex chromosomes","opt2":"Fragile, short-lived cells","opt3":"Inability to process some proteins","opt4":"Development of extra organs","ans":"An abnormal number of sex chromosomes"},{"que":"Meiosis begins with a single, eukaryotic, diploid cell - that is, a cell with a nucleus that has two copies of each chromosome - and ends up with four of what kind of cell?","opt1":"Haploid: one copy of each chromosome","opt2":"Triploid: three copies of each chromosome","opt3":"Semikaryotic: a poorly isolated cell nucleus","opt4":"Prokaryotic: no cell nucleus","ans":"Haploid: one copy of each chromosome"},{"que":"Plant and animal cells contain different organelles. Which of the following is only found in plant cells?","opt1":"Chloroplast ","opt2":"Cell Membrane","opt3":"Nucleus ","opt4":"Mitochondria ","ans":"Chloroplast "},{"que":"The part of the cell cycle where the cell nucleus divides is called mitosis. What is the name of the phase of in which division of the cytoplasm occurs?","opt1":"Cytophase","opt2":"Prophase","opt3":"Anaphase","opt4":"Cytokinesis ","ans":"Cytokinesis "},{"que":"Cellular respiration is the process in which cells release energy. In which organelle does it occur in?","opt1":"Mitochondria ","opt2":"Ribosome ","opt3":"Lysosome ","opt4":"Nucleus ","ans":"Mitochondria "},{"que":"Cell division is controlled by the centrioles. Which of the following is a disease of the cell cycle in which cells have lost control of division?  ","opt1":"Cyclin","opt2":"Cancer","opt3":"Mitosis failure ","opt4":"Cell Disease ","ans":"Cancer"},{"que":"Cells move things in and out through the cell membrane. Diffusion occurs when these objects - molecules - move from an area where there are more of them to an area where there are fewer of them. What is diffusion of water called?","opt1":"Water Displacement ","opt2":"Active Transport","opt3":"Water Diffusion","opt4":"Osmosis ","ans":"Osmosis "},{"que":"Glycolysis is anaerobic, which means it does not require oxygen. It occurs in the cytoplasm and produces two molecules of ATP energy. If oxygen is present, which of the following processes that consists of two stages occurs in the mitochondria and produces 36 more ATP molecules?","opt1":"Mitosis","opt2":"Cellular Respiration ","opt3":"Phtosynthesis","opt4":"Fermentation ","ans":"Cellular Respiration "},{"que":"Photosynthesis and cellular respiration are opposite cell processes. One puts this compound into the atmosphere and the other one takes it out. Which compound fits this description?","opt1":"Carbon Monoxide ","opt2":"Hydrogen","opt3":"Nitrogen","opt4":"Carbon Dioxide ","ans":"Carbon Dioxide "},{"que":"Plants need more support than animals to keep their shape. Which of the following is found outside of the cell membrane of plant cells to perform this function?","opt1":"Chloroplast ","opt2":"Cell Wall","opt3":"Ribosome","opt4":"Nucleus ","ans":"Cell Wall"},{"que":"Cells contain DNA which contains the instructions that cells need to operate and divide. All cells of the same type have identical DNA. DNA is located in the nucleus inside what structure? ","opt1":"Cytoplasm","opt2":"Ribosomes","opt3":"Chromosomes","opt4":"Lysosomes","ans":"Chromosomes"},{"que":"During the cell cycle chromosomes duplicate so that each cell has the same amount of DNA after cell division. When the chromosomes duplicate, they form two identical structures attached in the middle. What are these two structures (not the attachment point) called?    ","opt1":"Centromere","opt2":"Chromatids","opt3":"Endoplasmic Reticulum ","opt4":"Ribosomes ","ans":"Chromatids"},{"que":"What was the first virus ever discovered?","opt1":"AIDS vius","opt2":"Tobacco mosaic virus","opt3":"Epstein-Barr virus","opt4":"Rhinovirus","ans":"Tobacco mosaic virus"},{"que":"Which of the following cannot be the structure of the genes of a virus?","opt1":"A strand composed of both RNA and DNA","opt2":"Double stranded DNA","opt3":"Double stranded RNA","opt4":"Single stranded DNA","ans":"A strand composed of both RNA and DNA"},{"que":"What type of molecule is the capsid surrounding the virus made of?","opt1":"RNA","opt2":"DNA","opt3":"Protein","opt4":"Cellulose","ans":"Protein"},{"que":"What is the reproductive cycle of a phage virus called in which the virus's DNA is combined with the host cell's DNA to form a prophage?","opt1":"Mitosis","opt2":"Lytic cycle","opt3":"Lysogenic cycle","opt4":"Meiosis I","ans":"Lysogenic cycle"},{"que":"Which enzyme are retroviruses equiped with that allows them to transcribe DNA from an RNA template?","opt1":"Ligase","opt2":"Primase","opt3":"DNA polymerase","opt4":"Reverse transcriptase","ans":"Reverse transcriptase"},{"que":"What are the tiny molecules of naked circular RNA that infect plants called?","opt1":"Prions","opt2":"Tobacco mosaic virus","opt3":"Viroids","opt4":"RNA viruses","ans":"Viroids"},{"que":"What is the major component of the bacterial genome?","opt1":"None of the above","opt2":"One double-stranded, linear DNA molecule","opt3":"One double-stranded, circular DNA molecule","opt4":"One single-stranded, circular RNA molecule","ans":"One double-stranded, circular DNA molecule"},{"que":"How do bacterial cells divide and reproduce?","opt1":"Meiosis I","opt2":"Binary fission","opt3":"Meiosis II","opt4":"Binary fusion","ans":"Binary fission"},{"que":"True or False: Bacterial cells undergo genetic recombination.","opt1":"True ","opt2":"False ","ans":"True "},{"que":"What is the direct transfer of genetic material between two bacterial cells that are temporarily joined?","opt1":"Transduction","opt2":"Recombination","opt3":"Transformation","opt4":"Conjugation","ans":"Conjugation"},{"que":"Which part of the human eye contains receptors that detect light?","opt1":"Pupil","opt2":"Sclera","opt3":"Optic nerve","opt4":"Retina","ans":"Retina"},{"que":"Neurones carry nerve impulses around the human body. What are the gaps between these neurones called?","opt1":"Neurotransmitters","opt2":"Nodes","opt3":"Synapses","opt4":"Axons","ans":"Synapses"},{"que":"Plants may respond to changes in the environment. These responses are referred to as a tropism. If a plant bends towards the light, which type of tropism is the plant demonstrating?","opt1":"Thigmotropism","opt2":"Geotropism","opt3":"Thermotropism","opt4":"Phototropism","ans":"Phototropism"},{"que":"Most human body cells have 23 pairs of chromosomes. Which of the following types of human cell does NOT have 23 pairs of chromosomes?","opt1":"Juxtaglomerular","opt2":"Gametes","opt3":"Neutrophil granulocyte","opt4":"Cilia","ans":"Gametes"},{"que":"Which of the following statements is NOT true about fungi in general?","opt1":"Their cells have chitin cell walls","opt2":"They have no chloroplasts","opt3":"Their cells have a cellulose cell wall","opt4":"They reproduce using spores","ans":"Their cells have a cellulose cell wall"},{"que":"Which of the following terms describes the emission of light by a living organism?","opt1":"Chemiluminescence","opt2":"Phosphorescence","opt3":"Bioluminescence","opt4":"Fluorescence","ans":"Bioluminescence"},{"que":"What is entomology the study of?","opt1":"Development of an embryo","opt2":"Insects","opt3":"Interactions of living organisms","opt4":"Animal behavior","ans":"Insects"},{"que":"The Djungarian hamster is a species of dwarf hamster found in Siberia. It has the binomial name Phodopus sungorus. It is an air-breathing vertebrate animal and is a mammal. Which part of the hierarchy of biological classification will classify the Djungarian hamster as a mammal?","opt1":"Genus","opt2":"Order","opt3":"Class","opt4":"Family","ans":"Class"},{"que":"In general, what does the nucleus of a cell contain?","opt1":"The cellular structure","opt2":"Enzymes","opt3":"Liquid","opt4":"The cell's genetic material","ans":"The cell's genetic material"},{"que":"Pasteurization is named after which famous French chemist and microbiologist?","opt1":"Pierre Paul Émile Roux","opt2":"Auguste-Charles Marie","opt3":"Georges Girard","opt4":"Louis Pasteur","ans":"Louis Pasteur"},{"que":"In DNA, adenine pairs with thymine. But in RNA, what replaces thymine?","opt1":"uracil","opt2":"nothing - it's still thymine","opt3":"cytosine","opt4":"guanine","ans":"uracil"},{"que":"What helpful substance is cyanocobalamin better known as?","opt1":"The active ingredient in Benadryl","opt2":"Vitamin B12","opt3":"Vitamin B6","opt4":"The acid blocking medication Prilosec","ans":"Vitamin B12"},{"que":"Dinornis ","opt1":"Moas (New Zealand flightless birds that became extinct a few hundred years ago).","opt2":"An old name for Phororhacos, a two metre tall predatory South American flightless bird (Miocene)","opt3":"A giant Asian vulture (late Miocene and Palaeocene)","opt4":"A giant New Zealand eagle that preyed on moas (recent)","ans":"Moas (New Zealand flightless birds that became extinct a few hundred years ago)."},{"que":"Which groups of words mean the same thing?","opt1":"autotroph and producer","opt2":"autotroph and carnivore","opt3":"heterotroph and producer","opt4":"autotroph and consumer","ans":"autotroph and producer"},{"que":"What does telomerase do in cells?","opt1":"helps chemical reactions","opt2":"adds DNA to chromosome ends","opt3":"controls cell division","opt4":"nothing","ans":"adds DNA to chromosome ends"},{"que":"What is the life process called in which ingested food is broken down into simple molecules which are then able to be absorbed and used by the body?","opt1":"digestion","opt2":"respiration","opt3":"elimination","opt4":"absorption","ans":"digestion"},{"que":"Which of the following organelles can be seen with a light microscope and a methylene blue stain?","opt1":"nucleus","opt2":"mitochondria","opt3":"neutron","opt4":"Golgi apparatus","ans":"nucleus"},{"que":"Which does NOT belong to the kingdom Protista?","opt1":"Euglena","opt2":"Marchantia","opt3":"Paramecium","opt4":"Amoeba","ans":"Marchantia"},{"que":"Which of the following terms describes the emission of light by a living organism?","opt1":"Chemiluminescence","opt2":"Fluorescence","opt3":"Bioluminescence","opt4":"Phosphorescence","ans":"Bioluminescence"},{"que":"What type of skeleton do humans and most vertebrates have?","opt1":"Hydroskeleton","opt2":"Endoskeleton","opt3":"Eccroskeleton","opt4":"Exoskeleton","ans":"Endoskeleton"}   ]