[{"que":"Time travel (traveling to the past or future) has been a popular theme in film and fiction.  Albert Einstein offered a groundbreaking theory that gives some scientific possibility to actual time travel.  What theory is this?","opt1":"Time Travel Theory","opt2":"Wave Particle Duality Theory","opt3":"Special Relativity Theory","opt4":"Big Bang Theory","ans":"Special Relativity Theory"},{"que":"Many scientists believe that time travel to the future could be achieved.  What is one way in which a person could hypothetically travel to the future?","opt1":"Travel at a speed close to the speed of light","opt2":"Make use of very weak gravity","opt3":"None of these","opt4":"Travel slower than the speed of light","ans":"Travel at a speed close to the speed of light"},{"que":"There are various space phenomena, in theory, that astronomers could use to travel back and forth in time.  Black holes are one option. Which of the following is true about black holes?","opt1":"The sun is likely to become a black hole.","opt2":"No object can escape their gravitational pull.","opt3":"A black hole's gravity does not bend light.","opt4":"There is no real evidence that black holes exist.","ans":"No object can escape their gravitational pull."},{"que":"Cosmic strings have been singled out by scientists as possible enablers of time travel.  What is the problem with cosmic strings?","opt1":"They have not actually been found.","opt2":"Quantum mechanics do not allow for cosmic strings.","opt3":"They have a two-dimensional singularity.","opt4":"They have no effect on time or space.","ans":"They have not actually been found."},{"que":"Wormholes are the most popular \"time machine\" option for astrophysicists.\r\n","opt1":"True ","opt2":"False ","ans":"True "},{"que":"The \"Twins Paradox\" is another example used by physicists to deny hypothetical time travel.","opt1":"True ","opt2":"False ","ans":"False "},{"que":"Other scientists claim that if past time travel were possible, people from the future would have visited us by now. Astronomer Carl Sagan refuted this logic with all of the following points EXCEPT:","opt1":"Perhaps time travelers just haven't reached our time yet.","opt2":"Maybe past time travel is only possible up to the time that time travel was invented.","opt3":"Time travelers are likely exploring other planets.","opt4":"Time travelers are possibly among us, but have disguised themselves.","ans":"Time travelers are likely exploring other planets."},{"que":"What solution do time travel proponents offer to those who negate its possibility?","opt1":"Chronology protection","opt2":"Parallel universes","opt3":"Predestination","opt4":"Infinite loop of time","ans":"Parallel universes"},{"que":"If you're keeping \"current\" with electrodynamics, you are no doubt familiar with the concept of \"charge.\" An intrinsic quality of matter, it gives rise to electromagnetic forces -- including those that hold your body together and keep your computer running. Let's consider particles that can exist as free particles in nature. What is the smallest non-zero amount of charge that such a particle can carry?","opt1":"The charge of an up quark","opt2":"The charge of a down antiquark","opt3":"The charge of a proton","opt4":"There is no minimum: the charge can be arbitrarily close to zero","ans":"The charge of a proton"},{"que":"\"Constants\" -- parameters whose values do not change -- are crucial tools in any physics calculation, and the constant \"c\" is one of the most commonly used of the lot. What physical constant does c represent?","opt1":"The speed of light","opt2":"The mass of a plutonium nucleus","opt3":"The cosmological constant","opt4":"The universal gravitational constant","ans":"The speed of light"},{"que":"The \"cosmic microwave background\" is a small signal, associated with a temperature of only 2.7 degrees Celsius above absolute zero -- but it has huge implications. What theory of astrophysics does this background radiation support?","opt1":"General relativity","opt2":"The Steady State theory","opt3":"Disk theory of planetary formation","opt4":"The Big Bang theory","ans":"The Big Bang theory"},{"que":"If you ever need to calculate the force between two stationary electrical charges, you can't go wrong with \"Coulomb's law.\" It turns out that the electrical force depends not only on the amount of charge carried by the two objects, but also on the distance between those objects. How does it depend on the distance?","opt1":"The force goes as the distance squared.","opt2":"The force goes as one divided by the distance.","opt3":"The force goes as one divided by the distance cubed.","opt4":"The force goes as one divided by the distance squared.","ans":"The force goes as one divided by the distance squared."},{"que":"Here's a term representing a simple mathematical operation that underlies powerful physics -- from angular momentum to the force exerted by a magnetic field. By this method, we can combine two vectors to find a third that's perpendicular to both of them -- but we have to watch out for the right-hand rule. What is this operation, also called the vector product?","opt1":"Cross-vector rotation","opt2":"Cross product","opt3":"Coordinate product","opt4":"Cerenkov product","ans":"Cross product"},{"que":"The \"Chandrasekhar limit\" is one of the more dramatic terms of physics, dealing with events at the end of a star's life. Very old stars tend to collapse into white dwarf stars, but not all of them end that way. White dwarf stars have a maximum mass -- the Chandrasekhar limit -- and collapsing stars more massive than that must end up as a neutron star, a black hole, or a supernova explosion. What is the value of the Chandrasekhar limit?","opt1":"Three times the mass of the Earth","opt2":"1.4 times the mass of the sun","opt3":"270 times the mass of the sun","opt4":"Half the mass of the sun","ans":"1.4 times the mass of the sun"},{"que":"Objects in uniform \"circular\" motion travel at a constant speed, but their velocity is always changing direction to keep them moving along a circular path. We can calculate the acceleration of such an object as v^2/r, where v is the magnitude of the object's velocity and r is the radius of its circular path. How do we refer to a force that produces such an acceleration?","opt1":"Coriolis force","opt2":"Centripetal force","opt3":"Color force","opt4":"Centrifugal force","ans":"Centripetal force"},{"que":"Whew! After nine words and phrases, I'm just about ready to collapse -- which reminds me of yet another important phrase. In quantum mechanics, we often speak of the \"collapse of a wave function,\" a moment in which probability gives way to certainty and the universe is forced to make a choice. Under what circumstances is a wave function said to collapse?","opt1":"After the wave has been propagating for a very long time","opt2":"but before any measurement has taken place","opt3":"In the presence of a magnetic field","opt4":"As a result of a measurement","ans":"As a result of a measurement"},{"que":"We all know that the Earth is locked into orbit around the sun thanks to gravity, but exactly how far does the force of gravity go?","opt1":"An infinite distance, but at some point you won't notice it anymore.","opt2":"One light-year","opt3":"100 miles per kilogram","opt4":"Ten AUs (Astronomical Units)","ans":"An infinite distance, but at some point you won't notice it anymore."},{"que":"Speaking of gravity, what is the name for an object with so much mass that the gravitational force is generally believed to be too great to allow anything, even light, to 'escape'?","opt1":"Nebula","opt2":"Ego","opt3":"Black hole","opt4":"Pinata","ans":"Black hole"},{"que":"This unit of measurement is most commonly used when talking about things on the galactic scale, and is equal to about 3.26 light-years.  In the film 'Star Wars', it was incorrectly referred to as a unit of time, rather than distance.  What is it?","opt1":"Light-mile","opt2":"Kilogram","opt3":"Parsec","opt4":"Quasar","ans":"Parsec"},{"que":"Using complicated math and sophisticated tools, we can measure how quickly the universe is expanding.  It is going much faster than we thought it would, and to explain the difference scientists have introduced what mysterious substance?  (Hint: the name reflects the fact that it is still very mysterious)","opt1":"Flubber","opt2":"Dark energy","opt3":"Solar radiation","opt4":"Quantum paste","ans":"Dark energy"},{"que":"Due to the Doppler effect, light from a moving object is affected by that motion, resulting in the wavelength either increasing or decreasing.  What is it called when the object is moving away from us, causing the wavelength to increase? (Hint: think about the visible spectrum) ","opt1":"Redshift","opt2":"Chromatic feedback","opt3":"Solar uncertainty","opt4":"Light flux","ans":"Redshift"},{"que":"Although an atom with orbiting electrons may look like a galaxy, they are very different systems operating under different rules.  Which statement illustrates a significant difference between the two?","opt1":"Unlike planets, the orbit of an electron cannot change","opt2":"Electrons are not held in orbit by gravity","opt3":"All electrons have exactly one moon","opt4":"Every nucleus contains trace amounts of peanut butter","ans":"Electrons are not held in orbit by gravity"},{"que":"Credited to Werner Heisenberg, there is a principle that states that it is impossible to perfectly know both the position and momentum of a particle.  What is the name of this unavoidable rule of quantum physics?","opt1":"Parallax","opt2":"Uncertainty","opt3":"Bureaucracy","opt4":"Fuzzy logic","ans":"Uncertainty"},{"que":"Often referred to as \"spooky action at a distance\", two particles that interact in a certain way and are then separated can remain linked.  Later, a measurement of one particle can affect the other instantly, no matter how far apart they are.  What is this called?","opt1":"Entwining","opt2":"Twinning","opt3":"Entanglement","opt4":"Superposition","ans":"Entanglement"},{"que":"In our everyday life, a ball pushed with too little force will never make it up a steep hill, no matter how many times we try.  In the quantum world, what process would allow a particle to simply go through the hill and appear on the other side?","opt1":"Going really fast","opt2":"Tunneling","opt3":"Phase shifting","opt4":"Teleportation","ans":"Tunneling"},{"que":"Even though there are a huge number of differences between the galactic and quantum scales, there is a hypothesis which states that they are repeated layers of reality and are actually very similar in a number of surprising ways.  Based on fractals, what is the name of this concept?","opt1":"Mandelbrot universe","opt2":"Galactic mini-me","opt3":"Self-similar cosmological model","opt4":"Many-worlds theory","ans":"Self-similar cosmological model"},{"que":"Which of the following is a scalar quantity?","opt1":"the thrust needed to lift a rocket off the ground","opt2":"the effort needed to hammer a nail into wood","opt3":"the heat needed to boil some water","opt4":"the braking force needed to stop a car","ans":"the heat needed to boil some water"},{"que":"The electromotive force induced in a conductor moving at right angles to a magnetic field does not depend upon","opt1":"the speed of the conductor","opt2":"the length of the conductor","opt3":"the strength of the magnetic field","opt4":"the resistance of the conductor","ans":"the resistance of the conductor"},{"que":"In which of the following is a force of friction necessary?","opt1":"when a rocket is taking off","opt2":"when a ball is bouncing off a wall","opt3":"when a car is accelerating","opt4":"when a drum skin is vibrating","ans":"when a car is accelerating"},{"que":"The half-life of isotope X is four days and its initial mass is 32mg.\r\nWhat mass of isotope X will remain after 12 days?","opt1":"4 mg","opt2":"16 mg","opt3":"8 mg","opt4":"12 mg","ans":"4 mg"},{"que":"What is emitted by the hot metal filament in the cathode ray tube?","opt1":"protons","opt2":"electrons","opt3":"X-rays","opt4":"a-particles","ans":"electrons"},{"que":"What is the current in a 5.0 ohm resistor when the potential difference between the ends of the resistor is 2.5 V?","opt1":"2.0 A","opt2":"0.50 A","opt3":"2.5 A","opt4":"12.5 A","ans":"0.50 A"},{"que":"Which fuse should be used for a 750 W electric iron connected to a 240 V supply?","opt1":"5 A","opt2":"13 A","opt3":"3 A","opt4":"10 A","ans":"5 A"},{"que":"On what does the quality (timbre) of a sound wave depend?","opt1":"The speed of the wave","opt2":"The size of the wave","opt3":"The frequency of the wave","opt4":"The shape of the wave","ans":"The shape of the wave"},{"que":"Watt-second can be used as a unit of energy.","opt1":"Yes ","opt2":"No ","ans":"Yes "},{"que":"An electric lamp uses energy at the rate of 48 W on a 12 V supply.\r\n\r\nHow much charge passes through the lamp in 2.0 seconds?","opt1":"8 coulombs","opt2":"4 amperes","opt3":"8 amperes","opt4":"48 coulombs","ans":"8 coulombs"}]