[{"que":"In what year did Manchester United first win the European Cup?","opt1":1968,"opt2":1966,"opt3":1956,"opt4":1958,"ans":"1968"},{"que":"Who did Manchester United beat in the final, to win their first European Cup?","opt1":"AC Milan","opt2":"Benfica","opt3":"Ajax Amserdam","opt4":"Real Madrid","ans":"Benfica"},{"que":"Who did Alex Ferguson succeed as manager?","opt1":"Tommy Docherty","opt2":"Frank O'Farrell","opt3":"Ron Atkinson","opt4":"Dave Sexton","ans":"Ron Atkinson"},{"que":"What club did Manchester United buy Roy Keane from?","opt1":"Tottenham Hotspur","opt2":"Everton","opt3":"Nottingham Forest","opt4":"Newcastle United","ans":"Nottingham Forest"},{"que":"Who scored the winning goal for United in the 1999 Champions League final?","opt1":"Ryan Giggs","opt2":"Teddy Sherringham","opt3":"Dwight Yorke","opt4":"Ole Gunnar Solskjaer","ans":"Ole Gunnar Solskjaer"},{"que":"On 17th December 2000 Manchester United lost at home 0-1 to Liverpool. Who was the last team (before this loss0 to beat United at Old Trafford in a league game?","opt1":"Tottenham Hotspur","opt2":"Leicester City","opt3":"Middlesborough","opt4":"Arsenal","ans":"Middlesborough"},{"que":"What country is Quinton Fortune from?","opt1":"South Africa","opt2":"Australia","opt3":"Spain","opt4":"Nigeria","ans":"South Africa"},{"que":"Which club did Peter Schmeichel join when he left United?","opt1":"Benfica","opt2":"Athletico Madrid","opt3":"Rayo Vallecano","opt4":"Sporting Lisbon","ans":"Sporting Lisbon"},{"que":"How many points did United win the league by in season 1999-00?","opt1":22,"opt2":19,"opt3":18,"opt4":20,"ans":"18"},{"que":"Who scored the goal which is said to have saved Alex Ferguson's job as manager of Manchester United?","opt1":"Brian Mc Clair","opt2":"Norman Whiteside","opt3":"Mark Hughes","opt4":"Mark Robins","ans":"Mark Robins"},{"que":"At which stadium do Manchester United play their home games?","opt1":"City of Manchester Stadium","opt2":"St James Park","opt3":"Anfield","opt4":"Old Trafford","ans":"Old Trafford"},{"que":"Who set the Manchester United goal scoring record in the 1970s?","opt1":"Bobby Charlton","opt2":"Denis Law","opt3":"George Best","opt4":"Andrew Cole","ans":"Bobby Charlton"},{"que":"When Manchester Utd won the FA Premier League Premiership in 2002-03 it was their ______ premiership title?","opt1":"8th","opt2":"10th","opt3":"4th","opt4":"6th","ans":"8th"},{"que":"Who became Manchester United's record signing in 2002?","opt1":"Dwight Yorke","opt2":"Rio Ferdinand","opt3":"Juan Sebastian Veron","opt4":"Ruud Van Nistelrooy","ans":"Rio Ferdinand"},{"que":"Why was Rio Ferdinand banned for 8 months in January 2004?","opt1":"He punched a fan during a match","opt2":"He failed a drug test","opt3":"Because he missed a routine drug test","opt4":"He assaulted a referee","ans":"Because he missed a routine drug test"},{"que":"In the 1999 Champions League final, Manchester United scored two late goals to win the title. Who were the scorers?","opt1":"Ole Gunnar Solsjaer & Dwight Yorke","opt2":"Teddy Sheringham & Andy Cole","opt3":"Teddy Sheringham & Ole Gunnar Solskjaer","opt4":"Teddy Sheringham & Ryan Giggs","ans":"Teddy Sheringham & Ole Gunnar Solskjaer"},{"que":"Manchester Utd won the European Cup/Champions League in 1999.  When was the last time they had won it?","opt1":1970,"opt2":1967,"opt3":1971,"opt4":1968,"ans":"1968"},{"que":"Who was the Manchester United manager before the appointment of Alex Ferguson in November 1986?","opt1":"Tommy Docherty","opt2":"Scott Duncan","opt3":"Ron Atkinson","opt4":"Dave Sexton","ans":"Ron Atkinson"},{"que":"What was Manchester United originally called when they were first created?","opt1":"Newton United","opt2":"Manchester City","opt3":"Newton Heath","opt4":"Manchester Town","ans":"Newton Heath"},{"que":"Which number are David Beckham, Eric Cantona, Bryan Robson, and George Best, all famous for wearing with Manchester United? ","opt1":9,"opt2":10,"opt3":11,"opt4":7,"ans":"7"},{"que":"Which player, who could rightfully be described as 'The First Busby Babe', started his United career at full back, briefly became a winger, before reverting to full back?","opt1":"Ian Greaves","opt2":"Bill Foulkes","opt3":"Roger Byrne","opt4":"Geoff Bent","ans":"Roger Byrne"},{"que":"Which member of this side, the first of them to make a first team appearance for United, didn't make another one for over two and a half years, and then went on to play over 200 games?","opt1":"Jackie Blanchflower","opt2":"Mark Jones","opt3":"Ray Wood","opt4":"Bill Foulkes","ans":"Ray Wood"},{"que":"Which member of the team, the second player to make it into the first team at Old Trafford, made only nine appearances in his first four seasons at Old Trafford, including none at all in one of those seasons, and yet was ever-present when they won their first League title?","opt1":"Mark Jones","opt2":"David Pegg","opt3":"Ray Wood","opt4":"Liam Whelan","ans":"Mark Jones"},{"que":"When signing which player, one of only three purchased by Matt Busby when creating 'The Busby Babes', did he write a cheque for the agreed fee less one pound, and then give that one pound to the other club's tea lady who was busily serving refreshments?","opt1":"Tommy Taylor","opt2":"Johnny Berry","opt3":"Liam Whelan","opt4":"Ray Wood","ans":"Tommy Taylor"},{"que":"Which wing-half made his senior debut for Manchester United at the age of 16 years and 105 days?","opt1":"Duncan Edwards","opt2":"Jeff Whitefoot","opt3":"Eddie Colman","opt4":"Wilf Mc Guinness","ans":"Jeff Whitefoot"},{"que":"Having taken over as Manager in 1945, Matt Busby's 'first great team' of Crompton, Carey, Aston, Anderson, Chilton, Cockburn, Delaney, Morris, Rowley, Pearson, and Mitten, finished runners-up in the League in 1947, 1948, 1949, and 1950, missing the League title by just one point in his first season 1947, and a possible 'Double' in 1948 when they won the FA Cup - beating Aston Villa 6-4; Liverpool 3-0; Charlton Athletic 2-0; Preston North End 4-1; Derby County 3-1; and Blackpool 4-2 in the final. \r\n\r\nWith Tommy McNulty and Johnny Downie coming in for Anderson and Morris, and Berry and Byrne for Delaney and Mitten, United finally won the Championship in 1952, after which the predominantly teenage players, dubbed 'The Babes' by Tom Jackson of 'The Manchester Evening News', a nickname Matt Busby did not particularly like, began to come into the side. \r\n\r\nBy 1953, most of them had begun to establish themselves in the first team, but in what season did they win their first League Championship title? ","opt1":"1955-56","opt2":"1956-57","opt3":"1953-54","opt4":"1954-55","ans":"1955-56"},{"que":"In 1955, the Football League had refused to allow then Champions Chelsea to take part in the new European Cup. A year later Matt Busby defied them, amid all sorts of warnings about what would happen to United if European games interfered with their League or Cup schedule at home, and took his young team into what he saw as the future of football. In September 1956, in their first European Cup tie, which team did United beat 12-1 on aggregate?","opt1":"Borussia Dortmund","opt2":"Shamrock Rovers","opt3":"Anderlecht","opt4":"Athletico Bilbao","ans":"Anderlecht"},{"que":"Which wing-half made his senior debut for Manchester United at the age of 16 years and 185 days?","opt1":"Jackie Blanchflower","opt2":"Duncan Edwards","opt3":"Eddie Colman","opt4":"Mark Jones","ans":"Duncan Edwards"},{"que":"While returning from which European Cup tie did the Manchester United party encounter a snowbound airport, in an eerie premonition of what was to befall them a year later at Munich?","opt1":"Anderlecht","opt2":"Athletico Bilbao","opt3":"Real Madrid","opt4":"Borussia Dortmund","ans":"Athletico Bilbao"},{"que":"On 4th May, 1957, United were poised to make history by becoming the first team in the 20th Century to win the elusive 'Double' of League Championship and FA Cup in the one season. \r\n\r\nHaving secured their second successive League title, scoring over 100 goals along the way, they were also through to the Cup Final at Wembley.  Which team did they meet there?","opt1":"Blackpool","opt2":"Aston Villa","opt3":"Bolton Wanderers","opt4":"Wolverhampton Wanderers","ans":"Aston Villa"}]