[{"que":"The American boom in golf began shortly after this 20 year old American amateur won the U.S. Open in 1913. ","opt1":"Bobby Jones","opt2":"Francis Ouimet","opt3":"Ted Ray","opt4":"Harry Vardon","ans":"Francis Ouimet"},{"que":"When Tommy Armour, an American citizen but born in Scotland, won the U.S. Open in 1927, it would be the last time a foreign born player would win this title in 38 years. Who broke the jinx?","opt1":"Tony Jacklin","opt2":"Bobby Locke","opt3":"Greg Norman","opt4":"Gary Player","ans":"Gary Player"},{"que":"Bobby Locke was the first great South African player having won the British Open in 1949, 1950, and 1952. Essentially, he mentored Gary Player who took Ernie Els and Retief Goosen under his wing. Now a number of South African's are making waves on the PGA tour. Of the listed players, who is NOT a native of South Africa?","opt1":"Trevor Immelman","opt2":"Tim Clark","opt3":"Ian Poulter","opt4":"Rory Sabbatini","ans":"Ian Poulter"},{"que":"In 2004, the first professional golfer from the country of India qualified to play on the U.S. PGA tour. Who was he?","opt1":"Arjun Atwal","opt2":"Vivak Bhandari","opt3":"Arjun Singh","opt4":"Jeev Milka Singh","ans":"Arjun Atwal"},{"que":"Major winner Vijay Singh hailed from which tropical island nation?","opt1":"Indonesia","opt2":"Fiji","opt3":"Tonga","opt4":"Tahiti","ans":"Fiji"},{"que":"Australia is a great golfing nation and more PGA players hail from Oz than any other country except for the U.S.  Norman Van Nida is deemed to be the \"Father of Australian golf\" although his impact on the game outside of Australia was pretty minimal. One of his students did rather well however, having won a total of five British Open championships in the 1950s and 1960s. Who was he?","opt1":"Bruce Devlin","opt2":"Kel Nagle","opt3":"Henry Cotton","opt4":"Peter Thomson","ans":"Peter Thomson"},{"que":"From New Zealand, this player was most famous for being the only left-handed player to win a major - the 1963 British Open. Since Mike Weir's victory in the Masters in 2003, he now is just the first lefty to win a major. Who was he?","opt1":"Max Faulkner","opt2":"Bob Charles","opt3":"Fred Daly","opt4":"Charles Roberts","ans":"Bob Charles"},{"que":"The first Japanese player to win a PGA tour event was whom?","opt1":"Jumbo Ozaki","opt2":"Shigeki Maruyama","opt3":"Isao Aoki","opt4":"David Ishii","ans":"Isao Aoki"},{"que":"Which of these golfers is NOT from South Korea.","opt1":"My Hyun Kim","opt2":"Se Ri Pak","opt3":"Aree Song","opt4":"K.J. Choi","ans":"Aree Song"},{"que":"Mike Weir seems on track to become the winningest PGA pro to come from \"The Great White North\".  The player he was chasing won 8 events during his career. Who was this Canadian?","opt1":"Stan Leonard","opt2":"Al Balding","opt3":"Dave Barr","opt4":"George Knudson","ans":"George Knudson"},{"que":"Chi Chi Rodriguez is without question the best player to come from the Carribbean. Where was he born?","opt1":"Jamaica","opt2":"Puerto Rico","opt3":"Dominican Republic","opt4":"Cuba","ans":"Puerto Rico"},{"que":"Argentina has always been at the forefront of golfing nations in South America, the first club being established there in 1892 by British ex-pats. Which Argentinian native won the British Open in 1967 and many PGA tour events over his long career?","opt1":"Angel Miguel","opt2":"Tony Cerda","opt3":"Roberto Di Vicenzo","opt4":"Manuel Pinero","ans":"Roberto Di Vicenzo"},{"que":"Argentina continues to produce many fine players. Of the following players, who is NOT Argentinian?","opt1":"Angel Cabrera","opt2":"Carlos Franco","opt3":"Eduardo Romero","opt4":"Vicente Fernandez","ans":"Carlos Franco"},{"que":"Who was the first player born in a country that was once on the other side of the \"Iron Curtain\" to play on the PGA tour?","opt1":"Ryan Hietala","opt2":"Alex Cejka","opt3":"Omar Uresti","opt4":"Niclas Fasth","ans":"Alex Cejka"},{"que":"Although Spain has produced a number of decent players over the years, their first truly \"great\" player went by which nickname?","opt1":"Chimo","opt2":"El Nino","opt3":"Seve","opt4":"El Tigre","ans":"Seve"},{"que":"Bernhard Langer was one of the best golfers to come from this country. ","opt1":"The Netherlands","opt2":"Switzerland","opt3":"Germany","opt4":"Austria","ans":"Germany"},{"que":"Sweden has an astounding junior golf program that has produced a wealth of talent in recent years. Which of the following players was not a product of this program?","opt1":"Annika Sorenstam","opt2":"Frederik Jacobson","opt3":"Tomas Bjorn","opt4":"Jesper Parnevik","ans":"Tomas Bjorn"},{"que":"In 1999, a Frenchman suffered a meltdown on the 18th hole at Carnoustie that ultimately cost him the British Open in a playoff. Who was this poor soul? ","opt1":"Thomas Levet","opt2":"Raphael Jacquelin","opt3":"Jean Van de Velde","opt4":"Gregory Havret","ans":"Jean Van de Velde"},{"que":"Italy, surprisingly, has not contributed that many world class players to the international stage. This player, however, probably was the finest losing a British Open in a playoff to John Daly and beating Tiger Woods in a crucial Ryder Cup match mano-a-mano.","opt1":"Tony Manero","opt2":"Costantino Rocca","opt3":"Baldevino Dassu","opt4":"John Boccabella","ans":"Costantino Rocca"},{"que":"Who was the first New Zealand player of Maori descent to win a PGA tour event? ","opt1":"Phil Tataurangi","opt2":"Michael Campbell","opt3":"Greg Perks","opt4":"Frank Nobilo","ans":"Phil Tataurangi"},{"que":"Trevor Dodds who won the 1998 Greater Greensboro Classic is from which African nation?","opt1":"Malawi","opt2":"Kenya","opt3":"Lesotho","opt4":"Namibia","ans":"Namibia"},{"que":"In 2004, a golfer born in mainland China received an invitation to participate in the Masters. What was his name?","opt1":"Lian-Wei Zhang","opt2":"Yong-Eon Yang","opt3":"Wen-Tang Lin","opt4":"T.C. Chen","ans":"Lian-Wei Zhang"},{"que":"Nick Price was born in?.","opt1":"China ","opt2":"Durban ","opt3":"Australia","opt4":"India","ans":"Durban"},{"que":"All these Canadian golfers won at least one PGA tour event except for who?","opt1":"Richard Zokol","opt2":"Ian Leggatt","opt3":"Moe Norman","opt4":"Dan Halldorson","ans":"Moe Norman"},{"que":"Who is the greatest \"Cablinasian\" golfer in the world?","opt1":"Tiger Woods","opt2":"Ian Leggatt","opt3":"Dan Halldorson","opt4":"Moe Norman","ans":"Tiger Woods"}]