[{"que":"What does GPS stand for?","opt1":"Global Positioning System","opt2":"Going Places Sometimes","opt3":"Global Positioning Satellites","opt4":"Government Positioning Satellites","ans":"Global Positioning System"},{"que":"When was the first GPS satellite launched?  This might be earlier than you'd think...","opt1":1776,"opt2":1978,"opt3":1963,"opt4":1994,"ans":"1978"},{"que":"How many GPS satellites were there when the system was originally set up?","opt1":10,"opt2":36,"opt3":24,"opt4":50,"ans":"24"},{"que":"What is the minimum number of GPS satellites you need to receive information from in order to get a fix on your horizontal position?","opt1":2,"opt2":3,"opt3":5,"opt4":"1","ans":"3"},{"que":"What kind of information does a GPS satellite transmit to the GPS receiver?","opt1":"All of these","opt2":"The location of the GPS satellite","opt3":"The time the message was sent","opt4":"The orbital information for all the other GPS satellites in the fleet","ans":"All of these"},{"que":"A GPS receiver determines its location by:\r\n1)  Receiving information from a satellite on its location and what time the signal was sent;\r\n2)  Comparing the difference in time between when the signal was sent from a satellite and when it was received by the receiver;\r\n3)  Using that number, and the speed of light, to calculate how far away the satellite must be;\r\n4)  Using this information from several satellites to pinpoint the exact location\r\n5) Converting this to the coordinate system of choice","opt1":"True ","opt2":"False ","ans":"True "},{"que":"How is DGPS different from normal GPS?","opt1":"It uses two receivers, one at a known location and one at an unknown location","opt2":"It is less accurate than GPS","opt3":"All of these","opt4":"It is only available to professionals","ans":"It uses two receivers, one at a known location and one at an unknown location"},{"que":"What is the biggest source of error for a DGPS?","opt1":"Signal multi-pathing","opt2":"Orbital errors","opt3":"Refraction in the ionosphere and troposphere","opt4":"Receiver clock error","ans":"Signal multi-pathing"},{"que":"You see that your GPS unit is WAAS-enabled.  What's so great about WAAS?","opt1":"It increases the number of locations your GPS unit can store","opt2":"It improves the accuracy and precision of location measurements","opt3":"It lengthens the battery life of the GPS receiver","opt4":"It is an extra-long antenna that lets you pick up a signal from more GPS satellites","ans":"It improves the accuracy and precision of location measurements"},{"que":"About what is the accuracy for a handheld GPS (with DGPS and WAAS) you might go out and buy?","opt1":"Meters horizontally, a few tens of meters vertically","opt2":"Tens of meters horizontally, tens of meters vertically","opt3":"Centimeters horizontally, millimeters vertically","opt4":"Centimeters horizontally, meters vertically","ans":"Meters horizontally, a few tens of meters vertically"}]